%%%------------------------------------------------	
%%% File    : tpl_scene.erl	
%%% Author  : table_to_erlang	
%%% Created : 
%%% Description:从数据库表temp_scene生成
%%% WARNING:程序生成，请不要增加手工代码！
%%%------------------------------------------------    	
 	
-module(tpl_scene). 	
-compile(export_all). 	
	
get(101)->
	{temp_scene, 101, <<"新手村">>, 2001001, 1, 0, 1, 1, 100, 0, 1, <<"彼岸花开黄泉路，千载傲骨幽冥渡">>, 0, 101, 2, 2, 5000, undefined, 0, 0};	
get(103)->
	{temp_scene, 103, <<"天州城">>, 2003001, 3, 0, 1, 20, 100, 0, 1, <<"霓裳欲向大罗天，青山远近九皇州">>, 0, 101, 4, 4, 5000, undefined, 0, 0};	
get(104)->
	{temp_scene, 104, <<"星罗大陆">>, 2002001, 2, 15, 1, 10, 100, 0, 1, <<"青天唯见三两星，罗绮辉映紫金堤">>, 0, 101, 6, 6, 5000, undefined, 0, 0};	
get(105)->
	{temp_scene, 105, <<"紫竹林">>, 2002002, 2, 15, 1, 21, 100, 0, 1, <<"紫台迢迢皆过往，竹下忘言对清茗">>, 0, 101, 8, 8, 3000, undefined, 0, 0};	
get(106)->
	{temp_scene, 106, <<"蛮荒丛林">>, 2002003, 2, 15, 1, 30, 100, 0, 1, <<"蛮溪边夷莫敢侵，荒芜满城逢旧颜">>, 0, 101, 10, 10, 5000, undefined, 0, 0};	
get(107)->
	{temp_scene, 107, <<"炎魔谷">>, 2002004, 2, 15, 1, 31, 100, 0, 1, <<"炎暑郁蒸无处避，魔王轮幢自摧折">>, 0, 101, 12, 12, 5000, undefined, 0, 0};	
get(108)->
	{temp_scene, 108, <<"瀚海沙漠">>, 2002005, 2, 15, 0, 40, 100, 0, 1, <<"瀚海龙城皆习战，海上亭台山下烟">>, 0, 101, 14, 14, 5000, undefined, 0, 0};	
get(109)->
	{temp_scene, 109, <<"不老峰">>, 2002006, 2, 15, 1, 41, 100, 0, 1, <<"不堪吟罢西风起，老逢佳景唯惆怅">>, 0, 101, 16, 16, 5000, undefined, 0, 0};	
get(110)->
	{temp_scene, 110, <<"乱神海">>, 2002007, 2, 15, 0, 51, 100, 0, 1, <<"乱世未必长离别，神海幻山路无边">>, 0, 101, 18, 18, 5000, undefined, 0, 0};	
get(111)->
	{temp_scene, 111, <<"九幽之地">>, 2002008, 2, 15, 0, 60, 100, 0, 1, <<"九转丹成最上仙，幽居喜见凡草生">>, 0, 101, 20, 20, 5000, undefined, 0, 0};	
get(112)->
	{temp_scene, 112, <<"堕仙岭">>, 2002009, 2, 15, 0, 61, 100, 0, 1, <<"堕凡忘仙气数尽，仙宫深处却无山">>, 0, 101, 22, 22, 5000, undefined, 0, 0};	
get(113)->
	{temp_scene, 113, <<"无尽雪原">>, 2002010, 2, 15, 0, 71, 100, 0, 1, <<"闲云幽水皆无尽，雪原仙山魔重重">>, 0, 101, 24, 24, 5000, undefined, 0, 0};	
get(200)->
	{temp_scene, 200, <<"太元仙府">>, 0, 4, 7, 0, 1, 100, 0, 1, <<"太元清虚修真路，仙府花开无人知">>, 0, 101, 26, 26, 5000, undefined, 0, 0};	
get(201)->
	{temp_scene, 201, <<"幽林梦境">>, 0, 4, 7, 0, 1, 100, 0, 1, <<"幽林深处少人行，梦境梦回梦里情">>, 0, 101, 28, 28, 5000, undefined, 0, 0};	
get(202)->
	{temp_scene, 202, <<"试炼之路">>, 0, 4, 7, 0, 1, 100, 0, 1, <<"今有壮士豪情志，尽在试炼数英名">>, 0, 101, 30, 30, 5000, undefined, 0, 0};	
get(203)->
	{temp_scene, 203, <<"冰雪幻境">>, 0, 4, 7, 0, 1, 100, 0, 1, <<"不辞冰雪修仙人，幻境美景多险恶">>, 0, 101, 32, 32, 5000, undefined, 0, 0};	
get(204)->
	{temp_scene, 204, <<"万归仙岛">>, 0, 4, 7, 0, 1, 100, 0, 1, <<"万物尽生道行中，归人何处觅归途">>, 0, 101, 34, 34, 5000, undefined, 0, 0};	
get(205)->
	{temp_scene, 205, <<"桃源幻境">>, 0, 4, 7, 0, 1, 100, 0, 1, <<"桃源桃花相映红，不见当年幻境春">>, 0, 101, 36, 36, 5000, undefined, 0, 0};	
get(206)->
	{temp_scene, 206, <<"五行之地">>, 0, 4, 7, 0, 1, 100, 0, 1, <<"天地阴阳自生化，五行奥秘待人识">>, 0, 101, 38, 38, 5000, undefined, 0, 0};	
get(207)->
	{temp_scene, 207, <<"九渊神域">>, 0, 4, 7, 0, 1, 100, 0, 1, <<"九渊圣域擂战鼓，仙界传扬英雄名">>, 0, 101, 40, 40, 5000, undefined, 0, 0};	
get(208)->
	{temp_scene, 208, <<"锁妖塔">>, 0, 4, 7, 0, 1, 100, 0, 1, <<"锁妖塔中锁妖龙，留待真人灭妖时">>, 0, 101, 42, 42, 5000, undefined, 0, 0};	
get(209)->
	{temp_scene, 209, <<"金谷棋局">>, 0, 4, 7, 0, 1, 100, 0, 1, <<"观棋不语真君子，局中自有金万千">>, 0, 101, 44, 44, 5000, undefined, 0, 0};	
get(_)->	
	[].	
