%%%------------------------------------------------	
%%% File    : tpl_drop_main.erl	
%%% Author  : table_to_erlang	
%%% Created : 
%%% Description:从数据库表temp_drop_main生成
%%% WARNING:程序生成，请不要增加手工代码！
%%%------------------------------------------------    	
 	
-module(tpl_drop_main). 	
-compile(export_all). 	
	
get(20001)->
	{temp_drop_main, 20001, [{1001,10000}]};	
get(20002)->
	{temp_drop_main, 20002, [{1002,10000}]};	
get(20003)->
	{temp_drop_main, 20003, [{1003,15},{1004,15}]};	
get(40005)->
	{temp_drop_main, 40005, [{40005,10000}]};	
get(40007)->
	{temp_drop_main, 40007, [{40007,10000}]};	
get(40013)->
	{temp_drop_main, 40013, [{40013,10000}]};	
get(40020)->
	{temp_drop_main, 40020, [{40020,10000}]};	
get(40021)->
	{temp_drop_main, 40021, [{40021,10000}]};	
get(40022)->
	{temp_drop_main, 40022, [{40022,10000}]};	
get(40023)->
	{temp_drop_main, 40023, [{40023,10000}]};	
get(40024)->
	{temp_drop_main, 40024, [{40024,10000}]};	
get(40025)->
	{temp_drop_main, 40025, [{40025,10000}]};	
get(40026)->
	{temp_drop_main, 40026, [{40026,10000}]};	
get(40027)->
	{temp_drop_main, 40027, [{40027,10000}]};	
get(40028)->
	{temp_drop_main, 40028, [{40028,10000}]};	
get(40029)->
	{temp_drop_main, 40029, [{40029,10000}]};	
get(40030)->
	{temp_drop_main, 40030, [{40030,10000}]};	
get(40031)->
	{temp_drop_main, 40031, [{40031,10000}]};	
get(40032)->
	{temp_drop_main, 40032, [{40032,10000}]};	
get(40033)->
	{temp_drop_main, 40033, [{40033,10000}]};	
get(40034)->
	{temp_drop_main, 40034, [{40034,10000}]};	
get(40035)->
	{temp_drop_main, 40035, [{40035,10000}]};	
get(40036)->
	{temp_drop_main, 40036, [{40036,10000}]};	
get(40037)->
	{temp_drop_main, 40037, [{40037,10000}]};	
get(40038)->
	{temp_drop_main, 40038, [{40038,10000}]};	
get(40039)->
	{temp_drop_main, 40039, [{40039,10000}]};	
get(40040)->
	{temp_drop_main, 40040, [{40040,10000}]};	
get(40041)->
	{temp_drop_main, 40041, [{40041,10000}]};	
get(40042)->
	{temp_drop_main, 40042, [{40042,10000}]};	
get(40043)->
	{temp_drop_main, 40043, [{40043,10000}]};	
get(40044)->
	{temp_drop_main, 40044, [{40044,10000}]};	
get(40045)->
	{temp_drop_main, 40045, [{40045,10000}]};	
get(40046)->
	{temp_drop_main, 40046, [{40046,10000}]};	
get(40047)->
	{temp_drop_main, 40047, [{40047,10000}]};	
get(40048)->
	{temp_drop_main, 40048, [{40048,10000}]};	
get(40049)->
	{temp_drop_main, 40049, [{40049,10000}]};	
get(40050)->
	{temp_drop_main, 40050, [{40050,10000}]};	
get(40051)->
	{temp_drop_main, 40051, [{40051,10000}]};	
get(40052)->
	{temp_drop_main, 40052, [{40052,10000}]};	
get(40053)->
	{temp_drop_main, 40053, [{40053,10000}]};	
get(40054)->
	{temp_drop_main, 40054, [{40054,10000}]};	
get(40055)->
	{temp_drop_main, 40055, [{40055,10000}]};	
get(40056)->
	{temp_drop_main, 40056, [{40056,10000}]};	
get(40057)->
	{temp_drop_main, 40057, [{40057,10000}]};	
get(40058)->
	{temp_drop_main, 40058, [{40058,10000}]};	
get(40059)->
	{temp_drop_main, 40059, [{40059,10000}]};	
get(40060)->
	{temp_drop_main, 40060, [{40060,10000}]};	
get(40061)->
	{temp_drop_main, 40061, [{40061,10000}]};	
get(40062)->
	{temp_drop_main, 40062, [{40062,10000}]};	
get(40063)->
	{temp_drop_main, 40063, [{40063,10000}]};	
get(40064)->
	{temp_drop_main, 40064, [{40064,10000}]};	
get(40065)->
	{temp_drop_main, 40065, [{40065,10000}]};	
get(40066)->
	{temp_drop_main, 40066, [{40066,10000}]};	
get(40067)->
	{temp_drop_main, 40067, [{40067,10000}]};	
get(40068)->
	{temp_drop_main, 40068, [{40068,10000}]};	
get(40069)->
	{temp_drop_main, 40069, [{40069,10000}]};	
get(40070)->
	{temp_drop_main, 40070, [{40070,10000}]};	
get(40071)->
	{temp_drop_main, 40071, [{40071,10000}]};	
get(40072)->
	{temp_drop_main, 40072, [{40072,10000}]};	
get(40073)->
	{temp_drop_main, 40073, [{40073,10000}]};	
get(40074)->
	{temp_drop_main, 40074, [{40074,10000}]};	
get(40075)->
	{temp_drop_main, 40075, [{40075,10000}]};	
get(40076)->
	{temp_drop_main, 40076, [{40076,10000}]};	
get(40077)->
	{temp_drop_main, 40077, [{40077,10000}]};	
get(40078)->
	{temp_drop_main, 40078, [{40078,10000}]};	
get(40079)->
	{temp_drop_main, 40079, [{40079,10000}]};	
get(40080)->
	{temp_drop_main, 40080, [{40080,10000}]};	
get(40081)->
	{temp_drop_main, 40081, [{40081,10000}]};	
get(40082)->
	{temp_drop_main, 40082, [{40082,10000}]};	
get(40083)->
	{temp_drop_main, 40083, [{40083,10000}]};	
get(40084)->
	{temp_drop_main, 40084, [{40084,10000}]};	
get(40085)->
	{temp_drop_main, 40085, [{40085,10000}]};	
get(40086)->
	{temp_drop_main, 40086, [{40086,10000}]};	
get(40087)->
	{temp_drop_main, 40087, [{40087,10000}]};	
get(40088)->
	{temp_drop_main, 40088, [{40088,10000}]};	
get(40089)->
	{temp_drop_main, 40089, [{40089,10000}]};	
get(40090)->
	{temp_drop_main, 40090, [{40090,10000}]};	
get(40091)->
	{temp_drop_main, 40091, [{40091,10000}]};	
get(40092)->
	{temp_drop_main, 40092, [{40092,10000}]};	
get(40093)->
	{temp_drop_main, 40093, [{40093,10000}]};	
get(40094)->
	{temp_drop_main, 40094, [{40094,10000}]};	
get(40095)->
	{temp_drop_main, 40095, [{40095,10000}]};	
get(40096)->
	{temp_drop_main, 40096, [{40096,10000}]};	
get(40097)->
	{temp_drop_main, 40097, [{40097,10000}]};	
get(40098)->
	{temp_drop_main, 40098, [{40098,10000}]};	
get(40099)->
	{temp_drop_main, 40099, [{40099,10000}]};	
get(_)->	
	[].	
