%%%------------------------------------------------	
%%% File    : tpl_task.erl	
%%% Author  : table_to_erlang	
%%% Created : 
%%% Description:从数据库表temp_task生成
%%% WARNING:程序生成，请不要增加手工代码！
%%%------------------------------------------------    	
 	
-module(tpl_task). 	
-compile(export_all). 	
	
get(1)->
	{tpl_task, 1, 0, 10001, 101, 10002, 101, 0, [{10002}],<<"修仙之路">>, <<"找神兵守卫">>, [{"%s，大事不好，最近仙界中魔族频现，乱象丛生，我们都得去天州城集合！对抗魔族！"}],[{"魔族已被封印万年，很多人都忘记了当年的仙魔大战，%s，你可还记得？"},{"大叔，我只是个新晋级的小仙人而已……"}],-1, 1, 0, 2, 0, 0, [{0,0,541004201,70},{0,0,531004201,100},{0,0,588001001,1}],[],0, 2, 0};	
get(2)->
	{tpl_task, 2, 0, 10002, 101, 10002, 101, 2, [{11001,1,0}],<<"神兵在手">>, <<"得武器">>, [{"昔日轮回道人挥剑封印魔门，留下镇妖灵剑碎片在此，试试你的缘法吧！"}],[{"竟然顺利取得神兵？%s，难道这预示了你能再现轮回道人当日的辉煌？"},{"（窃喜）难道我是传说中的主角？"}],1, 2, 0, 2, 0, 0, [{0,0,541004201,80},{0,0,551004201,20},{1,1,221001203,1},{1,2,221002203,1},{1,3,221003203,1}],[],0, 3, 0};	
get(3)->
	{tpl_task, 3, 0, 10002, 101, 10002, 101, 0, [{10002}],<<"封印记忆">>, <<"找神兵守卫">>, [{"神兵中封印着轮回道人封印魔门的记忆，且看你能否有缘得到他的点化？"}],[{"轮回道人因封印魔门，得到仙界景仰！努力登临山河榜，，笑傲仙界，封印魔门吧！"},{"好！我要努力修炼，早日登榜，封印魔门！"}],2, 3, 0, 2, 0, 0, [{0,0,541004201,110},{0,0,531004201,110}],[],0, 4, 0};	
get(4)->
	{tpl_task, 4, 0, 10002, 101, 10059, 101, 1, [{20001,3,0}],<<"小试身手">>, <<"杀山精">>, [{"想登山河榜，成为封印魔门的英雄，试炼不可少！去教训几只山精练手吧。"}],[{"看身手真是山河榜的热门人物呀，我喜欢！"},{"（脸红）多谢仙子姐姐厚爱。"}],3, 4, 0, 2, 0, 0, [{0,0,541004201,135},{0,0,551004201,20}],[],0, 5, 0};	
get(5)->
	{tpl_task, 5, 0, 10059, 101, 10049, 101, 2, [{11003,1,0}],<<"仙君指教">>, <<"得龙精草">>, [{"玄明仙君会告诉你封印魔门、登山河榜的秘籍，别忘了采些龙精草孝敬他。"}],[{"%s，看你精气神十足，是个仙界的好苗子，封印魔门的任务看来有望了！"},{"嘿嘿，哪里哪里！"}],4, 4, 0, 2, 0, 0, [{0,0,541004201,135},{0,0,531004201,110}],[],0, 6, 0};	
get(6)->
	{tpl_task, 6, 0, 10049, 101, 10049, 101, 1, [{20003,5,0}],<<"试炼身手">>, <<"杀树妖">>, [{"%s，近来灵犀谷中树妖作怪，先去那边捕捉几只树妖来让我看看身手。"}],[{"不错，%s，你进步很快，看来是把往事都告诉你的时候了。"},{"我现在感觉很良好，区区树妖不在话下！"}],5, 5, 0, 2, 0, 0, [{0,0,541004201,150},{0,0,551004201,20}],[],0, 7, 0};	
get(7)->
	{tpl_task, 7, 0, 10049, 101, 10050, 101, 0, [{10050}],<<"大有前途">>, <<"找紫霞仙子">>, [{"紫霞仙子曾位列山河榜首，有她指点你的修炼，定能大有长进。"}],[{"骨骼清奇，一定能修炼成封印魔门的的英雄，登临山河榜就更不在话下了！"},{"美女的夸奖听起来就是开心…"}],6, 5, 0, 2, 0, 0, [{0,0,541004201,150},{0,0,531004201,120}],[],0, 8, 0};	
get(8)->
	{tpl_task, 8, 0, 10050, 101, 10050, 101, 1, [{20003,5,0}],<<"水莲异事">>, <<"杀树妖">>, [{"让我瞧瞧你的身手，去教训几只树妖再说。"}],[{"一片魔门封印的碎片落入水莲洞，里面的小妖原本纯洁善良，如今却被污染魔化。"},{"碎片？集齐7块可以召唤神龙吗？"}],7, 6, 0, 2, 0, 0, [{0,0,541004201,330},{0,0,551004201,30}],[],0, 9, 0};	
get(9)->
	{tpl_task, 9, 0, 10050, 101, 10050, 101, 9, [{305}],<<"炼化封印">>, <<"找紫霞仙子">>, [{"洞中莲妖已经入魔，十分凶猛，随我前去，可要小心从事！"}],[{"想要重新封印魔门，就要将所有的碎片收集炼化。"},{"（惊恐）请问这个碎片一共有多少块？"}],8, 7, 0, 2, 0, 0, [{0,0,541004201,470},{0,0,531004201,130}],[],0, 10, 0};	
get(10)->
	{tpl_task, 10, 0, 10050, 101, 10050, 101, 0, [{10050}],<<"技能加身">>, <<"找紫霞仙子">>, [{"做得不错，姐姐最欣赏这样的少年才俊了，日后有什么难处也可以来找姐姐哦。"}],[{"终于取得了第一片封印的碎片，要早日集齐炼化其余碎片，封印魔门才能拯救"},{"是！我最爱仙子姐姐了！"}],9, 8, 0, 2, 0, 0, [{0,0,541004201,650},{0,0,551004201,30}],[],0, 11, 0};	
get(11)->
	{tpl_task, 11, 0, 10050, 101, 10050, 101, 2, [{11002,1,0}],<<"退敌心法">>, <<"得灵珠果">>, [{"刚才的激战可花了不少精力，采些灵珠果补充元气吧。"}],[{"如果能领会了姐姐教你的各种招式，登上山河榜可是小事一桩哦！"},{"哇，姐姐你好厉害！"}],10, 10, 0, 2, 0, 0, [{0,0,541004201,1180},{0,0,531004201,140}],[],0, 12, 0};	
get(12)->
	{tpl_task, 12, 0, 10050, 101, 10007, 104, 0, [{10007}],<<"阴差阳错">>, <<"找轻涟">>, [{"如今众人齐聚天州城，想必山河榜上会有一番龙争虎斗，快前去切磋一番吧！"}],[{"哇！救命啊救命啊！"},{"吓！天州城这么乱？连小孩子都不放过？"}],11, 11, 0, 2, 0, 0, [{0,0,541004201,1530},{0,0,551004201,30}],[],0, 13, 0};	
get(13)->
	{tpl_task, 13, 0, 10007, 104, 10057, 104, 0, [{10057}],<<"荒芜海滩">>, <<"找幻影邪魔">>, [{"这里是星罗海滩，因为魔族作乱，已经荒芜很久了，你可要小心。"}],[{"大胆！这里可是我们魔族的根据地，若想从此过，留下买路财！"},{"铜钱没有，元宝要吗？"}],12, 12, 0, 2, 0, 0, [{0,0,541004201,1950},{0,0,531004201,150}],[],0, 14, 0};	
get(14)->
	{tpl_task, 14, 0, 10057, 104, 10008, 104, 1, [{20005,10,0}],<<"狂妄魔族">>, <<"杀黑鲛喽啰">>, [{"大胆！竟然敢践踏我大魔族的尊严？小的们上！"}],[{"龙宫被魔族围攻，龙族死伤无数，我好不容易逃出来求救…"},{"这帮该死的魔族！"}],13, 13, 0, 2, 0, 0, [{0,0,541004201,2450},{0,0,551004201,30}],[],0, 15, 0};	
get(15)->
	{tpl_task, 15, 0, 10008, 104, 10008, 104, 9, [{306}],<<"龙女求助">>, <<"找小龙女">>, [{"龙宫众人奋力抵抗，才逃得生路，救救我们吧……"}],[{"英雄，龙宫已经危在旦夕…"},{""}],14, 13, 0, 2, 0, 0, [{0,0,541004201,2450},{0,0,531004201,160}],[],0, 16, 0};	
get(16)->
	{tpl_task, 16, 0, 10008, 104, 10058, 104, 0, [{10008}],<<"恐怖妖魔">>, <<"找小龙女">>, [{"多谢英雄守护了龙宫！"}],[{"小龙女，哪里跑！竟敢跑去求救？"},{"不许靠近这个妹子！"}],15, 14, 0, 2, 0, 0, [{0,0,541004201,3220},{0,0,551004201,30}],[],0, 17, 0};	
get(17)->
	{tpl_task, 17, 0, 10058, 104, 10058, 104, 0, [{10058}],<<"英勇除魔">>, <<"找破天魔头">>, [{"快把小龙女交给魔族，这可是大爷我准备收的第十八房…不，十九房小妾！"}],[{"臭小仙多管闲事！魔族不是好惹的，看大爷我怎么收拾你！"},{""}],16, 14, 0, 2, 0, 0, [{0,0,541004201,3020},{0,0,531004201,170}],[],0, 18, 0};	
get(18)->
	{tpl_task, 18, 0, 10058, 104, 10051, 104, 1, [{20006,5,0}],<<"除妖英雄">>, <<"杀魔影鲛女">>, [{"若能在我手下保全小命，才是真汉子！看招！"}],[{"英雄，多谢你救回了小龙女！"},{"只要妹子没事了就好。"}],17, 15, 0, 2, 0, 0, [{0,0,541004201,3680},{0,0,551004201,30}],[],0, 19, 0};	
get(19)->
	{tpl_task, 19, 0, 10051, 104, 10051, 104, 2, [{11017,1,0}],<<"采药救美">>, <<"得碧波瑶草">>, [{"她被魔族的邪术所伤，只有碧波瑶草能够救她！英雄能前去取来吗？"}],[{"服下这些草药，她很快就会康复。英雄，你解救了龙宫，真是天助龙族！"},{"公主客气了！"}],18, 15, 0, 2, 0, 0, [{0,0,541004201,3680},{0,0,531004201,190}],[],0, 20, 0};	
get(20)->
	{tpl_task, 20, 0, 10051, 104, 10052, 104, 0, [{10052}],<<"龙王亲谢">>, <<"找龙王敖丙">>, [{"父王希望能亲自面谢你拯救龙宫之恩，请前去见过父王吧。"}],[{"魔族在此地作乱已久，龙族险遭灭顶之灾，英雄解救龙族，本王要重谢英雄。"},{"龙王不需言谢，仙界之中，自当仗义执言。"}],19, 16, 0, 2, 0, 0, [{0,0,541004201,4440},{0,0,551004201,30}],[],0, 21, 0};	
get(21)->
	{tpl_task, 21, 0, 10052, 104, 10052, 104, 2, [{11018,1,0}],<<"炼化神针">>, <<"得定海神铁">>, [{"本王赠英雄一把神兵，日后再遇魔族，必定战无不胜。"}],[{"这把神兵是龙宫的定海神铁所炼化，我等无力使用，正好为英雄再增神力。"},{"定海神铁？这名字好耳熟。"}],20, 16, 0, 2, 0, 0, [{0,0,541004201,4440},{0,0,531004201,210},{1,1,221011203,1},{1,2,221012203,1},{1,3,221013203,1}],[],0, 22, 0};	
get(22)->
	{tpl_task, 22, 0, 10052, 104, 10052, 104, 1, [{20006,10,0}],<<"提升神焰">>, <<"杀魔影鲛女">>, [{"只是炼化的神炉火力不足，烦请英雄取些魔怪的内丹来提升一下火焰。"}],[{"这些魔怪藏身之处十分偏僻，英雄前去一定要小心。"},{"这武器果然犀利！"}],21, 17, 0, 2, 0, 0, [{0,0,541004201,5290},{0,0,551004201,30}],[],0, 23, 0};	
get(23)->
	{tpl_task, 23, 0, 10052, 104, 0, 104, 0, [{10052}],<<"神力武器">>, <<"找龙王敖丙">>, [{"这些内丹已足够炼化武器，日后对抗魔族，定能战无不胜。"}],[{"武器已经炼好，英雄日后再战魔族，定能战无不胜。"},{""}],22, 18, 0, 2, 0, 0, [{0,0,541004201,6240},{0,0,531004201,220}],[],0, 24, 0};	
get(24)->
	{tpl_task, 24, 0, 0, 104, 10051, 104, 0, [{10051}],<<"更换武器">>, <<"找白龙公主">>, [{"武器每隔十级会更换一把，就请英雄静待日后更好的武器吧。 "}],[{"英雄独自修仙，一定寂寞，孤身对抗魔族也十分危险。"},{""}],23, 18, 0, 2, 0, 0, [{0,0,541004201,6240},{0,0,551004201,30}],[],0, 25, 0};	
get(25)->
	{tpl_task, 25, 0, 10051, 104, 10051, 104, 0, [{10051}],<<"仙宠相伴">>, <<"找白龙公主">>, [{"龙宫后花园有一群娇娇狐，聪明伶俐，请挑选一只当做仙宠吧。"}],[{"仙宠能够协助英雄征战，还能为英雄提点许多小事，请多留意仙宠之言。"},{"龙宫里为啥会养着狐狸？"}],24, 19, 0, 2, 0, 0, [{0,0,541004201,7310},{0,0,531004201,240}],[],0, 26, 0};	
get(26)->
	{tpl_task, 26, 0, 10051, 104, 10053, 104, 0, [{10053}],<<"相助好友">>, <<"找海禅真人">>, [{"父王的好友海禅真人也因魔族入侵陷入麻烦之中，还请英雄前去相助。"}],[{"我本是来为龙王助阵，却不想陷入重围，自身难保。"},{"真人不要怕，我来也！"}],25, 19, 0, 2, 0, 0, [{0,0,541004201,7310},{0,0,551004201,40}],[],0, 27, 0};	
get(27)->
	{tpl_task, 27, 0, 10053, 104, 10053, 104, 9, [{307}],<<"负隅顽抗">>, <<"找海禅真人">>, [{"我一路追击魔族，没想到剩下的一小波魔族十分难缠"}],[{"小英雄，可否出手将这些魔族斩草除根？"},{"人家哪里小了……"}],26, 20, 0, 2, 0, 0, [{0,0,541004201,8490},{0,0,531004201,260}],[],0, 28, 0};	
get(28)->
	{tpl_task, 28, 0, 10053, 104, 0, 104, 1, [{20053,12,0}],<<"补益真气">>, <<"杀赤汐巨虾">>, [{"我被那些可恶的魔族损了经脉，功力大减，请替我取赤汐巨虾的肉来补气。"}],[{"我真气已复，多谢英雄。你孤身能救龙宫于魔族围困之中，真是不简单。"},{"过奖了！"}],27, 21, 0, 2, 0, 0, [{0,0,541004201,9790},{0,0,551004201,40}],[],0, 29, 0};	
get(29)->
	{tpl_task, 29, 0, 0, 104, 10053, 104, 1, [{20053,5,0}],<<"虾须妙用">>, <<"杀赤汐巨虾">>, [{"赤汐巨虾的肉是补益真气的良药，英雄不妨也常备身上，以备不时之需。"}],[{"多谢英雄，前往天州城？听说众人都在那里争夺山河榜头名。"},{"我也要在榜上占有一席之地！"}],28, 22, 0, 2, 0, 0, [{0,0,541004201,11200},{0,0,531004201,290}],[],0, 30, 0};	
get(30)->
	{tpl_task, 30, 0, 10053, 104, 10016, 103, 0, [{10016}],<<"独闯天州">>, <<"找旺财">>, [{"天州城山遥路远，恐有魔族埋伏，千万当心，我祝英雄早日在山河榜上立身扬名！"}],[{"想进城，得给我点好处！比如肉包子神马的！汪！"},{"难道这就是传说中的肉包子打狗？"}],29, 23, 0, 2, 0, 0, [{0,0,541004201,12800},{0,0,551004201,40}],[],0, 31, 0};	
get(31)->
	{tpl_task, 31, 0, 10016, 103, 10017, 103, 0, [{10017}],<<"热情推销">>, <<"找金乌道人">>, [{"汪！不错！你可以进天州城了！"}],[{"挨了刀除了砍回去以外，千万不要忘记给自己补血！"},{""}],30, 23, 0, 2, 0, 0, [{0,0,541004201,12800},{0,0,531004201,310}],[],0, 32, 0};	
get(32)->
	{tpl_task, 32, 0, 10017, 103, 10037, 103, 6, [{10017,365014201,1,0}],<<"购买药品">>, <<"得初级金创药绑">>, [{"我的小店里各种药品种类齐全，物美价廉！"}],[{"背包常备药品，打怪练级才能免除后顾之忧！买药品，记得找金乌道人！"},{"替我问候你主治大夫……"}],31, 24, 0, 2, 0, 0, [{0,0,541004201,14500},{0,0,551004201,40}],[],0, 33, 0};	
get(33)->
	{tpl_task, 33, 0, 10037, 103, 10037, 103, 9, [{308}],<<"言简意赅">>, <<"找赤阳天">>, [{"看来你也是来冲击山河榜的，赤阳天是上届山河榜冠军，但他惜字如金，你得费力问才行。"}],[{"进副本，过试练，看你修为。"},{"果然是言简意赅…"}],32, 24, 0, 2, 0, 0, [{0,0,541004201,14500},{0,0,531004201,330}],[],0, 34, 0};	
get(34)->
	{tpl_task, 34, 0, 10037, 103, 10019, 103, 0, [{10019}],<<"人情已还">>, <<"找瑶姬">>, [{"修为尚可，带话给瑶姬：人情已还。"}],[{"原来是赤阳天让你转告这句话的，其实…我希望他用另一种方式来还我人情…"},{"看来有八卦！"}],33, 25, 0, 2, 0, 0, [{0,0,541004201,16300},{0,0,551004201,40}],[],0, 35, 0};	
get(35)->
	{tpl_task, 35, 0, 10019, 103, 10019, 103, 0, [{10019}],<<"何须言此">>, <<"找瑶姬">>, [{"多嘴！小屁孩懂啥？看来你也是来闯山河榜的吧？"}],[{"单打独斗是不行的，天州城有很多能让你快速提升战力，早日登榜的路子哦！"},{"有后门可以走吗？"}],34, 25, 0, 2, 0, 0, [{0,0,541004201,16300},{0,0,531004201,360}],[],0, 36, 0};	
get(36)->
	{tpl_task, 36, 0, 10019, 103, 10023, 103, 0, [{10023}],<<"提高秘诀">>, <<"找方冷">>, [{"拜名师，结阵营，试炼路都能让你大有提升，快去看看吧！"}],[{"呵呵，又新来了一个修仙者！看你倒是十分有前途的样子！"},{""}],35, 25, 0, 2, 0, 0, [{0,0,541004201,16300},{0,0,551004201,40}],[],0, 37, 0};	
get(37)->
	{tpl_task, 37, 0, 10023, 103, 10023, 103, 2, [{11012,1,0}],<<"修为不足">>, <<"得五色彩石">>, [{"你现在还不能接受阵营对你的试炼，等修为精进了再来吧！三大牛逼阵营，看你与谁有缘！"}],[{"紫竹林的灵气能够提升修为，而且我还有一件事要拜托你前去..."},{""}],36, 26, 0, 2, 0, 0, [{0,0,541004201,18300},{0,0,531004201,380}],[],0, 38, 0};	
get(38)->
	{tpl_task, 38, 0, 10023, 103, 10023, 103, 0, [{10023}],<<"基友何在">>, <<"找方冷">>, [{"我的好友徐林在紫竹林失去了下落。我与他感情深厚，十分思念…希望你能找到他！"}],[{"只靠两条腿跑来跑去也不是办法，这朵七彩祥云给你当坐骑，包你来去如风！"},{"一种好基友的感觉扑面而来！我会帮你找到他的！"}],37, 26, 0, 2, 0, 0, [{0,0,541004201,18300},{0,0,551004201,50}],[],0, 39, 0};	
get(39)->
	{tpl_task, 39, 0, 10023, 103, 10054, 105, 0, [{10054}],<<"竹林悬疑">>, <<"找风若云">>, [{"听说紫竹林近来出现了一个凶残妖道，专以活人炼丹，你可要小心！"}],[{"卧槽！来者难道是极限运动爱好者吗？喜欢来这种魔族乱窜的地方游玩？"},{"我是受人之托，来寻找失踪人口的…"}],38, 26, 0, 2, 0, 0, [{0,0,541004201,18300},{0,0,531004201,410}],[],0, 40, 0};	
get(40)->
	{tpl_task, 40, 0, 10054, 105, 10054, 105, 2, [{11024,1,0}],<<"急需援助">>, <<"得千年续断">>, [{"我被那个变态的妖道一路追杀，好不容易才逃出，现在真是遍体鳞伤，急需药品啊！"}],[{"我哥哥失踪多日，听说他误入紫竹林，只怕是落入了传说中的妖道之手…"},{"哇靠，失踪人口真多！"}],39, 27, 0, 2, 0, 0, [{0,0,541004201,20500},{0,0,551004201,50}],[],0, 41, 0};	
get(41)->
	{tpl_task, 41, 0, 10054, 105, 10054, 105, 0, [{10054}],<<"凶残妖道">>, <<"找风若云">>, [{"传说那妖道本是仙界中人，因为受了魔族迷惑，沦为魔奴，从此开始残害生灵。"}],[{"妖道喜欢收集活人炼丹...我真担心哥哥，拜托英雄你找到他！"},{"行！没问题！"}],40, 27, 0, 2, 0, 0, [{0,0,541004201,20500},{0,0,531004201,440}],[],0, 42, 0};	
get(42)->
	{tpl_task, 42, 0, 10054, 105, 10022, 105, 1, [{20059,15,0}],<<"活人炼丹">>, <<"杀守卫妖女">>, [{"要进入那妖道的辖地，必须得先解决这些游荡的守卫妖女才行。"}],[{"嗯？又来一个修仙者？灵力不错！快到炼丹炉里来！"},{"这地方真危险…方冷那丫还叫我来！"}],41, 27, 0, 2, 0, 0, [{0,0,541004201,20500},{0,0,551004201,50}],[],0, 43, 0};	
get(43)->
	{tpl_task, 43, 0, 10022, 105, 10003, 105, 9, [{309}],<<"无影无踪">>, <<"找慈航真人">>, [{"想灭了我，可没这么容易，我可是来无影去无踪~~有种你就来抓我呀~~"}],[{"这妖道在紫竹林中四处作恶，%s，千万别让他逃了。"},{"这狡猾的妖道！我去收拾他！"}],42, 28, 0, 2, 0, 0, [{0,0,541004201,22800},{0,0,531004201,470}],[],0, 44, 0};	
get(44)->
	{tpl_task, 44, 0, 10003, 105, 10043, 105, 0, [{10043}],<<"万幸生还">>, <<"找风若雨">>, [{"被妖道拿来炼丹的修仙者不计其数，快去打探是否还有人生还吧。"}],[{"弟弟一直在找我吗？我只记得那天妖道忽然出现在我面前，从此就记忆全无…"},{"你命真大，竟然幸存下来。"}],43, 28, 0, 2, 0, 0, [{0,0,541004201,22800},{0,0,551004201,50}],[],0, 45, 0};	
get(45)->
	{tpl_task, 45, 0, 10043, 105, 10003, 105, 0, [{10043}],<<"记忆全无">>, <<"找风若雨">>, [{"不知你能否为我寻回失去的记忆，也好让我找到回家的路，与弟弟团聚..."}],[{"好在有人能从妖道手中逃出生天，真是善哉善哉。"},{"他的运气真是能去买彩票了。"}],44, 28, 0, 2, 0, 0, [{0,0,541004201,22800},{0,0,531004201,500}],[],0, 46, 0};	
get(46)->
	{tpl_task, 46, 0, 10003, 105, 10043, 105, 2, [{11022,1,0}],<<"冷香碧玉">>, <<"得冷香碧玉">>, [{"要让失忆之人寻回记忆，只需服下冷香碧玉就有奇效。"}],[{"太好了！我已经想起了以前的一切，终于可以回家了！"},{"快去和你的弟弟团聚吧。"}],45, 29, 0, 2, 0, 0, [{0,0,541004201,25300},{0,0,551004201,50}],[],0, 47, 0};	
get(47)->
	{tpl_task, 47, 0, 10043, 105, 10043, 105, 1, [{20011,15,0}],<<"游魂阻路">>, <<"杀守卫游魂">>, [{"魔族的守卫化身游魂守在竹林四周，只能麻烦你替我开道回家。"}],[{"多谢恩人搭救！否则我就要葬身在魔族的魔爪下了。"},{""}],46, 29, 0, 2, 0, 0, [{0,0,541004201,25300},{0,0,531004201,540}],[],0, 48, 0};	
get(48)->
	{tpl_task, 48, 0, 10043, 105, 10003, 105, 0, [{10003}],<<"感恩谢礼">>, <<"找慈航真人">>, [{"我无以为报，这VIP卡就当做谢礼吧，再远的路也能一瞬间用筋斗云到达了。"}],[{"这妖道作恶多端，一日不除，紫竹林一日不得安宁。"},{"我早就想除掉他了！"}],47, 29, 0, 2, 0, 0, [{0,0,541004201,25300},{0,0,551004201,60}],[],0, 49, 0};	
get(49)->
	{tpl_task, 49, 0, 10003, 105, 10003, 105, 2, [{11023,1,0}],<<"封印妖道">>, <<"得封魔冰鉴">>, [{"竹林深处有一枚封魔冰鉴，你去取来，将妖道封印带回紫竹林待我处置。"}],[{"果然已经将妖道成功封印，%s，你做得不错。"},{"只是这妖道被封印前，说的话十分古怪…"}],48, 30, 0, 2, 0, 0, [{0,0,541004201,28000},{0,0,531004201,570}],[],0, 50, 0};	
get(50)->
	{tpl_task, 50, 0, 10003, 105, 10023, 103, 0, [{10023}],<<"古怪玉佩">>, <<"找方冷">>, [{"只是这块从他身上掉下的玉佩有些蹊跷，你还是带回天州城找人看看吧。"}],[{"这是妖道身上掉下的玉佩？可这是我送给徐林的，怎么会在妖道身上？"},{"这不会代表你的基友已经被他拿来炼丹了吧！"}],49, 30, 0, 2, 0, 0, [{0,0,541004201,28000},{0,0,551004201,60}],[],0, 51, 0};	
get(51)->
	{tpl_task, 51, 0, 10023, 103, 10022, 105, 9, [{310}],<<"定有蹊跷">>, <<"找九霄妖道">>, [{"这件事情定有蹊跷，你一定要从那妖道嘴里逼问出徐林的下落！"}],[{"……呜呜……嗷嗷……我不会放过你的！"},{"死到临头还嘴硬，快说徐林在哪？"}],50, 30, 0, 2, 0, 0, [{0,0,541004201,28000},{0,0,531004201,610}],[],0, 52, 0};	
get(52)->
	{tpl_task, 52, 0, 10022, 105, 10003, 105, 0, [{10003}],<<"隐情为何">>, <<"找慈航真人">>, [{"……呜呜……我就是徐林……我好想方冷啊…"}],[{"这妖道竟然还有一段隐情，既是好人受蛊惑而化，那就快净化他的心智吧。"},{"徐林变妖道这事可不能让方冷知道，不然他会伤心的！"}],51, 30, 0, 2, 0, 0, [{0,0,541004201,28000},{0,0,551004201,60}],[],0, 53, 0};	
get(53)->
	{tpl_task, 53, 0, 10003, 105, 10022, 105, 1, [{20008,20,0}],<<"净化魔心">>, <<"杀雪参精灵">>, [{"雪参精灵的泪水能够净化心灵，替他取来净化魔心吧。"}],[{"方冷，我是徐林啊！你的好基友又回来了！（一把抱住）"},{"放开我，我不是方冷…"}],52, 31, 0, 2, 0, 0, [{0,0,541004201,30900},{0,0,531004201,640}],[],0, 54, 0};	
get(54)->
	{tpl_task, 54, 0, 10022, 105, 10022, 105, 0, [{10022}],<<"心受蛊惑">>, <<"找九霄妖道">>, [{"我...太渴望登上山河榜，急于提升实力，才受了紫竹林中魔族的蛊惑…"}],[{"从此我心智全失，变成了妖道，一心想要用修仙者炼丹提升自己修为…"},{"人有所求，心就易受蛊惑啊！"}],53, 31, 0, 2, 0, 0, [{0,0,541004201,30900},{0,0,551004201,60}],[],0, 55, 0};	
get(55)->
	{tpl_task, 55, 0, 10022, 105, 10023, 103, 0, [{10023}],<<"基友团聚">>, <<"找方冷">>, [{"太感谢你了…我终于可以和我的好基友方冷团圆了…请你吃饺子！"}],[{"%s，你真是好人啊！我们的三大阵营最需要像你这样有情有义的人了！"},{"过奖了！你们之间的情义更感人。"}],54, 31, 0, 2, 0, 0, [{0,0,541004201,30900},{0,0,531004201,680}],[],0, 56, 0};	
get(56)->
	{tpl_task, 56, 0, 10023, 103, 10023, 103, 0, [{10023}],<<"春哥的爱">>, <<"找方冷">>, [{"为了感谢你救出我的好基友，这把牛逼闪闪的武器送给你，名叫：春哥的爱！"}],[{"不要当真…有了这把武器，你能更轻易的通过阵营试练！"},{"吓死我了，我才不要接受春哥的爱。"}],55, 31, 0, 2, 0, 0, [{0,0,541004201,30900},{0,0,551004201,70}],[],0, 57, 0};	
get(57)->
	{tpl_task, 57, 0, 10023, 103, 10023, 103, 9, [{311}],<<"阵营试练">>, <<"找方冷">>, [{"%s，你的修为提升很快，如今已经能加入阵营了。"}],[{"快拿着新武器去接受阵营试练吧，我在这里等你的好消息！"},{""}],56, 31, 0, 2, 0, 0, [{0,0,541004201,30900},{0,0,531004201,720},{1,1,221021203,1},{1,2,221022203,1},{1,3,221023203,1}],[],0, 58, 0};	
get(58)->
	{tpl_task, 58, 0, 10023, 103, 10023, 103, 0, [{10023}],<<"投身阵营">>, <<"找方冷">>, [{"天州城三大阵营分别为羽化门、无极宫、黄泉宗，三足鼎立，势均力敌！"}],[{"很好，你的资质非常适合这个阵营！要时刻捍卫自己的阵营，才能步步为营！"},{"好！"}],57, 32, 0, 2, 0, 0, [{0,0,541004201,33900},{0,0,551004201,70},{1,1,201011203,1},{1,2,201012203,1},{1,3,201013203,1}],[],0, 59, 0};	
get(59)->
	{tpl_task, 59, 0, 10023, 103, 10025, 103, 0, [{10025}],<<"蓝装相赠">>, <<"找金不换">>, [{"一身屌丝装备在天州城是不受欢迎的！这一身蓝装就当阵营送你的见面礼吧！"}],[{"蓝装虽好，但比起紫装仍然寒酸！日后要果断升级成紫装才能实现屌丝逆袭！"},{"那你怎么不直接送我紫装捏？"}],58, 32, 0, 2, 0, 0, [{0,0,541004201,33900},{0,0,531004201,760},{0,0,203011203,1}],[],0, 60, 0};	
get(60)->
	{tpl_task, 60, 0, 10025, 103, 10025, 103, 6, [{10025,213011203,1,0}],<<"购买首饰">>, <<"得破军项链绑">>, [{"光有战袍和武器是不够的，一套蓝装首饰能更突显你的品味！"}],[{"欢迎再度光顾我的小店，童叟无欺，包你满意！"},{""}],59, 32, 0, 2, 0, 0, [{0,0,541004201,33900},{0,0,551004201,70},{0,0,205011203,1}],[],0, 61, 0};	
get(61)->
	{tpl_task, 61, 0, 10025, 103, 0, 103, 0, [{10025}],<<"热心叮嘱">>, <<"找金不换">>, [{"日后还需要啥，尽管来本店，各种武器、装备大甩卖！"}],[{"%s，以你现在的修为，还不能在天州城里畅行无阻，抓紧修炼吧。"},{""}],60, 32, 0, 2, 0, 0, [{0,0,541004201,33900},{0,0,531004201,800},{1,1,207011203,1},{1,2,207012203,1},{1,1,207013203,1}],[],0, 62, 0};	
get(62)->
	{tpl_task, 62, 0, 0, 103, 10025, 103, 0, [{10025}],<<"狐狸萌妹">>, <<"找金不换">>, [{"悄悄告诉你，你的宠物可以变身成萌妹子！这样你晚上就有一个可以暖床的床伴了！"}],[{"优惠酬宾，这张限量级2013白金纪念版宠物幻化卡就送给你了！"},{"名字好长，听起来好腻害的样子。"}],61, 32, 0, 2, 0, 0, [{0,0,541004201,33900},{0,0,551004201,70},{0,0,209011203,1}],[],0, 63, 0};	
get(63)->
	{tpl_task, 63, 0, 10025, 103, 10033, 107, 0, [{10033}],<<"娇俏女子">>, <<"找珈蓝">>, [{"仙界里都在传言你已经取得了一片魔门的封印碎片，抓紧集齐剩下的碎片吧，少年！"}],[{"大爷，大爷留步呀~~看来你也是来找魔门封印碎片的吧？"},{"嗯？有妹子！"}],62, 32, 0, 2, 0, 0, [{0,0,541004201,33900},{0,0,531004201,840},{0,0,211011203,1}],[],0, 64, 0};	
get(64)->
	{tpl_task, 64, 0, 10033, 107, 10033, 107, 1, [{20015,25,0}],<<"出手相助">>, <<"杀岩融神王">>, [{"不管你是来炎魔谷找什么的，先把我从这群臭魔族的结界里救出来再说！"}],[{"你人真好…其他修仙者都为寻找碎片，来去匆匆，根本不管我的求助，哼！"},{"真是世风日下，这么好的妹子都没人帮，瞎了狗眼！"}],63, 33, 0, 2, 0, 0, [{0,0,541004201,40500},{0,0,551004201,80}],[],0, 65, 0};	
get(65)->
	{tpl_task, 65, 0, 10033, 107, 10033, 107, 9, [{312}],<<"好心好报">>, <<"找珈蓝">>, [{"为了报答救命之恩，我就以身…告诉你封印碎片的下落吧！"}],[{"封印碎片藏在一个古怪的岩洞里，据说那里有妖怪，谁都不敢去呢。"},{""}],64, 33, 0, 2, 0, 0, [{0,0,541004201,40500},{0,0,531004201,890}],[],0, 66, 0};	
get(66)->
	{tpl_task, 66, 0, 10033, 107, 10033, 107, 0, [{10033}],<<"金丹元婴">>, <<"找珈蓝">>, [{"看你这么值得托付，小女子就与你双宿双飞，合体修炼吧，嘻嘻…主人~"}],[{"主人，我们合体可以炼化金丹，凝神元婴，日后还能进一步提升修为呢！"},{"好啊！我们合体吧！"}],65, 33, 0, 2, 0, 0, [{0,0,541004201,40500},{0,0,551004201,80}],[],0, 67, 0};	
get(67)->
	{tpl_task, 67, 0, 10033, 107, 0, 107, 0, [{10033}],<<"层层修炼">>, <<"找珈蓝">>, [{"凝炼金丹需要循序渐进，每层都有冷却时间，主人需要一层一层的修炼哦。"}],[{""},{""}],66, 33, 0, 2, 0, 0, [{0,0,541004201,40500},{0,0,531004201,930}],[],0, 68, 0};	
get(68)->
	{tpl_task, 68, 0, 0, 107, 10033, 107, 0, [{10033}],<<"心急修炼">>, <<"找珈蓝">>, [{""}],[{"如果主人心急修炼，可以购买经脉加速卡哦！小女子最喜欢快进了哦！"},{"我也很喜欢你啊~么么哒~"}],67, 33, 0, 2, 0, 0, [{0,0,541004201,40500},{0,0,551004201,80}],[],0, 69, 0};	
get(69)->
	{tpl_task, 69, 0, 10033, 107, 10025, 103, 4, [{34}],<<"修为大增">>, <<"升级至34级">>, [{"主人要继续努力修炼，给奴家脸上争光哦，么么哒~"}],[{"%s，你几番试炼，如今修为大增，是该告诉你进一步提升实力的方法了。"},{"那就快告诉我吧，真是迫不及待！"}],68, 33, 0, 2, 0, 0, [{0,0,541004201,40500},{0,0,531004201,980}],[],0, 70, 0};	
get(70)->
	{tpl_task, 70, 0, 10025, 103, 10025, 103, 0, [{10025}],<<"曾哥的爱">>, <<"找金不换">>, [{"这颗光芒闪闪的强化石送给你，名字叫做：曾哥的爱！"}],[{"强化石能对武器、装备进行强化，让你战力一路爆表，轻松挑战山河榜！"},{"我也不会接受曾哥的爱的…"}],69, 34, 0, 2, 0, 0, [{0,0,541004201,41300},{0,0,551004201,90}],[],0, 71, 0};	
get(71)->
	{tpl_task, 71, 0, 10025, 103, 10036, 103, 0, [{10036}],<<"轻松强化">>, <<"找钟无离">>, [{"强化石可以在副本和阵营任务中获得，好好争取多得强化石吧！"}],[{"这位少年，想不想轻松变身高富帅？"},{"想！我做屌丝太多年了！"}],70, 34, 0, 2, 0, 0, [{0,0,541004201,41300},{0,0,531004201,1100}],[],0, 72, 0};	
get(72)->
	{tpl_task, 72, 0, 10036, 103, 10036, 103, 0, [{10036}],<<"一本万利">>, <<"找钟无离">>, [{"让我来教你变个很牛逼的魔术，来见证小钱变大钱的奇迹吧！"}],[{"日后若想一本万利，尽管来找我！"},{"还有这等好事，我绝对不会和钱过不去的…嘻嘻！"}],71, 34, 0, 2, 0, 0, [{0,0,541004201,41300},{0,0,551004201,90}],[],0, 73, 0};	
get(73)->
	{tpl_task, 73, 0, 10036, 103, 10030, 103, 0, [{10030}],<<"聚宝危机">>, <<"找岳山">>, [{"最近聚宝阁年久失修，金银财宝哗哗的流失，岳山那守财奴可愁白了头。"}],[{"作为一个守财奴，怎么能看到任何一分钱从我眼前溜走！"},{"说得好！"}],72, 34, 0, 2, 0, 0, [{0,0,541004201,41300},{0,0,531004201,1100}],[],0, 74, 0};	
get(74)->
	{tpl_task, 74, 0, 10030, 103, 10030, 103, 2, [{11012,5,0}],<<"彩石补盆">>, <<"得五色彩石">>, [{"只有补天遗留下的五色彩石才能将聚宝盆补上，你快去采！我得守着这些散落的财宝！"}],[{"终于能把聚宝盆补好了，否则我可真要心疼而死了…"},{""}],73, 34, 0, 2, 0, 0, [{0,0,541004201,41300},{0,0,551004201,90}],[],0, 75, 0};	
get(75)->
	{tpl_task, 75, 0, 10030, 103, 10030, 103, 0, [{10030}],<<"取财有道">>, <<"找岳山">>, [{"在天州城里，只要你肯动脑筋，赚钱不成问题。"}],[{"君子爱财，取之有道，常来聚宝盆能快速发财致富！"},{"哈，离变身高富帅又进了一步…"}],74, 34, 0, 2, 0, 0, [{0,0,541004201,41300},{0,0,531004201,1200}],[],0, 76, 0};	
get(76)->
	{tpl_task, 76, 0, 10030, 103, 10035, 103, 0, [{10035}],<<"乐于助人">>, <<"找月下红娘">>, [{"我独自抚养小女成人，十分担心她的终身大事，请去问问月下红娘她的姻缘。"}],[{"%s，你小小年纪，难道也是来问你的姻缘的？"},{"才没有啦，我帮岳山问的。"}],75, 34, 0, 2, 0, 0, [{0,0,541004201,41300},{0,0,551004201,100}],[],0, 77, 0};	
get(77)->
	{tpl_task, 77, 0, 10035, 103, 10035, 103, 4, [{35}],<<"姻缘天定">>, <<"升级至35级">>, [{"姻缘天定，老身虽掌管姻缘簿，可不能泄露天机。等你实力强悍的时候自然能知晓。"}],[{"岳小姐自然是会有一段佳缘的，岳山大可不必整日担忧。"},{""}],76, 34, 0, 2, 0, 0, [{0,0,541004201,41300},{0,0,531004201,1200}],[],0, 78, 0};	
get(78)->
	{tpl_task, 78, 0, 10035, 103, 10039, 103, 0, [{10039}],<<"百炼成仙">>, <<"找薛仁">>, [{"%s，拯救仙界的重任就在你肩上了，快前去薛仁那里接取百炼任务吧！"}],[{"百炼终成仙！想要封印魔门，登山河榜，就得千锤百炼！"},{""}],77, 35, 0, 2, 0, 0, [{0,0,541004201,55400},{0,0,551004201,100}],[],0, 79, 0};	
get(79)->
	{tpl_task, 79, 0, 10039, 103, 10074, 103, 0, [{10074}],<<"见过名师">>, <<"找燕子苏">>, [{"想要在仙界畅行无阻，就要投身师门，拜访名师！"}],[{"如今天地异变，神族入侵在即，仙界师门广招天下修士共同化解劫难！"},{"我也要拜师学艺！"}],78, 35, 0, 2, 0, 0, [{0,0,541004201,55400},{0,0,531004201,1300}],[],0, 80, 0};	
get(80)->
	{tpl_task, 80, 0, 10074, 103, 10056, 107, 0, [{10056}],<<"拜访爱徒">>, <<"找玄无忧">>, [{"%s，你的修为还不能进入师门，我的徒弟会传授你一些提升修为的方法。"}],[{"日常任务可以助你快速升级，妹子再也不用担心我的升级了！"},{"原来升级这么easy啊…"}],79, 35, 0, 2, 0, 0, [{0,0,541004201,55400},{0,0,551004201,100}],[],0, 81, 0};	
get(81)->
	{tpl_task, 81, 0, 10056, 107, 10056, 107, 1, [{20012,25,0}],<<"杀怪升级">>, <<"杀赤焰妖兽">>, [{"嗜血狂龙近来一直在骚扰我修炼，把它们给灭了，助你升级！"}],[{"做的不错，师父一定会欣赏你这样的少年才俊的！登山河榜，你有希望！"},{""}],80, 35, 0, 2, 0, 0, [{0,0,541004201,55400},{0,0,531004201,1300}],[],0, 82, 0};	
get(82)->
	{tpl_task, 82, 0, 10056, 107, 10055, 107, 0, [{10055}],<<"烦人娘炮">>, <<"找狐不归">>, [{"最近有奇怪的东西混进炎魔谷，比如前面的那个娘炮，你去让他别再跟着我了！"}],[{"矮油~人家只是对玄无忧有一点点好感而已，不要介意我天天跟踪他嘛~"},{"我最受不了娘炮了…"}],81, 35, 0, 2, 0, 0, [{0,0,541004201,55400},{0,0,551004201,110}],[],0, 83, 0};	
get(83)->
	{tpl_task, 83, 0, 10055, 107, 10055, 107, 1, [{20050,30,0}],<<"事情真相">>, <<"杀火岩怪">>, [{"想知道我跟踪他的真正原因吗~那就先帮我去取几颗火岩怪的内丹来我才告诉你哦~~"}],[{"我好想登上山河榜嘛~所以总是偷偷跟在他后面，想学学他的招式嘛~"},{"这…难道你在对他进行尾行？"}],82, 35, 0, 2, 0, 0, [{0,0,541004201,55400},{0,0,531004201,1400}],[],0, 84, 0};	
get(84)->
	{tpl_task, 84, 0, 10055, 107, 10056, 107, 0, [{10056}],<<"基情满满">>, <<"找玄无忧">>, [{"哇~看在你人这么好的份上，我就答应你以后不去骚扰玄无忧了~"}],[{"原来他也想登山河榜啊！想拜我为师就来骚扰我嘛，我很热心的！"},{"我又品出了一股基情的味道…受不鸟…"}],83, 35, 0, 2, 0, 0, [{0,0,541004201,55400},{0,0,551004201,110}],[],0, 85, 0};	
get(85)->
	{tpl_task, 85, 0, 10056, 107, 10074, 103, 4, [{37}],<<"寄予厚望">>, <<"升级至37级">>, [{"咳咳…嗯…%s，你现在大有长进，快去师父那里接受他的师门试炼吧！"}],[{"%s，你在仙界的名头越来越响亮了，大家都对你冲击山河榜抱有厚望！"},{""}],84, 35, 0, 2, 0, 0, [{0,0,541004201,55400},{0,0,531004201,1400}],[],0, 86, 0};	
get(86)->
	{tpl_task, 86, 0, 10074, 103, 10074, 103, 0, [{10074}],<<"师门任务">>, <<"找燕子苏">>, [{"登堂入室，拜师学艺，接受师门对你的考验！"}],[{"很好，孺子可教！记得常来领取师门任务，奖励丰厚！"},{""}],85, 36, 0, 2, 0, 0, [{0,0,541004201,53700},{0,0,551004201,110}],[],0, 87, 0};	
get(87)->
	{tpl_task, 87, 0, 10074, 103, 10019, 103, 0, [{10019}],<<"再遇瑶姬">>, <<"找瑶姬">>, [{"带着萌妹仙宠征战仙界很爽，可不要忘了让她时刻学习技能，去找瑶姬教教你吧！"}],[{"%s，好久不见了！看你这么自信满满，一定是对登临山河榜很有自信！"},{"那是当然！"}],86, 36, 0, 2, 0, 0, [{0,0,541004201,53700},{0,0,531004201,1500}],[],0, 88, 0};	
get(88)->
	{tpl_task, 88, 0, 10019, 103, 10019, 103, 0, [{10019}],<<"伶俐仙宠">>, <<"找瑶姬">>, [{"你的仙宠看起来聪明伶俐，你作为主人，可不要忘记时刻提醒它好好学习。"}],[{"有技能突出的仙宠相伴，主人的战力也会大大增强，行走仙界更加畅通无阻。"},{""}],87, 36, 0, 2, 0, 0, [{0,0,541004201,53700},{0,0,551004201,120}],[],0, 89, 0};	
get(89)->
	{tpl_task, 89, 0, 10019, 103, 10019, 103, 0, [{10019}],<<"宠物技能">>, <<"找瑶姬">>, [{"仙宠能逐步提升战力，培育成极品仙宠，我来教你怎么做。"}],[{"你的仙宠战力更强了，它也会告诉你什么时候能够提升，要留意哦！"},{"萌妹子说的每一句话我都会认真听的。"}],88, 36, 0, 2, 0, 0, [{0,0,541004201,53700},{0,0,531004201,1500}],[],0, 90, 0};	
get(90)->
	{tpl_task, 90, 0, 10019, 103, 10032, 109, 0, [{10032}],<<"碎片下落">>, <<"找华天都">>, [{"听说你一直在寻找魔门封印的碎片，赤阳天说有一片碎片在不老峰上，你去找找吧。"}],[{"不老峰怪兽横行，你独身前来，胆子倒不小，可是为了寻找那封印的碎片？"},{"当然，我立志要收集炼化所有的封印碎片。"}],89, 36, 0, 2, 0, 0, [{0,0,541004201,53700},{0,0,551004201,120}],[],0, 91, 0};	
get(91)->
	{tpl_task, 91, 0, 10032, 109, 10032, 109, 0, [{10032}],<<"助人小忙">>, <<"找华天都">>, [{"不错不错，骚年有追求！看来那该死的魔门总有一天能在你手上封印！"}],[{"不过呢，要想知道封印的碎片在哪，可得先帮我一个小忙才行！"},{""}],90, 36, 0, 2, 0, 0, [{0,0,541004201,53700},{0,0,531004201,1600}],[],0, 92, 0};	
get(92)->
	{tpl_task, 92, 0, 10032, 109, 10032, 109, 2, [{11021,5,0}],<<"迷情兰花">>, <<"得迷情兰花">>, [{"我的十三房小妾都想要迷情兰花来赏玩，那玩意生在断崖，我可没能耐去取！"}],[{"真是帮了我大忙，不如和你结拜成兄弟，以后你就有十三位漂亮嫂子了哈哈！"},{"不…不必了…我对嫂子兴趣不是很大……"}],91, 36, 0, 2, 0, 0, [{0,0,541004201,53700},{0,0,551004201,130}],[],0, 93, 0};	
get(93)->
	{tpl_task, 93, 0, 10032, 109, 10044, 109, 0, [{10044}],<<"甩手掌柜">>, <<"找清微">>, [{"请你先将兰花转交给小美人们，封印碎片嘛…我最喜欢的清微会告诉你的，哈哈！"}],[{"我种植红颜花，想要酿蜜永葆青春，小花奴却来疯狂破坏。"},{"好幽怨的女纸啊，看来是独守空房太久了。"}],92, 36, 0, 2, 0, 0, [{0,0,541004201,53700},{0,0,531004201,1700}],[],0, 94, 0};	
get(94)->
	{tpl_task, 94, 0, 10044, 109, 10044, 109, 1, [{20058,30,0}],<<"恼人花奴">>, <<"杀小花奴">>, [{"你帮我除去这些烦人的小花奴，我告诉你碎片的下落。"}],[{"真馋！可不许吃太多，我还得留着它们保持我的美貌呢！"},{""}],93, 36, 0, 2, 0, 0, [{0,0,541004201,53700},{0,0,551004201,130}],[],0, 95, 0};	
get(95)->
	{tpl_task, 95, 0, 10044, 109, 10044, 109, 9, [{313}],<<"身受重伤">>, <<"找清微">>, [{"看在你帮了我大忙的份上，我就勉为其难的告诉你碎片下落吧。"}],[{"少年，快带着你的妹子，勇敢的去取封印碎片吧！"},{"我们可是仙界侠侣哦。"}],94, 37, 0, 2, 0, 0, [{0,0,541004201,59900},{0,0,531004201,1700}],[],0, 96, 0};	
get(96)->
	{tpl_task, 96, 0, 10044, 109, 10020, 109, 0, [{10020}],<<"可恶魔族">>, <<"找冷萝圣女">>, [{"天啊，你的妹子竟然被魔族打成这样，连我也怜香惜玉了..."}],[{"魔族这等嚣张？竟然把你的妹子打成这样，一定要给它们颜色看看！"},{"此仇不报，誓不为人！"}],95, 37, 0, 2, 0, 0, [{0,0,541004201,59900},{0,0,551004201,130}],[],0, 97, 0};	
get(97)->
	{tpl_task, 97, 0, 10020, 109, 10020, 109, 0, [{10020}],<<"真气受损">>, <<"找冷萝圣女">>, [{"言归正传，要拯救你的妹子，真的没那么容易。"}],[{"她被魔族的邪气侵害，体内元神受损，真气大量流失。"},{"那…那怎么办？"}],96, 37, 0, 2, 0, 0, [{0,0,541004201,59900},{0,0,531004201,1800}],[],0, 98, 0};	
get(98)->
	{tpl_task, 98, 0, 10020, 109, 10020, 109, 2, [{11013,7,0}],<<"锁灵金瓶">>, <<"得玄武真金">>, [{"目前只能采集玄武真金制成锁灵瓶，锁住她不断流失的真气。"}],[{"这些真金纯度太低，无法制成锁灵瓶，必须要用三昧真火再度熔炼才行！"},{""}],97, 37, 0, 2, 0, 0, [{0,0,541004201,59900},{0,0,551004201,140}],[],0, 99, 0};	
get(99)->
	{tpl_task, 99, 0, 10020, 109, 10028, 107, 0, [{10028}],<<"吝啬看守">>, <<"找赤骠怒">>, [{"三昧真火是炎魔谷之宝，由赤骠怒看守，他生性吝啬，你可要多说好话！"}],[{"求取三昧真火的？哼！这么宝贵的东西，概不外借！"},{"人命关天！就行行好借一点吧！"}],98, 37, 0, 2, 0, 0, [{0,0,541004201,59900},{0,0,531004201,1900}],[],0, 100, 0};	
get(100)->
	{tpl_task, 100, 0, 10028, 107, 10028, 107, 1, [{20015,35,0}],<<"一言不合">>, <<"杀岩融神王">>, [{"你这人怎么这么啰嗦！我要放狗咬你了！"}],[{"嗯…刚才的事情呢，大家就当没发生吧！你想要啥，说吧！"},{"废话，当然是三昧真火啊。"}],99, 37, 0, 2, 0, 0, [{0,0,541004201,59900},{0,0,551004201,140}],[],0, 101, 0};	
get(101)->
	{tpl_task, 101, 0, 10028, 107, 10020, 109, 0, [{10020}],<<"三昧真火">>, <<"找冷萝圣女">>, [{"三昧真火就在那边…哎，少拿点少拿点！心疼死我了…"}],[{"她的真气在锁灵瓶中暂时没什么危险，但也不能支撑太长时间。"},{"妹子，挺住啊。"}],100, 37, 0, 2, 0, 0, [{0,0,541004201,59900},{0,0,531004201,1900}],[],0, 102, 0};	
get(102)->
	{tpl_task, 102, 0, 10020, 109, 10024, 109, 0, [{10024}],<<"长情长义">>, <<"找水月居士">>, [{"当务之急是为她补充真气，我无能为力，水月居士或许能有办法。"}],[{"老夫最欣赏你这样担负着封印魔门任务的英雄，更要鼎力相助。"},{"终于遇到好人了。"}],101, 37, 0, 2, 0, 0, [{0,0,541004201,59900},{0,0,551004201,150}],[],0, 103, 0};	
get(103)->
	{tpl_task, 103, 0, 10024, 109, 10024, 109, 4, [{38}],<<"花奴灵根">>, <<"升级至38级">>, [{"小花奴是不老峰上的小妖，却十分热衷于修行法术，渴望永生。"}],[{"她们已有灵根，体内的真气虽然微弱，可收集起来也能聚少成多。"},{""}],102, 37, 0, 2, 0, 0, [{0,0,541004201,59900},{0,0,531004201,2000}],[],0, 104, 0};	
get(104)->
	{tpl_task, 104, 0, 10024, 109, 10024, 109, 1, [{20058,35,0}],<<"心存怜悯">>, <<"杀小花奴">>, [{"快快前去击杀花奴，再多拖延，后果凶多吉少。"}],[{"想不到你如此慈心，竟没要花奴的性命，但收集不了真气，又如何是好？"},{"可那些花奴终究是无辜的，实在下不了手啊。"}],103, 38, 0, 2, 0, 0, [{0,0,541004201,70400},{0,0,551004201,150}],[],0, 105, 0};	
get(105)->
	{tpl_task, 105, 0, 10024, 109, 10040, 109, 0, [{10040}],<<"聪明郡主">>, <<"找红怡郡主">>, [{"也罢！红怡郡主聪明伶俐，或许能想出十全的法子来。"}],[{"水月居士还真是迂腐，想要补充真气，又何必伤花奴的性命。"},{""}],104, 38, 0, 2, 0, 0, [{0,0,541004201,70400},{0,0,531004201,2100}],[],0, 106, 0};	
get(106)->
	{tpl_task, 106, 0, 10040, 109, 10040, 109, 2, [{11020,7,0}],<<"另辟蹊径">>, <<"得霓裳紫芝">>, [{"你去多多采一些霓裳紫芝回来，我会帮你炼制补益真气的丹药。"}],[{"这紫芝可是好东西，好看又好吃，嘻嘻！"},{""}],105, 38, 0, 2, 0, 0, [{0,0,541004201,70400},{0,0,551004201,160}],[],0, 107, 0};	
get(107)->
	{tpl_task, 107, 0, 10040, 109, 10044, 109, 1, [{20057,40,0}],<<"神奇药引">>, <<"杀翡翠灵蛙">>, [{"丹药少不了翡翠灵蛙的泪水做药引，灵蛙凶猛，要小心哦。"}],[{"原料齐备啦，我现在就给你炼制丹药，不要着急哦！"},{""}],106, 38, 0, 2, 0, 0, [{0,0,541004201,70400},{0,0,531004201,2100}],[],0, 108, 0};	
get(108)->
	{tpl_task, 108, 0, 10044, 109, 10044, 109, 0, [{10044}],<<"大难不死">>, <<"找清微">>, [{"服下这些丹药，真气就能满槽啦，快带去给你妹子吧！"}],[{"服了丹药，你妹子很快就会没事的，就能继续陪你闯荡各个副本了。"},{"好开心，妹子终于恢复健康了。"}],107, 38, 0, 2, 0, 0, [{0,0,541004201,70400},{0,0,551004201,160}],[],0, 109, 0};	
get(109)->
	{tpl_task, 109, 0, 10044, 109, 10019, 103, 9, [{314}],<<"英名远扬">>, <<"找瑶姬">>, [{"一定不能让美人以身涉险，否则有失英雄本色。"}],[{"%s，你的妹子被魔族打伤，这深仇大恨你不能不报。"},{""}],108, 38, 0, 2, 0, 0, [{0,0,541004201,70400},{0,0,531004201,2200}],[],0, 110, 0};	
get(110)->
	{tpl_task, 110, 0, 10019, 103, 10031, 103, 0, [{10031}],<<"替天行道">>, <<"找应天青">>, [{"击退魔族，替天行道，守护仙界是每一个修仙者的目标，快去应天青那里接领天道令！"}],[{"%s，欢迎来我这里接领天道令！希望你早登山河榜，成功封印魔门！"},{""}],109, 38, 0, 2, 0, 0, [{0,0,541004201,70400},{0,0,551004201,170}],[],0, 111, 0};	
get(111)->
	{tpl_task, 111, 0, 10031, 103, 10031, 103, 0, [{10031}],<<"事半功倍">>, <<"找应天青">>, [{"只要每天接取和发布天道令，替天行道，就能令你的修行事倍功半！"}],[{"你的修为已经大幅提升，天州城不久将会传扬你的英名！"},{""}],110, 38, 0, 2, 0, 0, [{0,0,541004201,70400},{0,0,531004201,2300}],[],0, 112, 0};	
get(112)->
	{tpl_task, 112, 0, 10031, 103, 10018, 103, 4, [{39}],<<"女神何意">>, <<"升级至39级">>, [{"我掌管天道令已久，潜心提升修为，只为博惠善一笑，麻烦你去探探她对我是否有意？"}],[{"应天青又何苦如此？其实…他只差我一句话。"},{"天州城这么多八卦，看来我要转行做娱记了。"}],111, 38, 0, 2, 0, 0, [{0,0,541004201,70400},{0,0,551004201,170}],[],0, 113, 0};	
get(113)->
	{tpl_task, 113, 0, 10018, 103, 10042, 103, 0, [{10042}],<<"含羞带笑">>, <<"找过蒙尊者">>, [{"真是羞死人，我在说些什么？过蒙尊者的帮派一直缺人手，快去看看吧！"}],[{"四海皆兄弟，谁为行路人？%s，欢迎你加入帮派，与兄弟并肩与魔族作战！"},{""}],112, 39, 0, 2, 0, 0, [{0,0,541004201,83000},{0,0,531004201,2300}],[],0, 114, 0};	
get(114)->
	{tpl_task, 114, 0, 10042, 103, 10042, 103, 0, [{10042}],<<"摩拳擦掌">>, <<"找过蒙尊者">>, [{"最近帮派里热火朝天，兄弟们听说你近日修为精进，都很想挑战你一番！"}],[{"%s，要记得常回帮派，多与兄弟们切磋武艺，共同进步！"},{""}],113, 39, 0, 2, 0, 0, [{0,0,541004201,83000},{0,0,551004201,170}],[],0, 115, 0};	
get(115)->
	{tpl_task, 115, 0, 10042, 103, 10027, 103, 0, [{10027}],<<"传奇人物">>, <<"找绝心">>, [{"绝心仅用短短几年时间便实现了屌丝逆袭，成功登上山河榜，快去请教他如何做到吧！"}],[{"想要逆袭，就要自强不息！"},{""}],114, 39, 0, 2, 0, 0, [{0,0,541004201,83000},{0,0,531004201,2400}],[],0, 116, 0};	
get(116)->
	{tpl_task, 116, 0, 10027, 103, 10027, 103, 0, [{10029}],<<"自强不息">>, <<"找何所望">>, [{"每日可以在我这里接领自强不息任务，提升自己，登山河榜，大有作为！"}],[{"很好！你成为天州城另一个励志故事指日可待！"},{""}],115, 39, 0, 2, 0, 0, [{0,0,541004201,83000},{0,0,551004201,180}],[],0, 117, 0};	
get(117)->
	{tpl_task, 117, 0, 10027, 103, 10029, 106, 0, [{10029}],<<"任重道远">>, <<"找何所望">>, [{"封印魔门，任重道远，%s，快继续踏上你的征途吧。"}],[{"我们狐族在蛮荒丛林修炼，与世无争，从来不关心什么封印碎片。"},{""}],116, 39, 0, 2, 0, 0, [{0,0,541004201,83000},{0,0,531004201,2500}],[],0, 118, 0};	
get(118)->
	{tpl_task, 118, 0, 10029, 106, 10026, 106, 2, [{11016,7,0}],<<"孝敬长老">>, <<"得金莲心草">>, [{"狐族长老烈胭脂或许能告诉你有关封印碎片的事，但你要采集金莲心草孝敬她才行。"}],[{"我知道封印碎片的下落，你和狐族做个交易，我就告诉你碎片下落。"},{"好吧，什么交易？"}],117, 39, 0, 2, 0, 0, [{0,0,541004201,83000},{0,0,551004201,180}],[],0, 119, 0};	
get(119)->
	{tpl_task, 119, 0, 10026, 103, 10026, 103, 0, [{10026}],<<"狐族秘宝">>, <<"找烈胭脂">>, [{"狐族一直想得到天武之库的一件秘宝，可是以狐族的能力，根本无法开启宝库。"}],[{"只要你替我打开宝库取得秘宝，我就告诉你魔门封印碎片在哪，如何？"},{"行，没问题，你可不能骗我。"}],118, 39, 0, 2, 0, 0, [{0,0,541004201,83000},{0,0,531004201,2600}],[],0, 120, 0};	
get(120)->
	{tpl_task, 120, 0, 10026, 103, 10026, 103, 0, [{20054,40,0}],<<"诚意合作">>, <<"杀七彩凤凰">>, [{"为了表示合作的诚意，我奉上几枚七彩凤凰的内丹给你补充元气。"}],[{"这些内丹够了...我感到你体内注入了一股强大元气！开启宝库有望了！"},{""}],119, 39, 0, 2, 0, 0, [{0,0,541004201,83000},{0,0,551004201,190}],[],0, 121, 0};	
get(121)->
	{tpl_task, 121, 0, 10026, 106, 10038, 106, 4, [{40}],<<"宝库何处">>, <<"升级至40级">>, [{"我这就施法算出宝库位置…就在此地的西南方向，你前去看看。"}],[{"是哪来的窃贼！想要偷盗黄泉大帝宝库中的宝物！"},{""}],120, 39, 0, 2, 0, 0, [{0,0,541004201,83000},{0,0,531004201,2600}],[],0, 122, 0};	
get(122)->
	{tpl_task, 122, 0, 10038, 106, 10038, 106, 1, [{20055,45,0}],<<"忠心守卫">>, <<"杀青狼妖">>, [{"黄泉大帝死后，我守护宝库万年，很快就要吸取宝物中的灵气得道升仙！岂能让你夺走！"}],[{"大仙饶命…我愿意将开启宝库的天武之钥送与大仙！"},{"看你倒乖。"}],121, 40, 0, 2, 0, 0, [{0,0,541004201,83300},{0,0,551004201,190}],[],0, 123, 0};	
get(123)->
	{tpl_task, 123, 0, 10038, 106, 10038, 106, 2, [{11019,7,0}],<<"阴谋诡计">>, <<"得天武之钥">>, [{"天武之钥就在那边，大仙只要前去施展法术，就能取得钥匙。"}],[{"嗯？这天武之钥竟然没有将你炸死？你你你…竟然识破了我的计谋！"},{"我火眼金睛，自然识破了你是用雷球所幻化的天武之钥！"}],122, 40, 0, 2, 0, 0, [{0,0,541004201,83300},{0,0,531004201,2700}],[],0, 124, 0};	
get(124)->
	{tpl_task, 124, 0, 10038, 106, 10038, 106, 0, [{10038}],<<"真心归顺">>, <<"找孤煞">>, [{"我…只是忠于守护天武之库而已！大仙神通广大，我真心愿意归顺！"}],[{"待小的替主人解开天武之钥上的封印！"},{""}],123, 40, 0, 2, 0, 0, [{0,0,541004201,83300},{0,0,551004201,200}],[],0, 125, 0};	
get(125)->
	{tpl_task, 125, 0, 10038, 106, 10028, 107, 0, [{10028}],<<"激发神力">>, <<"找赤骠怒">>, [{"主人，这天武之钥是以大罗精金练成，需要以三昧真火才能激发它开启宝库的神力！"}],[{"%s，怎么又是你！你又来抢我的三昧真火了！"},{"一回生二回熟，这次就直接借给我吧！"}],124, 40, 0, 2, 0, 0, [{0,0,541004201,83300},{0,0,531004201,2800}],[],0, 126, 0};	
get(126)->
	{tpl_task, 126, 0, 10028, 107, 10038, 106, 1, [{20012,45,0}],<<"狂龙血丹">>, <<"杀赤焰妖兽">>, [{"可不能白拿！得替我取一些嗜血狂龙的血龙丹来补充这些真火，不然就被你拿光了！"}],[{"主人你回来了！快用激活过的天武之钥开启宝库吧！"},{""}],125, 40, 0, 2, 0, 0, [{0,0,541004201,83300},{0,0,551004201,210}],[],0, 127, 0};	
get(127)->
	{tpl_task, 127, 0, 10038, 106, 10038, 106, 1, [{20017,50,0}],<<"蜂鸟苏醒">>, <<"杀幽林蜂鸟">>, [{"宝库已经开启，可里面封印的蜂鸟守卫也苏醒了，它们不听我指挥，只会狂热进攻…"}],[{"以主人目前的修为，只能打开宝库第二层，狐族秘宝却在第七层…"},{"你怎么不早说…"}],126, 40, 0, 2, 0, 0, [{0,0,541004201,83300},{0,0,531004201,2900}],[],0, 128, 0};	
get(128)->
	{tpl_task, 128, 0, 10038, 106, 10021, 103, 0, [{10021}],<<"提升境界">>, <<"找灵感真人">>, [{"境界提升了，总能打开的吧…主人要抓紧修炼，常去天州城接领任务能快速提升境界！"}],[{"%s，近来魔族蠢蠢欲动，四处作乱，守护仙界，义不容辞！"},{""}],127, 40, 0, 2, 0, 0, [{0,0,541004201,83300},{0,0,551004201,210}],[],0, 129, 0};	
get(129)->
	{tpl_task, 129, 0, 10021, 103, 10021, 103, 0, [{10021}],<<"降妖伏魔">>, <<"找灵感真人">>, [{"参加降妖伏魔任务，驱除妖魔，能迅速提高自己的境界！"}],[{"魔族每天都会在固定的时间进攻仙界，切记击杀妖魔，守卫仙界！"},{""}],128, 40, 0, 2, 0, 0, [{0,0,541004201,83300}],[],0, 130, 0};	
get(130)->
	{tpl_task, 130, 0, 10021, 103, 10018, 103, 0, [{10018}],<<"再赠武器">>, <<"找惠善">>, [{"%s，为了奖励你对守护仙界所做出的贡献，这把战力更强的武器赠与你。"}],[{"新装备不能缺了装备升级符，升级装备，会让你和你的小伙伴都惊呆了！"},{""}],129, 40, 0, 2, 0, 0, [{0,0,541004201,83300}],[],0, 131, 0};	
get(131)->
	{tpl_task, 131, 0, 10018, 103, 10038, 106, 4, [{41}],<<"面上有光">>, <<"升级至41级">>, [{"看你行色匆匆，想必是还有更重要的事情呀。"}],[{"主人，你的修为果然越来越精进，小的会在这里替你摇旗助威！"},{"嘿嘿，打开宝库之后，可少不了你的好处！"}],130, 40, 0, 2, 0, 0, [{0,0,541004201,83300}],[],0, 132, 0};	
get(132)->
	{tpl_task, 132, 0, 10038, 106, 10023, 103, 0, [{10023}],<<"阵营情谊">>, <<"找方冷">>, [{"主人，我听说天州城里阵营现在热火朝天，大家都在争夺山河榜，主人快去挑战一番吧！"}],[{"%s，好久不见！阵营里的兄弟都很想你！"},{""}],131, 41, 0, 2, 0, 0, [{0,0,541004201,83000}],[],0, 133, 0};	
get(133)->
	{tpl_task, 133, 0, 10023, 103, 10060, 103, 0, [{10060}],<<"倍感欣慰">>, <<"找风长老">>, [{"前去见过风长老吧，他会给你一些登山河榜的指点！"}],[{"看到阵营中有新人的加入，老身十分欣慰！"},{""}],132, 41, 0, 2, 0, 0, [{0,0,541004201,83000}],[],0, 134, 0};	
get(134)->
	{tpl_task, 134, 0, 10060, 103, 10060, 103, 9, [{315}],<<"美名远扬">>, <<"找风长老">>, [{"如今三大阵营都在热衷争夺山河榜，%s，看你能否为自己的阵营争光？"}],[{"做得很好！看来我们阵营能够在山河榜上留下美名！"},{""}],133, 41, 0, 2, 0, 0, [{0,0,541004201,83000}],[],0, 135, 0};	
get(135)->
	{tpl_task, 135, 0, 10060, 103, 10026, 106, 0, [{10026}],<<"久借不归">>, <<"找烈胭脂">>, [{"老身的一本绝技秘籍被烈胭脂借走三月不归，请你向她取回。"}],[{"你忘了和我的约定！没有狐族秘宝，别想让我告诉你碎片下落！"},{""}],134, 41, 0, 2, 0, 0, [{0,0,541004201,83000}],[],0, 136, 0};	
get(136)->
	{tpl_task, 136, 0, 10026, 106, 10026, 106, 1, [{20055,50,0}],<<"背信弃义">>, <<"杀青狼妖">>, [{"因为你的背信弃义，秘宝不能取出，我被视为叛徒，受到追击！"}],[{"看在你替我解困，就姑且再信你一回…一定要给我取回狐族秘宝！"},{"知道了…"}],135, 41, 0, 2, 0, 0, [{0,0,541004201,83000}],[],0, 137, 0};	
get(137)->
	{tpl_task, 137, 0, 10026, 106, 10038, 106, 0, [{10038}],<<"宝库何为">>, <<"找孤煞">>, [{"你再去天武之库那里打探打探，难道真的不能有其他的打开宝库的方式吗？"}],[{"主人！主人救命！"},{""}],136, 41, 0, 2, 0, 0, [{0,0,541004201,83000}],[],0, 138, 0};	
get(138)->
	{tpl_task, 138, 0, 10038, 106, 10038, 106, 1, [{20017,50,0}],<<"蜂鸟聚众">>, <<"杀幽林蜂鸟">>, [{"主人！这些幽林蜂鸟在蛮荒丛林越聚越多，我都快要控制不住它们了！"}],[{"主人现在也只能打开第三层宝库，只能沟通黄泉大帝的魂魄，看能否通融。"},{""}],137, 41, 0, 2, 0, 0, [{0,0,541004201,83000}],[],0, 139, 0};	
get(139)->
	{tpl_task, 139, 0, 10038, 106, 10063, 106, 0, [{10063}],<<"不速之客">>, <<"找禅天卫">>, [{"黄泉大帝的陵墓荒废已久，听说有很多怪兽出没，主人小心！"}],[{"是谁胆敢来打搅黄泉大帝的灵台？闯入者格杀勿论！"},{""}],138, 41, 0, 2, 0, 0, [{0,0,541004201,83000}],[],0, 140, 0};	
get(140)->
	{tpl_task, 140, 0, 10063, 106, 10063, 106, 1, [{20054,50,0}],<<"熟悉气息">>, <<"杀七彩凤凰">>, [{"原来是想要打开天武之库？又是一个贪心人，觊觎宝库之人都不得好死！"}],[{"这熟悉的感觉…仿佛看到了万年前轮回道人的英姿…难道是故人？"},{""}],139, 41, 0, 2, 0, 0, [{0,0,541004201,83000}],[],0, 141, 0};	
get(141)->
	{tpl_task, 141, 0, 10063, 106, 10064, 106, 4, [{44}],<<"故人安在">>, <<"升级至44级">>, [{"或许注定是你来完成黄泉大帝未尽的心愿，我教你如何召唤出他的魂魄。"}],[{"这种熟悉的气息！我仿佛又看到了当年力战妖魔，封印魔门的轮回道人…"},{""}],140, 41, 0, 2, 0, 0, [{0,0,541004201,83000}],[],0, 142, 0};	
get(142)->
	{tpl_task, 142, 0, 10064, 106, 10064, 106, 2, [{11016,8,0}],<<"回复神力">>, <<"得金莲心草">>, [{"想要唤醒我沉睡已久的神力，需要金莲心草的灵力激发才行。"}],[{"神力已复，久违的世界啊...真是陌生…"},{""}],141, 42, 0, 2, 0, 0, [{0,0,541004201,85500}],[],0, 143, 0};	
get(143)->
	{tpl_task, 143, 0, 10064, 106, 10038, 106, 1, [{20054,20,0}],<<"惦念情深">>, <<"杀七彩凤凰">>, [{"没想到孤煞至今还辛勤守卫着宝库，替我给他送些提升境界的内丹作为奖励吧。"}],[{"黄泉大帝竟然还惦念着我，我一定会继续尽忠职守的，呜呜…"},{""}],142, 42, 0, 2, 0, 0, [{0,0,541004201,85500}],[],0, 144, 0};	
get(144)->
	{tpl_task, 144, 0, 10038, 106, 10026, 106, 1, [{20017,50,0}],<<"作威作福">>, <<"杀幽林蜂鸟">>, [{"烈胭脂施咒让幽林蜂鸟作乱，她说是要向主人复仇！"}],[{"对，是我干的，是为了让你吃点苦头，狐族秘宝何时能给我！"},{"我已经去求黄泉大帝了啊…"}],143, 42, 0, 2, 0, 0, [{0,0,541004201,85500}],[],0, 145, 0};	
get(145)->
	{tpl_task, 145, 0, 10026, 106, 10026, 106, 2, [{11016,8,0}],<<"追兵拦捕">>, <<"得金莲心草">>, [{"多说无益...我已被狐族追兵伤了元气，都是你害的！"}],[{"我感觉好了许多…暂且再原谅你这次…"},{"你可一定要相信我啊。"}],144, 42, 0, 2, 0, 0, [{0,0,541004201,85500}],[],0, 146, 0};	
get(146)->
	{tpl_task, 146, 0, 10026, 106, 10064, 106, 0, [{10064}],<<"不知秘宝">>, <<"找黄泉大帝">>, [{"天难道要灭我狐族…狐族秘宝，我必须要得到！"}],[{"狐族秘宝？天武之库中从未有过这样的东西！"},{""}],145, 42, 0, 2, 0, 0, [{0,0,541004201,85500}],[],0, 147, 0};	
get(147)->
	{tpl_task, 147, 0, 10064, 106, 10026, 106, 0, [{10026}],<<"狼狐之争">>, <<"找烈胭脂">>, [{"你前去问问狐族秘宝到底是什么，也好平息她的怒气。"}],[{"蛮荒丛林唯一的水源被狼族占领后，狐族就陷入了困境之中。"},{""}],146, 42, 0, 2, 0, 0, [{0,0,541004201,85500}],[],0, 148, 0};	
get(148)->
	{tpl_task, 148, 0, 10026, 106, 10064, 106, 0, [{10064}],<<"荒凉沙漠">>, <<"找黄泉大帝">>, [{"我求取的秘宝是雨神幡，只要有了它，我们就可以直接取雨水饮用了！"}],[{"原来如此，只是这雨神幡因一次意外，不慎失落在了瀚海沙漠。"},{""}],147, 42, 0, 2, 0, 0, [{0,0,541004201,85500}],[],0, 149, 0};	
get(149)->
	{tpl_task, 149, 0, 10064, 106, 10036, 103, 0, [{10005}],<<"神奇宝物">>, <<"找小萝莉">>, [{"年深日久，不知在茫茫沙海中是否还能寻得这件呼风唤雨的宝贝？"}],[{"雨神幡的下落，老夫倒是知道一二。"},{"大叔，你看起来一点也不老啊。"}],148, 42, 0, 2, 0, 0, [{0,0,541004201,85500}],[],0, 150, 0};	
get(150)->
	{tpl_task, 150, 0, 10036, 103, 10004, 108, 0, [{10004}],<<"长空斗士">>, <<"找长空斗士">>, [{"长空斗士负责看守，或许他能通融。"}],[{"笑话！瀚海沙漠全靠雨神幡带来雨水，不然我们如何生存？"},{""}],149, 42, 0, 2, 0, 0, [{0,0,541004201,85500}],[],0, 151, 0};	
get(151)->
	{tpl_task, 151, 0, 10004, 108, 10004, 108, 1, [{20024,50,0}],<<"魔蝎围攻">>, <<"杀砂海魔蝎">>, [{"哼，不知天高地厚！给你点颜色看看！"}],[{"臭小仙，打败我也没用，就不给你！"},{""}],150, 42, 0, 2, 0, 0, [{0,0,541004201,85500}],[],0, 152, 0};	
get(152)->
	{tpl_task, 152, 0, 10004, 108, 10064, 106, 0, [{10064}],<<"为之不忍">>, <<"找黄泉大帝">>, [{"我绝不会交出雨神幡，否则我们就无法在这里生存下去！"}],[{"这些沙漠中的散仙实在可怜，夺回雨神幡未免太残忍，不可为之。"},{"不把秘宝交给狐族，我又如何知道碎片下落？"}],151, 43, 0, 2, 0, 0, [{0,0,541004201,81200}],[],0, 153, 0};	
get(153)->
	{tpl_task, 153, 0, 10064, 106, 10026, 106, 2, [{11031,8,0}],<<"甘露灵果">>, <<"得甘露灵果">>, [{"采些甘露灵果，送给狐族先解燃眉之急，我再做打算。"}],[{"%s，要不是看在这些灵果份上，我早劈了你！"},{"有话慢慢说嘛…特别是碎片那些事…"}],152, 43, 0, 2, 0, 0, [{0,0,541004201,81200}],[],0, 154, 0};	
get(154)->
	{tpl_task, 154, 0, 10026, 106, 10066, 106, 0, [{10066}],<<"野蛮狼族">>, <<"找狼族头领">>, [{"狼族得寸进尺，占了水源，现在又想抢夺狐族的栖身之所！"}],[{"与奸猾狡诈的狐族同居一地简直是耻辱！必须要驱逐它们！"},{"你们不要欺狐族太甚！连我也看不下去！"}],153, 43, 0, 2, 0, 0, [{0,0,541004201,81200}],[],0, 155, 0};	
get(155)->
	{tpl_task, 155, 0, 10066, 106, 10064, 106, 1, [{20055,50,0}],<<"出手相助">>, <<"杀青狼妖">>, [{"多管闲事，连你也一起赶出去好了！"}],[{"狼族作恶如此，我虽身不在其中，但也不能袖手旁观。"},{""}],154, 43, 0, 2, 0, 0, [{0,0,541004201,81200}],[],0, 156, 0};	
get(156)->
	{tpl_task, 156, 0, 10064, 106, 10066, 106, 2, [{11032,8,0}],<<"镇压符雷">>, <<"得蛮荒符雷">>, [{"丛林深处有一道符雷，你去取来镇压这些作乱的狼族。"}],[{"阴魂不散，你又来多管狼族的闲事了！"},{""}],155, 43, 0, 2, 0, 0, [{0,0,541004201,81200}],[],0, 157, 0};	
get(157)->
	{tpl_task, 157, 0, 10066, 106, 10026, 106, 0, [{10026}],<<"颇有两手">>, <<"找烈胭脂">>, [{"天啊，是符雷！啊~~~~~好难受~~~~~"}],[{"%s，你还真有两下子，轻易就收拾了这些可恶的狼族。"},{""}],156, 43, 0, 2, 0, 0, [{0,0,541004201,81200}],[],0, 158, 0};	
get(158)->
	{tpl_task, 158, 0, 10026, 106, 10064, 106, 0, [{10064}],<<"求雨秘籍">>, <<"找黄泉大帝">>, [{"虽然狼族已去，可丛林水源日益枯竭，再不下雨狐族也支持不了多久。"}],[{"%s，你来得正好，这求雨一事我已经有法子了！"},{""}],157, 43, 0, 2, 0, 0, [{0,0,541004201,81200}],[],0, 159, 0};	
get(159)->
	{tpl_task, 159, 0, 10064, 106, 0, 106, 0, [{10064}],<<"雨神美名">>, <<"找黄泉大帝">>, [{"我的老友萧镜藤人称“雨神”，所到之处，必有雨露。"}],[{""},{""}],158, 43, 0, 2, 0, 0, [{0,0,541004201,81200}],[],0, 160, 0};	
get(160)->
	{tpl_task, 160, 0, 0, 106, 10067, 106, 0, [{10067}],<<"思念老友">>, <<"找萧镜藤">>, [{""}],[{"自从黄泉大帝渡劫飞升，再无人与我摆龙门阵，实在有些寂寞。"},{""}],159, 43, 0, 2, 0, 0, [{0,0,541004201,81200}],[],0, 161, 0};	
get(161)->
	{tpl_task, 161, 0, 10067, 106, 10067, 106, 2, [{11031,8,0}],<<"略有薄酬">>, <<"得甘露灵果">>, [{"求雨一事虽是黄泉大帝所托，但我可不能不索取些薄酬…"}],[{"这些灵果不错，足够让我呼风唤雨了。"},{""}],160, 43, 0, 2, 0, 0, [{0,0,541004201,81200}],[],0, 162, 0};	
get(162)->
	{tpl_task, 162, 0, 10067, 106, 10026, 106, 9, [{316}],<<"感激涕零">>, <<"找烈胭脂">>, [{"现在就让我这个翻云覆雨的雨神，去给蛮荒丛林带来雨露吧！"}],[{"我履行诺言，告诉你封印碎片的下落，快前去取碎片吧。"},{""}],161, 44, 0, 2, 0, 0, [{0,0,541004201,89600}],[],0, 163, 0};	
get(163)->
	{tpl_task, 163, 0, 10026, 106, 10060, 103, 0, [{10060}],<<"履行诺言">>, <<"找风长老">>, [{"%s，谢谢你和萧镜藤，这本秘籍也请你还给长老。"}],[{"%s，你费尽周折替我拿回了秘籍，真是太感谢你了！"},{""}],162, 44, 0, 2, 0, 0, [{0,0,541004201,89600}],[],0, 164, 0};	
get(164)->
	{tpl_task, 164, 0, 10060, 103, 0, 103, 0, [{10060}],<<"天州异事">>, <<"找风长老">>, [{"天州城众人都在为争夺山河榜修炼，可近来城中出现了一些怪事…"}],[{""},{""}],163, 44, 0, 2, 0, 0, [{0,0,541004201,89600}],[],0, 165, 0};	
get(165)->
	{tpl_task, 165, 0, 0, 103, 10061, 103, 0, [{10061}],<<"无故失踪">>, <<"找雅长老">>, [{""}],[{"我阵营中的几位弟子无故失踪，只怕是魔族作祟！"},{""}],164, 44, 0, 2, 0, 0, [{0,0,541004201,89600}],[],0, 166, 0};	
get(166)->
	{tpl_task, 166, 0, 10061, 103, 10068, 103, 0, [{10068}],<<"师妹之言">>, <<"找清羽师妹">>, [{"你来得正好，就在这城中好好调查一番。"}],[{"失踪的几个人都是我师兄，也是我们阵营中最有希望登上山河榜的人。"},{"看来有蹊跷啊！"}],165, 44, 0, 2, 0, 0, [{0,0,541004201,89600}],[],0, 167, 0};	
get(167)->
	{tpl_task, 167, 0, 10068, 103, 10069, 103, 0, [{10069}],<<"师姐之忧">>, <<"找清扬师姐">>, [{"风长老一直最欣赏他们…忽然失踪，真令人伤心！"}],[{"大家都猜测是魔族作乱，除去高手，就无人能够封印魔门了！"},{""}],166, 44, 0, 2, 0, 0, [{0,0,541004201,89600}],[],0, 168, 0};	
get(168)->
	{tpl_task, 168, 0, 10069, 103, 10073, 108, 0, [{10073}],<<"瀚海沙漠">>, <<"找葛沙">>, [{"他们失踪前去了瀚海沙漠，或许那里能有些线索，小心魔族埋伏！"}],[{"天州城来的修仙者？我可没见过…"},{""}],167, 44, 0, 2, 0, 0, [{0,0,541004201,89600}],[],0, 169, 0};	
get(169)->
	{tpl_task, 169, 0, 10073, 108, 10073, 108, 2, [{11030,8,0}],<<"留心狂豹">>, <<"得长剑碎片">>, [{"那些兵器可能是你要找的人掉的，过去看看吧，小心路上的狂豹。"}],[{"兵器上还有血？看来他们的主人真是麻烦大了。"},{""}],168, 44, 0, 2, 0, 0, [{0,0,541004201,89600}],[],0, 170, 0};	
get(170)->
	{tpl_task, 170, 0, 10073, 108, 0, 103, 1, [{20002,50,0}],<<"带血兵器">>, <<"杀狂豹">>, [{"看来狂豹因为你刚才打搅它们而发狂了，去收拾了它们再说。"}],[{"这些兵器，都是失踪的几位师兄的，上面还有血…"},{"不要着急，这些血也不一定是他们的！"}],169, 44, 0, 2, 0, 0, [{0,0,541004201,89600}],[],0, 171, 0};	
get(171)->
	{tpl_task, 171, 0, 0, 103, 10061, 103, 4, [{47}],<<"凶多吉少">>, <<"升级至47级">>, [{"呜呜…他们是不是死了？真的是魔族把他们杀了吗？"}],[{"看来是发生过流血事件，只怕几位弟子凶多吉少…"},{""}],170, 44, 0, 2, 0, 0, [{0,0,541004201,89600}],[],0, 172, 0};	
get(172)->
	{tpl_task, 172, 0, 10061, 103, 10070, 108, 0, [{10070}],<<"蚩幽下落">>, <<"找蚩幽">>, [{"看来真是魔族作祟，想要逐步削弱仙界力量...快去查清此事！"}],[{"救命啊…快救救我…我被一群神秘人劫持到这里…"},{"你就是阵营里的失踪弟子之一吗？"}],171, 45, 0, 2, 0, 0, [{0,0,541004201,88000}],[],0, 173, 0};	
get(173)->
	{tpl_task, 173, 0, 10070, 108, 0, 108, 2, [{11029,9,0}],<<"疗伤龙石">>, <<"得疗伤龙石">>, [{"我们几个同门被劫持至此，只有我逃了出来，却身受重伤…"}],[{""},{""}],172, 45, 0, 2, 0, 0, [{0,0,541004201,88000}],[],0, 174, 0};	
get(174)->
	{tpl_task, 174, 0, 0, 108, 10070, 108, 0, [{10070}],<<"仙魔何人">>, <<"找蚩幽">>, [{""}],[{"那些神秘人脸上蒙着面具，并不是魔族…而是仙界的人！"},{""}],173, 45, 0, 2, 0, 0, [{0,0,541004201,88000}],[],0, 175, 0};	
get(175)->
	{tpl_task, 175, 0, 10070, 108, 10071, 108, 0, [{10071}],<<"杀人救人">>, <<"找胡清牛">>, [{"如今我只想复活师弟，病急乱投医，请你去求求医仙胡清牛吧。"}],[{"要我救人，须要遵从我“杀一人，救一人”的戒律，否则见死不救！"},{"你…你说什么？杀人？"}],174, 45, 0, 2, 0, 0, [{0,0,541004201,88000}],[],0, 176, 0};	
get(176)->
	{tpl_task, 176, 0, 10071, 108, 10070, 108, 0, [{10070}],<<"歪理堵人">>, <<"找蚩幽">>, [{"我起死回生，就是从阎王手里抢人，须得偿上一条人命，才是正理。"}],[{"这医仙名声在外，怎么如此毒辣，哪有杀一人救一人的歪理？"},{""}],175, 45, 0, 2, 0, 0, [{0,0,541004201,88000}],[],0, 177, 0};	
get(177)->
	{tpl_task, 177, 0, 10070, 108, 10071, 108, 2, [{11029,9,0}],<<"滴水不进">>, <<"得疗伤龙石">>, [{"请你采些疗伤龙石赠与医仙，或许他收下药材，就能网开一面。"}],[{"我可不吃这套，想要救治这几人，就给我送上相同人数的性命来。"},{""}],176, 45, 0, 2, 0, 0, [{0,0,541004201,88000}],[],0, 178, 0};	
get(178)->
	{tpl_task, 178, 0, 10071, 108, 10072, 108, 1, [{20022,50,0}],<<"倔强医仙">>, <<"杀荒漠守卫">>, [{"你这人真是冥顽不灵，我可不能坏了我医仙的戒律！关门，放卫兵！"}],[{"清牛性子倔强，这话只是他的医术不敌我毒术的气话而已…"},{""}],177, 45, 0, 2, 0, 0, [{0,0,541004201,88000}],[],0, 179, 0};	
get(179)->
	{tpl_task, 179, 0, 10072, 108, 10072, 108, 0, [{10072}],<<"施以援手">>, <<"找王南孤">>, [{"他因一次比试失败，从此不再行医，编了这个理由搪塞众人。"}],[{"我就担个下毒的虚名帮你一回吧，他一定会再与我比试的。"},{""}],178, 45, 0, 2, 0, 0, [{0,0,541004201,88000}],[],0, 180, 0};	
get(180)->
	{tpl_task, 180, 0, 10072, 108, 10071, 108, 2, [{11025,9,0}],<<"且担虚名">>, <<"得断肠草">>, [{"将七根断肠毒草摆在他们尸身之上，清牛就会知道是我的手法了。"}],[{"啊！这又是南孤的手法！我一定要将他们复生！"},{""}],179, 45, 0, 2, 0, 0, [{0,0,541004201,88000}],[],0, 181, 0};	
get(181)->
	{tpl_task, 181, 0, 10071, 108, 10071, 108, 2, [{11026,9,0}],<<"召唤镇魂">>, <<"得虚空真魂">>, [{"我已将他们的魂魄从虚空中召唤出来，你去搜集起来吧。"}],[{"看你也颇有慈心，一点也不亚于我这个医仙啊…"},{"这句话听起来貌似有点讽刺哎..."}],180, 45, 0, 2, 0, 0, [{0,0,541004201,88000}],[],0, 182, 0};	
get(182)->
	{tpl_task, 182, 0, 10071, 108, 10070, 108, 0, [{10070}],<<"重塑肉身">>, <<"找蚩幽">>, [{"带着这些魂魄，去找该找的人吧…"}],[{"他们的魂魄已经凝聚，须得重塑肉身才能复活！"},{""}],181, 46, 0, 2, 0, 0, [{0,0,541004201,97200}],[],0, 183, 0};	
get(183)->
	{tpl_task, 183, 0, 10070, 108, 10070, 108, 1, [{20024,50,0}],<<"仙丹药引">>, <<"杀砂海魔蝎">>, [{"重塑肉身需要炼制生生造化丹，药引就是魔蝎的毒液，你前去千万当心。"}],[{"师弟们已经复生，多谢恩人，请同我一起查明事情的真相！"},{""}],182, 46, 0, 2, 0, 0, [{0,0,541004201,97200}],[],0, 184, 0};	
get(184)->
	{tpl_task, 184, 0, 10070, 108, 10065, 108, 0, [{10065}],<<"狂妄无极">>, <<"找神秘人">>, [{"当时我在昏迷之际，看到神秘人往那边逃窜了。"}],[{"嘿嘿！蚩幽那个笨蛋，我可是幻化成仙人模样的魔族，哈哈哈！"},{"臭魔族，我一定会封印魔界！"}],183, 46, 0, 2, 0, 0, [{0,0,541004201,97200}],[],0, 185, 0};	
get(185)->
	{tpl_task, 185, 0, 10065, 108, 10065, 108, 1, [{20022,50,0}],<<"荒漠守卫">>, <<"杀荒漠守卫">>, [{"哼，愚蠢的小仙！不让你吃点苦头你就不知道大爷的厉害！"}],[{"有两手，看来倒小看了你…不过要封印魔门，哈哈哈，休想！"},{""}],184, 46, 0, 2, 0, 0, [{0,0,541004201,97200}],[],0, 186, 0};	
get(186)->
	{tpl_task, 186, 0, 10065, 108, 10070, 108, 0, [{10070}],<<"体内神力">>, <<"找蚩幽">>, [{"哈哈哈~~魔族万岁~~~后会有期~~~（消失在虚空中）"}],[{"那神秘人绝不是魔族中人，我与他交手时，能感受到他体内极强的仙界元神！"},{""}],185, 46, 0, 2, 0, 0, [{0,0,541004201,97200}],[],0, 187, 0};	
get(187)->
	{tpl_task, 187, 0, 10070, 108, 10061, 103, 0, [{10061}],<<"疑为叛徒">>, <<"找雅长老">>, [{"我怀疑是仙界叛徒利用魔族身份迷惑我们，快回去找雅长老商量对策！"}],[{"这事颇有蹊跷，只怕仙界中真出了与魔族里应外合的叛徒！"},{""}],186, 46, 0, 2, 0, 0, [{0,0,541004201,97200}],[],0, 188, 0};	
get(188)->
	{tpl_task, 188, 0, 10061, 103, 10060, 103, 0, [{10060}],<<"共商对策">>, <<"找风长老">>, [{"这事须得告知另外两阵营的长老，大家共同拿个主意。"}],[{"仙界中出了如此大事，我也要提醒自己的弟子多加小心！"},{""}],187, 46, 0, 2, 0, 0, [{0,0,541004201,97200}],[],0, 189, 0};	
get(189)->
	{tpl_task, 189, 0, 10060, 103, 10062, 103, 0, [{10062}],<<"里应外合">>, <<"找颂长老">>, [{"颂长老足智多谋，一定会有法子查明此事！"}],[{"叛徒若是与魔族里应外合，仙界只怕难以招架！"},{""}],188, 46, 0, 2, 0, 0, [{0,0,541004201,97200}],[],0, 190, 0};	
get(190)->
	{tpl_task, 190, 0, 10062, 103, 10065, 108, 0, [{10065}],<<"再遇怪人">>, <<"找神秘人">>, [{"那神秘人或许还藏匿在瀚海沙漠，你前去打探，定要当心。"}],[{"嘿嘿，臭小子手脚倒利索，这么快就查到了我的下落？"},{""}],189, 46, 0, 2, 0, 0, [{0,0,541004201,97200}],[],0, 191, 0};	
get(191)->
	{tpl_task, 191, 0, 10065, 108, 10065, 108, 1, [{20002,50,0}],<<"好大口气">>, <<"杀狂豹">>, [{"呵呵…我会让我的下仆好好招待你的。"}],[{"混账小仙！你可知道我要吞并仙界的雄心壮志？"},{"这等邪祟之事，还敢挂在嘴边！"}],190, 46, 0, 2, 0, 0, [{0,0,541004201,97200}],[],0, 192, 0};	
get(192)->
	{tpl_task, 192, 0, 10065, 108, 10065, 108, 9, [{317}],<<"亲自比试">>, <<"找神秘人">>, [{"不作死就不会死！既然你这么不识好歹，那就让我来结束你的生命吧！"}],[{"你还真不怕？好吧，那就让我与你痛快的亲自比试一次！"},{""}],191, 47, 0, 2, 0, 0, [{0,0,541004201,105600}],[],0, 193, 0};	
get(193)->
	{tpl_task, 193, 0, 10065, 108, 10072, 108, 0, [{10072}],<<"棘手之事">>, <<"找王南孤">>, [{"嘿嘿，我可不希望对手是个脓包，先去补补你的元气再来和我斗！"}],[{"%s，你又回来了？想必是遇到了棘手的事。"},{"我急需补充元气，和人比武！"}],192, 47, 0, 2, 0, 0, [{0,0,541004201,105600}],[],0, 194, 0};	
get(194)->
	{tpl_task, 194, 0, 10072, 108, 10065, 108, 2, [{11027,9,0}],<<"口吐狂言">>, <<"得真元沙棘">>, [{"采些真元沙棘服下，这可是补充元气的良药。"}],[{"嘿嘿，无意义的挣扎！总有一天我要统领仙魔二界！"},{"你扮作魔族，祸害仙界，岂能饶你！"}],193, 47, 0, 2, 0, 0, [{0,0,541004201,105600}],[],0, 195, 0};	
get(195)->
	{tpl_task, 195, 0, 10065, 108, 10039, 103, 0, [{10039}],<<"真相为何">>, <<"找薛仁">>, [{"哈哈哈！不管我是谁！我为魔族代言！"}],[{"%s，来得正好，大家都很想知道那个神秘人的真相，他真是魔族吗？"},{"他十分狡猾，还是给他逃了！"}],194, 47, 0, 2, 0, 0, [{0,0,541004201,105600}],[],0, 196, 0};	
get(196)->
	{tpl_task, 196, 0, 10039, 103, 10039, 103, 2, [{11028,9,0}],<<"修补高台">>, <<"得大罗精金">>, [{"近来参加百炼任务的人太多，这台子都被踩得破破烂烂了，能否帮我修补？"}],[{"多谢你，%s，你帮了我大忙！"},{""}],195, 47, 0, 2, 0, 0, [{0,0,541004201,105600}],[],0, 197, 0};	
get(197)->
	{tpl_task, 197, 0, 10039, 103, 10039, 103, 0, [{10039}],<<"应对危机">>, <<"找薛仁">>, [{"众人都在百炼台上磨炼自己，希望能做好准备，应对这次仙界危机！"}],[{"多来千锤百炼，尽早击败这可恶的神秘人！"},{""}],196, 47, 0, 2, 0, 0, [{0,0,541004201,105600}],[],0, 198, 0};	
get(198)->
	{tpl_task, 198, 0, 10039, 103, 10074, 103, 0, [{10074}],<<"吞天之志">>, <<"找燕子苏">>, [{"燕子苏的吞天壶放在我这托我保养，请替我还他，希望他也能协助你。"}],[{"如今天州城中出了如此大事，我可不能袖手旁观。"},{""}],197, 47, 0, 2, 0, 0, [{0,0,541004201,105600}],[],0, 199, 0};	
get(199)->
	{tpl_task, 199, 0, 10074, 103, 10074, 103, 2, [{11012,10,0}],<<"采石补元">>, <<"得五色彩石">>, [{"为了迎战魔族，众人都需要五色彩石补充真元。"}],[{"不错，%s，如今你也学会了未雨绸缪，看来我们胜算在望。"},{""}],198, 47, 0, 2, 0, 0, [{0,0,541004201,105600}],[],0, 200, 0};	
get(200)->
	{tpl_task, 200, 0, 10074, 103, 10068, 103, 0, [{10068}],<<"斗志满满">>, <<"找清羽师妹">>, [{"事态紧急，请你将这些彩石交予天州城众人，让他们做好准备。"}],[{"虽然我修为尚浅，但我绝不会在魔族面前退缩！"},{""}],199, 47, 0, 2, 0, 0, [{0,0,541004201,105600}],[],0, 201, 0};	
get(201)->
	{tpl_task, 201, 0, 10068, 103, 10069, 103, 4, [{49}],<<"首当其冲">>, <<"升级至49级">>, [{"我一定会变成师姐那样的高手的，这样师父才会更喜欢我。"}],[{"清羽修为不足，我不能让师妹以身涉险，守护仙界，我首当其冲。"},{""}],200, 47, 0, 2, 0, 0, [{0,0,541004201,105600}],[],0, 202, 0};	
get(202)->
	{tpl_task, 202, 0, 10069, 103, 10027, 103, 0, [{10027}],<<"危情更真">>, <<"找绝心">>, [{"虽然如今情势危急…但我还有一句话托你转述给绝心…"}],[{"清扬的心，我又怎么会不明白？虽然我名为绝心，可并非无心之人…"},{""}],201, 48, 0, 2, 0, 0, [{0,0,541004201,104800}],[],0, 203, 0};	
get(203)->
	{tpl_task, 203, 0, 10027, 103, 10069, 103, 2, [{11028,10,0}],<<"情比金坚">>, <<"得大罗精金">>, [{"这里有一件东西请你转交，带话给她：情比金坚。"}],[{"绝心…携手击败魔族后，我一定会与你请求月下红娘的见证！"},{"好浪漫…到时请我喝喜酒哦。"}],202, 48, 0, 2, 0, 0, [{0,0,541004201,104800}],[],0, 204, 0};	
get(204)->
	{tpl_task, 204, 0, 10069, 103, 10023, 103, 0, [{10023}],<<"夜观天象">>, <<"找方冷">>, [{"多不好意思…快去继续干你的正事吧！"}],[{"我夜观天象，发觉这次阵营弟子失踪之事，恐怕不仅仅是和魔族有关。"},{""}],203, 48, 0, 2, 0, 0, [{0,0,541004201,104800}],[],0, 205, 0};	
get(205)->
	{tpl_task, 205, 0, 10023, 103, 10070, 108, 0, [{10070}],<<"蛛丝马迹">>, <<"找蚩幽">>, [{"%s，你怎么看？最重要的当然是把那神秘人给揪出来，好好审问一番！"}],[{"%s，我循着这神秘人的蛛丝马迹，查出了许多异常之事。"},{"我与他几次交手，他说的话都十分诡异。"}],204, 48, 0, 2, 0, 0, [{0,0,541004201,104800}],[],0, 206, 0};	
get(206)->
	{tpl_task, 206, 0, 10070, 108, 10004, 108, 0, [{10004}],<<"联合众人">>, <<"找长空斗士">>, [{"只怕是免不了与他的一场恶战，请你去联合瀚海沙漠众人协助我们！"}],[{"只要不夺走我们的雨神幡，替你们打群架什么的都好说！"},{""}],205, 48, 0, 2, 0, 0, [{0,0,541004201,104800}],[],0, 207, 0};	
get(207)->
	{tpl_task, 207, 0, 10004, 108, 10004, 108, 1, [{20024,50,0}],<<"给力前锋">>, <<"杀砂海魔蝎">>, [{"我的小魔蝎们可是厉害角色，你来比试比试，看它们能否成为你的前锋？"}],[{"嘿嘿，不错吧，我就把小东西们借给你，替你把神秘人蛰得嗷嗷叫！"},{""}],206, 48, 0, 2, 0, 0, [{0,0,541004201,104800}],[],0, 208, 0};	
get(208)->
	{tpl_task, 208, 0, 10004, 108, 10005, 108, 0, [{10005}],<<"朝思暮想">>, <<"找小萝莉">>, [{"小萝莉自从上次见了你一面，对你可是朝思暮想，嘿嘿…"}],[{"大英雄，你好久没回沙漠了，我每天都在想你哦！"},{""}],207, 48, 0, 2, 0, 0, [{0,0,541004201,104800}],[],0, 209, 0};	
get(209)->
	{tpl_task, 209, 0, 10005, 108, 10072, 108, 0, [{10072}],<<"小小芳心">>, <<"找王南孤">>, [{"人家好想快点长大，变得漂漂亮亮的，就可以嫁给你了哦！"}],[{"小萝莉如此可爱，希望她能够平安成长，不受魔族的侵袭。"},{""}],208, 48, 0, 2, 0, 0, [{0,0,541004201,104800}],[],0, 210, 0};	
get(210)->
	{tpl_task, 210, 0, 10072, 108, 10072, 108, 0, [{10072}],<<"退魔心愿">>, <<"找王南孤">>, [{"那神出鬼没的神秘人我也见过，看着就不像个好人。"}],[{"我擅长制毒，但并不是恶毒之人，击退魔族也是我的心愿。"},{""}],209, 48, 0, 2, 0, 0, [{0,0,541004201,104800}],[],0, 211, 0};	
get(211)->
	{tpl_task, 211, 0, 10072, 108, 10073, 108, 2, [{11025,10,0}],<<"采毒备用">>, <<"得断肠草">>, [{"断肠草制成的毒蛊是魔族克星，采多一些，才能有备无患。"}],[{"哼哼，跟你一起去杀魔族？太好了！我的兵器可想要见些血了！"},{""}],210, 48, 0, 2, 0, 0, [{0,0,541004201,104800}],[],0, 212, 0};	
get(212)->
	{tpl_task, 212, 0, 10073, 108, 10073, 108, 1, [{20002,50,0}],<<"踌躇满志">>, <<"杀狂豹">>, [{"不过我对你的身手还有些怀疑！你得给我露一手才行！"}],[{"真带感！我最喜欢这样的打打杀杀了！一起去打魔族吧！"},{""}],211, 49, 0, 2, 0, 0, [{0,0,541004201,114000}],[],0, 213, 0};	
get(213)->
	{tpl_task, 213, 0, 10073, 108, 10065, 108, 0, [{10065}],<<"十分轻蔑">>, <<"找神秘人">>, [{"快看！那个人貌似就是你说的神秘人！"}],[{"哈哈！就凭你勾结这些死鱼烂虾，也想阻拦我的脚步？"},{""}],212, 49, 0, 2, 0, 0, [{0,0,541004201,114000}],[],0, 214, 0};	
get(214)->
	{tpl_task, 214, 0, 10065, 108, 10065, 108, 0, [{10065}],<<"一番激战">>, <<"找神秘人">>, [{"我会让你知道我的厉害的…"}],[{"哼，虽然功力有几分长进，可要想打败我，还早得很！"},{""}],213, 49, 0, 2, 0, 0, [{0,0,541004201,114000}],[],0, 215, 0};	
get(215)->
	{tpl_task, 215, 0, 10065, 108, 10072, 108, 9, [{318}],<<"再次逃脱">>, <<"找王南孤">>, [{"好好再对你进行磨炼吧~~哈哈哈~~"}],[{"又被这魂淡跑了，几时才能捉住他呢？唉…"},{""}],214, 49, 0, 2, 0, 0, [{0,0,541004201,114000}],[],0, 216, 0};	
get(216)->
	{tpl_task, 216, 0, 10072, 108, 10005, 108, 0, [{10005}],<<"得知内情">>, <<"找小萝莉">>, [{"小萝莉无意中知道了神秘人的一些内情，她可被吓坏了。"}],[{"人家是去采花时，听到他说自己是仙界的人，要颠覆仙界.."},{""}],215, 49, 0, 2, 0, 0, [{0,0,541004201,114000}],[],0, 217, 0};	
get(217)->
	{tpl_task, 217, 0, 10005, 108, 10070, 108, 0, [{10070}],<<"仙界叛徒">>, <<"找蚩幽">>, [{"呜呜…小萝莉好害怕，大英雄你一定要把他给打败呀！"}],[{"果然不出我所料，仙界出了叛徒！"},{""}],216, 49, 0, 2, 0, 0, [{0,0,541004201,114000}],[],0, 218, 0};	
get(218)->
	{tpl_task, 218, 0, 10070, 108, 10071, 108, 0, [{10071}],<<"斗法大赛">>, <<"找胡清牛">>, [{"仙界不久要召开斗法大赛，神秘人恐怕会前去作乱。"}],[{"若要混入斗法大赛接近神秘人，你须得易容，才能混淆视听。"},{""}],217, 49, 0, 2, 0, 0, [{0,0,541004201,114000}],[],0, 219, 0};	
get(219)->
	{tpl_task, 219, 0, 10071, 108, 10071, 108, 1, [{20024,50,0}],<<"可恶毒蝎">>, <<"杀砂海魔蝎">>, [{"先帮我把毁我药材的毒蝎给教训一番，我才能教你易容术。"}],[{"不错，这还只是第一件事！"},{""}],218, 49, 0, 2, 0, 0, [{0,0,541004201,114000}],[],0, 220, 0};	
get(220)->
	{tpl_task, 220, 0, 10071, 108, 10071, 108, 2, [{11029,12,0}],<<"库房空空">>, <<"得疗伤龙石">>, [{"第二件事呢，就是给我弄些疗伤龙石，我的药房快空了。"}],[{"任劳任怨，手脚利索，真是帮了我大忙。"},{""}],219, 49, 0, 2, 0, 0, [{0,0,541004201,114000}],[],0, 221, 0};	
get(221)->
	{tpl_task, 221, 0, 10071, 108, 10072, 108, 4, [{50}],<<"愿赌服输">>, <<"升级至50级">>, [{"这第三件事…转告南孤：我愿服输。"}],[{"清牛果然是看开了，否则这样整天斗来斗去，有什么意思？"},{""}],220, 49, 0, 2, 0, 0, [{0,0,541004201,114000}],[],0, 222, 0};	
get(222)->
	{tpl_task, 222, 0, 10072, 108, 10071, 108, 0, [{10071}],<<"偷天换日">>, <<"找胡清牛">>, [{"三件事都已完成，快去清牛那里学习易容术吧。"}],[{"很好！现在已经不会有第三人知道你的真实模样！"},{""}],221, 50, 0, 2, 0, 0, [{0,0,541004201,263600}],[],0, 223, 0};	
get(223)->
	{tpl_task, 223, 0, 10071, 108, 10069, 103, 0, [{10069}],<<"神秘真身">>, <<"找清扬师姐">>, [{"易容术时效有限，速去速回，万事当心！"}],[{"天州城里一片混乱，神秘人的身份已经明确了。"},{""}],222, 50, 0, 2, 0, 0, [{0,0,541004201,263600}],[],0, 224, 0};	
get(224)->
	{tpl_task, 224, 0, 10069, 103, 10068, 103, 0, [{10068}],<<"出乎意料">>, <<"找清羽师妹">>, [{"神秘人的真身竟然是风长老！实在是太出乎大家意料了！"}],[{"看到自己的恩师竟然背叛仙界，让人好痛心。"},{""}],223, 50, 0, 2, 0, 0, [{0,0,541004201,263600}],[],0, 225, 0};	
get(225)->
	{tpl_task, 225, 0, 10068, 103, 10074, 103, 0, [{10074}],<<"勾结作乱">>, <<"找燕子苏">>, [{"另外两位长老也一同失踪，原来是他们一同勾结作乱。"}],[{"为人师表应当正气凛然，三长老背叛仙界，真是令人不敢相信。"},{""}],224, 50, 0, 2, 0, 0, [{0,0,541004201,263600}],[],0, 226, 0};	
get(226)->
	{tpl_task, 226, 0, 10074, 103, 10065, 108, 0, [{10065}],<<"一网打尽">>, <<"找神秘人">>, [{"不论如何，%s，请你声张正义，将他们一网打尽！"}],[{"终于被你识破了我的真面目，呵呵呵…这样也好让你死个明白！"},{""}],225, 50, 0, 2, 0, 0, [{0,0,541004201,263600}],[],0, 227, 0};	
get(227)->
	{tpl_task, 227, 0, 10065, 108, 10065, 108, 1, [{20022,50,0}],<<"临死妄言">>, <<"杀荒漠守卫">>, [{"我劝你还是就此收手，以免追悔莫及！"}],[{"你…又怎么可能会知道…仙界的秘密…"},{""}],226, 50, 0, 2, 0, 0, [{0,0,541004201,263600}],[],0, 228, 0};	
get(228)->
	{tpl_task, 228, 0, 10065, 108, 10070, 108, 0, [{10070}],<<"疑惑重重">>, <<"找蚩幽">>, [{"他们困住我们…利用我们…（断气死去）"}],[{"这件事竟然是三长老联手，真没想到他们一起成了仙界叛徒。"},{""}],227, 50, 0, 2, 0, 0, [{0,0,541004201,263600}],[],0, 229, 0};	
get(229)->
	{tpl_task, 229, 0, 10070, 108, 10071, 108, 0, [{10071}],<<"除去大患">>, <<"找胡清牛">>, [{"虽然这事让人十分痛心，但终究为仙界除去了大患。"}],[{"哦？你已查明真相？那就让我来替你解开易容术。"},{""}],228, 50, 0, 2, 0, 0, [{0,0,541004201,263600}],[],0, 230, 0};	
get(230)->
	{tpl_task, 230, 0, 10071, 108, 10071, 108, 1, [{20002,50,0}],<<"解除易容">>, <<"杀狂豹">>, [{"狂豹的内丹能解除易容术，它们十分凶猛，你要当心。"}],[{"这些狂豹作乱让我十分头痛，没想到你轻易解决了它们。"},{""}],229, 50, 0, 2, 0, 0, [{0,0,541004201,263600}],[],0, 231, 0};	
get(231)->
	{tpl_task, 231, 0, 10071, 108, 10074, 103, 4, [{53}],<<"圆满解决">>, <<"升级至53级">>, [{"任务完成得十分圆满，%s，大家都会感谢你的！"}],[{"虽然不知他们的死言是什么意思，但天州城终于回复了平安。"},{""}],230, 50, 0, 2, 0, 0, [{0,0,541004201,263600}],[],0, 232, 0};	
get(232)->
	{tpl_task, 232, 0, 10074, 103, 10074, 103, 0, [{10074}],<<"化解危机">>, <<"找燕子苏">>, [{"仙界会挑选德高望重之人，继任风雅颂三长老的名号。"}],[{"%s，如今你圆满化解了天州城危机，大家对你都十分景仰！"},{""}],231, 51, 0, 2, 0, 0, [{0,0,541004201,286600}],[],0, 233, 0};	
get(233)->
	{tpl_task, 233, 0, 10074, 103, 10069, 103, 0, [{10069}],<<"媒人美名">>, <<"找清扬师姐">>, [{"继续前行吧，收集炼化封印碎片，早日封印魔门！"}],[{"%s，多谢你替我向绝心表明心迹，你就是我们的媒人…嘻嘻！"},{""}],232, 51, 0, 2, 0, 0, [{0,0,541004201,286600}],[],0, 234, 0};	
get(234)->
	{tpl_task, 234, 0, 10069, 103, 10075, 110, 9, [{319}],<<"森严晶宫">>, <<"找章鱼守卫">>, [{"听说有一部分封印碎片落入了乱神海，你一路带着妹子，可要保护好她！"}],[{"是什么人？这戒律森严的水晶宫也是你能擅闯的？"},{""}],233, 51, 0, 2, 0, 0, [{0,0,541004201,286600}],[],0, 235, 0};	
get(235)->
	{tpl_task, 235, 0, 10075, 110, 10075, 110, 2, [{11033,5,0}],<<"东海水晶">>, <<"得东海水晶">>, [{"原来是打听封印碎片的下落？给我弄点儿东海水晶，我就考虑告诉你。"}],[{"很识相嘛！哈哈…这些水晶成色不错，我可以发财了…"},{""}],234, 51, 0, 2, 0, 0, [{0,0,541004201,286600}],[],0, 236, 0};	
get(236)->
	{tpl_task, 236, 0, 10075, 110, 10076, 110, 0, [{10076}],<<"生财有路">>, <<"找镇海力士">>, [{"不过呢…我只是一个看门的，哪知道封印碎片的事？哈哈哈…"}],[{"章鱼守卫用这招可是骗了不少人，他囤积的东海水晶已经够他吃喝八辈子了！"},{""}],235, 51, 0, 2, 0, 0, [{0,0,541004201,286600}],[],0, 237, 0};	
get(237)->
	{tpl_task, 237, 0, 10076, 110, 10077, 110, 0, [{10077}],<<"恐入冷宫">>, <<"找龙妃">>, [{"你来得真是巧了，水晶宫中因为夜明珠失窃而乱作一团，快来帮帮我们吧。"}],[{"夜明珠一直由本宫保管，如今神秘失踪，龙王一定会把本宫打入冷宫的…"},{""}],236, 51, 0, 2, 0, 0, [{0,0,541004201,286600}],[],0, 238, 0};	
get(238)->
	{tpl_task, 238, 0, 10077, 110, 10079, 110, 1, [{20004,50,0}],<<"龙颜大怒">>, <<"杀龙虾兵士">>, [{"呜呜…你看那些龙虾兵士，一定是来押本宫去冷宫的，好害怕…"}],[{"本王一直宠爱龙妃，将夜明珠交由她保管，谁知这贱人竟然丢失了宝物！"},{""}],237, 51, 0, 2, 0, 0, [{0,0,541004201,286600}],[],0, 239, 0};	
get(239)->
	{tpl_task, 239, 0, 10079, 110, 10077, 110, 0, [{10077}],<<"万般委屈">>, <<"找龙妃">>, [{"本王有理由怀疑她不忠，龙妃一定是将夜明珠送给了小三！"}],[{"呜呜呜…好冤枉啊…臣妾没有啊，臣妾做不到啊！"},{""}],238, 51, 0, 2, 0, 0, [{0,0,541004201,286600}],[],0, 240, 0};	
get(240)->
	{tpl_task, 240, 0, 10077, 110, 10078, 110, 0, [{10078}],<<"清白可证">>, <<"找金鳞侍女">>, [{"那天忽然卷起一阵妖风，夜明珠就忽然失踪了…"}],[{"我可以用性命做保证，龙妃是清白的，夜明珠的确是被妖风刮走了。"},{""}],239, 51, 0, 2, 0, 0, [{0,0,541004201,286600}],[],0, 241, 0};	
get(241)->
	{tpl_task, 241, 0, 10078, 110, 10079, 110, 1, [{20004,50,0}],<<"蒙蔽谎言">>, <<"杀龙虾兵士">>, [{"龙王如今派兵将我们严加看守，你得突破重围才能替龙妃伸冤。"}],[{"听起来真是骗小孩的谎话！休想轻易蒙蔽本王，拿出证据来！"},{""}],240, 51, 0, 2, 0, 0, [{0,0,541004201,286600}],[],0, 242, 0};	
get(242)->
	{tpl_task, 242, 0, 10079, 110, 10079, 110, 2, [{11034,1,0}],<<"龙宫金牌">>, <<"得龙金腰牌">>, [{"这里有块龙金腰牌，可以保你在龙宫出入自由，彻查此案！"}],[{"若是三日内夜明珠还不能归还原位，海水倒灌，水晶宫就会陷入灭顶之灾！"},{""}],241, 52, 0, 2, 0, 0, [{0,0,541004201,309400}],[],0, 243, 0};	
get(243)->
	{tpl_task, 243, 0, 10079, 110, 10078, 110, 0, [{10078}],<<"神秘黑影">>, <<"找金鳞侍女">>, [{"快去彻查清楚，否则砍你的脑袋！"}],[{"我想起来了，那天在妖风里，我隐约看见一个巨大的黑影…好可怕！"},{""}],242, 52, 0, 2, 0, 0, [{0,0,541004201,309400}],[],0, 244, 0};	
get(244)->
	{tpl_task, 244, 0, 10078, 110, 10011, 110, 0, [{10011}],<<"恐怖谣言">>, <<"找幻螺女巫">>, [{"难道是镇压千年的怒海黑龙现身，来强夺夜明珠？天啊，越想越害怕！"}],[{"黑龙醒，明珠落，龙宫覆…难道我们都逃不过这个可怕的预言？"},{""}],243, 52, 0, 2, 0, 0, [{0,0,541004201,309400}],[],0, 245, 0};	
get(245)->
	{tpl_task, 245, 0, 10011, 110, 10011, 110, 1, [{20060,50,0}],<<"鲛人侍卫">>, <<"杀鲛人侍卫">>, [{"嗯？有妖气？快保护我！"}],[{"竟然是鲛人！他们可是怒海黑龙的侍卫，难道是夜明珠之力让他们苏醒了？"},{""}],244, 52, 0, 2, 0, 0, [{0,0,541004201,309400}],[],0, 246, 0};	
get(246)->
	{tpl_task, 246, 0, 10011, 110, 10081, 110, 0, [{10081}],<<"千万淡定">>, <<"找玄海真人">>, [{"快找我的师兄商量对策，夜明珠落入黑龙之手，真是大事不妙！"}],[{"淡定，年轻人…我师妹总是小事化大，成日咋咋呼呼，吓死个人！"},{""}],245, 52, 0, 2, 0, 0, [{0,0,541004201,309400}],[],0, 247, 0};	
get(247)->
	{tpl_task, 247, 0, 10081, 110, 10081, 110, 2, [{11036,3,0}],<<"符印结界">>, <<"得冥海符印">>, [{"我当然有自信打败黑龙它，教你布下结界，击败它真是小菜一碟。"}],[{"有了我的结界，怒海黑龙自会乖乖交出夜明珠，束手就擒，哈哈！"},{""}],246, 52, 0, 2, 0, 0, [{0,0,541004201,309400}],[],0, 248, 0};	
get(248)->
	{tpl_task, 248, 0, 10081, 110, 10011, 110, 0, [{10011}],<<"天壤之别">>, <<"找幻螺女巫">>, [{"这布结界的法子，你也给师妹带去吧，最重要的是：淡定。"}],[{"真是不敢相信我和师兄同出一门，性格却如此天壤之别！"},{""}],247, 52, 0, 2, 0, 0, [{0,0,541004201,309400}],[],0, 249, 0};	
get(249)->
	{tpl_task, 249, 0, 10011, 110, 10081, 110, 0, [{10081}],<<"自尊受损">>, <<"找玄海真人">>, [{"有了夜明珠，黑龙的实力百倍增强，我放心不下师兄，请你去协助他。"}],[{"我的…自尊…和我的身体一同受损了…"},{""}],248, 52, 0, 2, 0, 0, [{0,0,541004201,309400}],[],0, 250, 0};	
get(250)->
	{tpl_task, 250, 0, 10081, 110, 10081, 110, 1, [{20060,50,0}],<<"突破结界">>, <<"杀鲛人侍卫">>, [{"该死的鲛人侍卫竟然突破了结界…将我打成这样…"}],[{"小友好样的，你三两下就把它们给击溃了…咳咳…"},{""}],249, 52, 0, 2, 0, 0, [{0,0,541004201,309400}],[],0, 251, 0};	
get(251)->
	{tpl_task, 251, 0, 10081, 110, 10081, 110, 2, [{11035,5,0}],<<"珊瑚补血">>, <<"得补血珊瑚">>, [{"咳咳…我伤得不轻，快给我想想办法，好难过…"}],[{"多谢你，我的确不该这么淡定，不然也不会有今日这一劫，咳！"},{""}],250, 52, 0, 2, 0, 0, [{0,0,541004201,309400}],[],0, 252, 0};	
get(252)->
	{tpl_task, 252, 0, 10081, 110, 10011, 110, 0, [{10011}],<<"无颜见人">>, <<"找幻螺女巫">>, [{"恐怕师妹那边也会需要草药，替我带去给她吧，我是无颜见她了。"}],[{"师兄这种超良好的自我感觉，什么时候才能治好啊，真拿他没法子！"},{""}],251, 53, 0, 2, 0, 0, [{0,0,541004201,332200}],[],0, 253, 0};	
get(253)->
	{tpl_task, 253, 0, 10011, 110, 10082, 110, 0, [{10082}],<<"魔君坐骑">>, <<"找蚌巡捕">>, [{"我不需要你保护，你还是快去找抢走夜明珠的黑龙吧。"}],[{"传说黑龙是魔君坐骑，魔门破碎后，它躲进了仙界。"},{""}],252, 53, 0, 2, 0, 0, [{0,0,541004201,332200}],[],0, 254, 0};	
get(254)->
	{tpl_task, 254, 0, 10082, 110, 10083, 110, 0, [{10083}],<<"怒气释放">>, <<"找鳝力士">>, [{"如果黑龙被镇压千年的怒气释放出来，乱神海可要翻天了。"}],[{"啧啧！老子天不怕地不怕，难道还会怕一只小小的魔君坐骑？"},{""}],253, 53, 0, 2, 0, 0, [{0,0,541004201,332200}],[],0, 255, 0};	
get(255)->
	{tpl_task, 255, 0, 10083, 110, 10083, 110, 1, [{20060,50,0}],<<"轻而易举">>, <<"杀鲛人侍卫">>, [{"不要担心！我们这就去狠狠把小鲛人揍一顿！"}],[{"老子身手如何？乱神海第一力士的名号可不是吹的…"},{""}],254, 53, 0, 2, 0, 0, [{0,0,541004201,332200}],[],0, 256, 0};	
get(256)->
	{tpl_task, 256, 0, 10083, 110, 10083, 110, 9, [{320}],<<"义愤填膺">>, <<"找鳝力士">>, [{"夜明珠竟然还威胁到了龙妃的清白？这事老子可不能不管，走起！"}],[{"切！竟然被这丫给跑了，改日老子抓住它，痛揍一顿！"},{""}],255, 53, 0, 2, 0, 0, [{0,0,541004201,332200}],[],0, 257, 0};	
get(257)->
	{tpl_task, 257, 0, 10083, 110, 10077, 110, 0, [{10077}],<<"心存崇拜">>, <<"找龙妃">>, [{"我虽然是个粗人，不过…对龙妃还是很崇拜的，记得替我向她问个好！"}],[{"竟然是鳝力士力挺本宫的清白吗？没想到他虽然是个粗人，却也热心。"},{""}],256, 53, 0, 2, 0, 0, [{0,0,541004201,332200}],[],0, 258, 0};	
get(258)->
	{tpl_task, 258, 0, 10077, 110, 10079, 110, 0, [{10079}],<<"委曲求全">>, <<"找神海龙王">>, [{"什么？夜明珠是被怒海黑龙盗走的？快替本宫对龙王言明此事吧！"}],[{"唔…看来真是本王误会了龙妃？真是委屈我的小美人了。"},{""}],257, 53, 0, 2, 0, 0, [{0,0,541004201,332200}],[],0, 259, 0};	
get(259)->
	{tpl_task, 259, 0, 10079, 110, 10011, 110, 0, [{10011}],<<"两肋插刀">>, <<"找幻螺女巫">>, [{"帮人帮到底，%s，本王恳请你联合众人，去击败黑龙，追回夜明珠！"}],[{"想不到你这样肩负使命的大英雄，也要我们这些小屌丝的帮助，嘻嘻…"},{""}],258, 53, 0, 2, 0, 0, [{0,0,541004201,332200}],[],0, 260, 0};	
get(260)->
	{tpl_task, 260, 0, 10011, 110, 10081, 110, 4, [{56}],<<"保守秘密">>, <<"升级至56级">>, [{"师兄虽然自尊受损，可是实力还是恢复了，记得叫上他。"}],[{"%s，之前在我身上发生的事，绝对不可以让除了师妹以外的其他人知道！"},{""}],259, 53, 0, 2, 0, 0, [{0,0,541004201,332200}],[],0, 261, 0};	
get(261)->
	{tpl_task, 261, 0, 10081, 110, 10011, 110, 1, [{20061,50,0}],<<"龟波神功">>, <<"杀鲛人喽啰">>, [{"看来又来了一大波新的怪物，看我的龟波神功！"}],[{"师兄果然是好了伤疤忘了痛的性子啊，这会子又得瑟上了。"},{""}],260, 53, 0, 2, 0, 0, [{0,0,541004201,332200}],[],0, 262, 0};	
get(262)->
	{tpl_task, 262, 0, 10011, 110, 10083, 110, 0, [{10083}],<<"无力招架">>, <<"找鳝力士">>, [{"因为夜明珠的缘故，黑龙的侍卫越聚越多，只怕我们三人无力招架。"}],[{"这么爽的激斗，怎么可以忘了叫上老子，小心我抽你！"},{""}],261, 54, 0, 2, 0, 0, [{0,0,541004201,355200}],[],0, 263, 0};	
get(263)->
	{tpl_task, 263, 0, 10083, 110, 10011, 110, 1, [{20061,50,0}],<<"调虎离山">>, <<"杀鲛人喽啰">>, [{"臭怪物，害得龙妃差点被冤，待老子将你们剁成肉酱！呔！"}],[{"不要只顾着打斗，此地怪物越来越多，恐怕龙王那边有危险！"},{""}],262, 54, 0, 2, 0, 0, [{0,0,541004201,355200}],[],0, 264, 0};	
get(264)->
	{tpl_task, 264, 0, 10011, 110, 10078, 110, 0, [{10078}],<<"不幸中计">>, <<"找金鳞侍女">>, [{"或许这是怒海黑龙的调虎离山之计，快回水晶宫保护龙王他们要紧。"}],[{"我们中计了了…黑龙带着手下闯进了水晶宫，把龙王给打伤了..."},{""}],263, 54, 0, 2, 0, 0, [{0,0,541004201,355200}],[],0, 265, 0};	
get(265)->
	{tpl_task, 265, 0, 10078, 110, 10079, 110, 2, [{11035,3,0}],<<"救人一命">>, <<"得补血珊瑚">>, [{"龙王身受重伤，水晶宫里乱成一团！"}],[{"咳咳…本王这条命是恩人从鬼门关上捡回来的，本王感恩不尽…"},{""}],264, 54, 0, 2, 0, 0, [{0,0,541004201,355200}],[],0, 266, 0};	
get(266)->
	{tpl_task, 266, 0, 10079, 110, 10079, 110, 0, [{10079}],<<"水洞碎片">>, <<"找神海龙王">>, [{"听说恩人是在寻找封印碎片？传说有片碎片确实落入了附近的水洞里。"}],[{"只是怒海黑龙始终没有现身，实在让本王放不下心来。"},{""}],265, 54, 0, 2, 0, 0, [{0,0,541004201,355200}],[],0, 267, 0};	
get(267)->
	{tpl_task, 267, 0, 10079, 110, 10069, 110, 0, [{10069}],<<"神海归来">>, <<"找清扬师姐">>, [{"水晶宫好歹平静了，本王冤枉了龙妃，会好好补偿她的。"}],[{"%s，去乱神海走了一遭，是否找到了魔门封印的碎片？"},{""}],266, 54, 0, 2, 0, 0, [{0,0,541004201,355200}],[],0, 268, 0};	
get(268)->
	{tpl_task, 268, 0, 10069, 110, 10025, 103, 0, [{10025}],<<"龙鳞疑云">>, <<"找金不换">>, [{"这…这看起来一点也不像封印的碎片，反而像巨大的龙鳞！"}],[{"清扬说得不错，这确实是龙鳞，看来此事并没有这么简单。"},{""}],267, 54, 0, 2, 0, 0, [{0,0,541004201,355200}],[],0, 269, 0};	
get(269)->
	{tpl_task, 269, 0, 10025, 103, 10074, 103, 0, [{10074}],<<"协力守护">>, <<"找燕子苏">>, [{"怒海黑龙是魔君坐骑，只怕是为魔君打头阵来的，决不能掉以轻心！"}],[{"仙界一荣俱荣，一损俱损，我们必须要守护仙界！"},{""}],268, 54, 0, 2, 0, 0, [{0,0,541004201,355200}],[],0, 270, 0};	
get(270)->
	{tpl_task, 270, 0, 10074, 103, 10077, 103, 0, [{10077}],<<"猛烈反扑">>, <<"找龙妃">>, [{"怒海黑龙极有可能还潜伏在乱神海，快去将它收服！"}],[{"你可终于回来救我们了，你刚离开乱神海，怒海黑龙又卷土重来了…"},{""}],269, 54, 0, 2, 0, 0, [{0,0,541004201,355200}],[],0, 271, 0};	
get(271)->
	{tpl_task, 271, 0, 10077, 103, 10011, 110, 1, [{20004,50,0}],<<"妖法惑众">>, <<"杀龙虾兵士">>, [{"黑龙在水晶宫内施了妖法，原本守护我们的侍卫现在反过来攻击我们！"}],[{"没想到黑龙的鲛人侍卫对它倒也忠心，将我们追击的去路封得滴水不漏！"},{""}],270, 54, 0, 2, 0, 0, [{0,0,541004201,355200}],[],0, 272, 0};	
get(272)->
	{tpl_task, 272, 0, 10011, 110, 10082, 110, 2, [{11036,2,0}],<<"封印鲛人">>, <<"得冥海符印">>, [{"如今我们必须将这些鲛人封印起来，才能不阻碍我们办正事！"}],[{"快来啊！组团刷怪啊！我这边快扛不住了！"},{""}],271, 55, 0, 2, 0, 0, [{0,0,541004201,469800}],[],0, 273, 0};	
get(273)->
	{tpl_task, 273, 0, 10082, 110, 10081, 110, 1, [{20062,50,0}],<<"手下狂徒">>, <<"杀金鳝大王">>, [{"怒海黑龙的手下实在难对付，打了半天，竟然不掉血！你要小心！"}],[{"这么轻松就将它打得满地找牙，果然还是要有牛逼装备才行！"},{""}],272, 55, 0, 2, 0, 0, [{0,0,541004201,469800}],[],0, 274, 0};	
get(274)->
	{tpl_task, 274, 0, 10081, 110, 10081, 110, 9, [{321}],<<"五感之外">>, <<"找玄海真人">>, [{"我的第六…不，第七感！已经隐隐得感觉到了夜明珠的存在，就在那边！"}],[{"我擦咧，不是吧！你你你…竟然真把夜明珠找回来了？"},{""}],273, 55, 0, 2, 0, 0, [{0,0,541004201,469800}],[],0, 275, 0};	
get(275)->
	{tpl_task, 275, 0, 10081, 110, 10081, 110, 0, [{10081}],<<"玄冥神掌">>, <<"找玄海真人">>, [{"用我的高超智慧判断，难道是中了传说中黑龙练习千年的玄冥神掌？"}],[{"黑龙的玄冥神掌可不是一般的草药能够治疗，真是难办啊。"},{""}],274, 55, 0, 2, 0, 0, [{0,0,541004201,469800}],[],0, 276, 0};	
get(276)->
	{tpl_task, 276, 0, 10081, 110, 10079, 110, 1, [{20060,50,0}],<<"内丹清毒">>, <<"杀鲛人侍卫">>, [{"以毒攻毒，或许那些鲛人体内的灵丹能够逼出你身体中的奇毒。"}],[{"恩人终于把夜明珠给追回了，整个乱神海都对你感恩不尽，哈哈哈！"},{""}],275, 55, 0, 2, 0, 0, [{0,0,541004201,469800}],[],0, 277, 0};	
get(277)->
	{tpl_task, 277, 0, 10079, 110, 10040, 109, 0, [{10040}],<<"犹记小友">>, <<"找红怡郡主">>, [{"只是你的身体看起来实在虚弱，还是快去不老峰找我的朋友看看要紧。"}],[{"老龙王还真是老当益壮，居然还记得不老峰的广大仙友呀。"},{""}],276, 55, 0, 2, 0, 0, [{0,0,541004201,469800}],[],0, 278, 0};	
get(278)->
	{tpl_task, 278, 0, 10040, 109, 10040, 109, 1, [{20057,50,0}],<<"灵蛙鼓噪">>, <<"杀翡翠灵蛙">>, [{"近来灵蛙鼓噪，让我无法潜心修炼，这样下去我的内力怎么提高呀？"}],[{"太好了，以后我可以好好修炼，有空去拔老龙王的胡子，嘻嘻！"},{""}],277, 55, 0, 2, 0, 0, [{0,0,541004201,469800}],[],0, 279, 0};	
get(279)->
	{tpl_task, 279, 0, 10040, 109, 10024, 109, 0, [{10024}],<<"细心诊脉">>, <<"找水月居士">>, [{"%s，看你的脸色不好呀，去找水月居士给你把把脉呗。"}],[{"小郡主说得没错，%s，你在乱神海恐怕是遇到了什么麻烦。"},{""}],278, 55, 0, 2, 0, 0, [{0,0,541004201,469800}],[],0, 280, 0};	
get(280)->
	{tpl_task, 280, 0, 10024, 109, 10044, 109, 0, [{10044}],<<"红颜花蜜">>, <<"找清微">>, [{"待我替你运功疗伤…奇怪，我竟然在你体内感觉到了一股极强的邪气！"}],[{"你怎么这么狼狈呀？来，喝些红颜花蜜补补身子吧。"},{""}],279, 55, 0, 2, 0, 0, [{0,0,541004201,469800}],[],0, 281, 0};	
get(281)->
	{tpl_task, 281, 0, 10044, 109, 10024, 109, 1, [{20058,50,0}],<<"邪气更甚">>, <<"杀小花奴">>, [{"看起来还是不行呀，花奴刚抢走了我的陈酿蜂蜜，或许喝那个能有效吧？"}],[{"折腾一番下来，你体内的邪气反而更甚，老夫断定：你这是魔界邪气入体！"},{""}],280, 55, 0, 2, 0, 0, [{0,0,541004201,469800}],[],0, 282, 0};	
get(282)->
	{tpl_task, 282, 0, 10024, 109, 10020, 109, 0, [{10020}],<<"正邪相缠">>, <<"找冷萝圣女">>, [{"这种坑爹的症状老夫无法医治，赶紧找冷萝圣女想想法子。"}],[{"邪气入体，正邪二气相缠，我感觉到你体内的真气逐渐被邪气给压倒！"},{""}],281, 56, 0, 2, 0, 0, [{0,0,541004201,495600}],[],0, 283, 0};	
get(283)->
	{tpl_task, 283, 0, 10020, 109, 10020, 109, 2, [{11013,5,0}],<<"连续侵蚀">>, <<"得玄武真金">>, [{"只能试试玄武真金对你是否有用，希望能够锁住你的真气！"}],[{"看样子这些邪气还在进一步侵蚀真气，我也一筹莫展了。"},{""}],282, 56, 0, 2, 0, 0, [{0,0,541004201,495600}],[],0, 284, 0};	
get(284)->
	{tpl_task, 284, 0, 10020, 109, 10028, 107, 0, [{10028}],<<"火灵充沛">>, <<"找赤骠怒">>, [{"炎魔谷火行真气充沛，或许能够治疗你体内的邪魔之气。"}],[{"%s，为什么每次见到你，你都是来取三味真火的？我受不了了！"},{""}],283, 56, 0, 2, 0, 0, [{0,0,541004201,495600}],[],0, 285, 0};	
get(285)->
	{tpl_task, 285, 0, 10028, 107, 10028, 107, 1, [{20051,50,0}],<<"心魔相扰">>, <<"杀火元素">>, [{"都是因为这事让我心烦意乱，导致我分化出了心魔！"}],[{"你真有两手，心魔已经害得我三天三夜没睡好觉了。"},{""}],284, 56, 0, 2, 0, 0, [{0,0,541004201,495600}],[],0, 286, 0};	
get(286)->
	{tpl_task, 286, 0, 10028, 107, 10084, 107, 0, [{10084}],<<"令有隐忧">>, <<"找小焰儿">>, [{"还有另一件让我心烦的事：小焰儿不知为啥，已经三天三夜没和我说过一句话了。"}],[{"赤骠怒整天不好好修炼，尽想着我这样的大美女，这怎么行呢？"},{""}],285, 56, 0, 2, 0, 0, [{0,0,541004201,495600}],[],0, 287, 0};	
get(287)->
	{tpl_task, 287, 0, 10084, 107, 10028, 107, 0, [{10028}],<<"走火入魔">>, <<"找赤骠怒">>, [{"最近赤骠怒走火入魔，我也只好让不理他，让他暂时静静心。"}],[{"小焰儿是因为这个原因不理我吗？我的心好痛，好痛啊…"},{""}],286, 56, 0, 2, 0, 0, [{0,0,541004201,495600}],[],0, 288, 0};	
get(288)->
	{tpl_task, 288, 0, 10028, 107, 10056, 107, 1, [{20051,50,0}],<<"心魔反攻">>, <<"杀火元素">>, [{"啊啊啊，心魔又爆出来了，这次它们变得更厉害了！"}],[{"赤骠怒这人真是的，再敢靠近我妹一步，看我不烧死他！"},{""}],287, 56, 0, 2, 0, 0, [{0,0,541004201,495600}],[],0, 289, 0};	
get(289)->
	{tpl_task, 289, 0, 10056, 107, 10084, 107, 0, [{10084}],<<"火爆脾气">>, <<"找小焰儿">>, [{"闭嘴！多管闲事，这是我妹，不是你妹！"}],[{"哥哥的脾气也太火爆了，赤骠怒也是好人来的，只是太痴情而已。"},{""}],288, 56, 0, 2, 0, 0, [{0,0,541004201,495600}],[],0, 290, 0};	
get(290)->
	{tpl_task, 290, 0, 10084, 107, 10028, 107, 0, [{10028}],<<"真火疗伤">>, <<"找赤骠怒">>, [{"啊，好害羞…还是说正事吧！你身上的伤真的不要紧吗？"}],[{"看在你帮我击败心魔的份上，我就再少少的借你一点三味真火好了。"},{""}],289, 56, 0, 2, 0, 0, [{0,0,541004201,495600}],[],0, 291, 0};	
get(291)->
	{tpl_task, 291, 0, 10028, 107, 10081, 110, 4, [{57}],<<"驱邪扶正">>, <<"升级至57级">>, [{"这三昧真火能扶正祛邪，调和真气——看，治好了，哈哈哈！"}],[{"我擦咧，不是吧！居然现在才治好，看来这伤真的超级无敌严重！"},{""}],290, 56, 0, 2, 0, 0, [{0,0,541004201,495600}],[],0, 292, 0};	
get(292)->
	{tpl_task, 292, 0, 10081, 110, 10082, 110, 1, [{20062,50,0}],<<"难以小觑">>, <<"杀金鳝大王">>, [{"你在外面治伤的这段时间，怒海黑龙又带着它的小弟回来了！"}],[{"怒海黑龙果然是魔君坐骑，这丫的实力还真不可小瞧！"},{""}],291, 57, 0, 2, 0, 0, [{0,0,541004201,521600}],[],0, 293, 0};	
get(293)->
	{tpl_task, 293, 0, 10082, 110, 10011, 110, 9, [{322}],<<"妖魔埋伏">>, <<"找幻螺女巫">>, [{"守护水晶宫是我的职责，快跟我一起去收拾它！"}],[{"刚才那恐怖的邪气，恐怕有更可怕的妖魔埋伏在附近！"},{""}],292, 57, 0, 2, 0, 0, [{0,0,541004201,521600}],[],0, 294, 0};	
get(294)->
	{tpl_task, 294, 0, 10011, 110, 10078, 110, 0, [{10078}],<<"一时大意">>, <<"找金鳞侍女">>, [{"这魔族炫耀不了多久了，我们会打败它的，先去看看水晶宫怎样了。"}],[{"原本以为黑龙销声匿迹，我们就安全了，所以一时大意…"},{""}],293, 57, 0, 2, 0, 0, [{0,0,541004201,521600}],[],0, 295, 0};	
get(295)->
	{tpl_task, 295, 0, 10078, 110, 10079, 110, 0, [{10079}],<<"忧思成疾">>, <<"找神海龙王">>, [{"龙妃被怒海黑龙掳走了，下落不明，龙王担心得头都白了。"}],[{"唉，我的小美人龙妃到底被捉到哪里去了？不知现在是死是活？"},{""}],294, 57, 0, 2, 0, 0, [{0,0,541004201,521600}],[],0, 296, 0};	
get(296)->
	{tpl_task, 296, 0, 10079, 110, 10083, 110, 0, [{10083}],<<"振臂高呼">>, <<"找鳝力士">>, [{"没了她，本王连饭都吃不下了，快替本王把龙妃找回来吧。"}],[{"万人迷龙妃被抢走，以老子为首的大批粉丝绝不会善罢甘休！"},{""}],295, 57, 0, 2, 0, 0, [{0,0,541004201,521600}],[],0, 297, 0};	
get(297)->
	{tpl_task, 297, 0, 10083, 110, 10083, 110, 1, [{20061,50,0}],<<"心头之恨">>, <<"杀鲛人喽啰">>, [{"老子要好好把这些黑龙的残余手下收拾一番，也好解心头之恨！"}],[{"哼，好好揍了小怪们一番，还算爽快！"},{""}],296, 57, 0, 2, 0, 0, [{0,0,541004201,521600}],[],0, 298, 0};	
get(298)->
	{tpl_task, 298, 0, 10083, 110, 10082, 110, 0, [{10082}],<<"拯救龙妃">>, <<"找蚌巡捕">>, [{"一定要把我们的偶像龙妃救回来，一根头发丝也不许少！"}],[{"去救龙妃？有神马我能帮上忙的，尽管提！"},{""}],297, 57, 0, 2, 0, 0, [{0,0,541004201,521600}],[],0, 299, 0};	
get(299)->
	{tpl_task, 299, 0, 10082, 110, 10056, 107, 2, [{11036,3,0}],<<"羡煞旁人">>, <<"得冥海符印">>, [{"只怕一路上遇到什么诡异的妖魔，封魔的符印你可要带好！"}],[{"%s，英雄救美的事情看来总少不了你…这艳遇真是羡煞人也！"},{""}],298, 57, 0, 2, 0, 0, [{0,0,541004201,521600}],[],0, 300, 0};	
get(300)->
	{tpl_task, 300, 0, 10056, 107, 10055, 107, 0, [{10055}],<<"娘炮重现">>, <<"找狐不归">>, [{"有关美女的这种八卦别来问我，我看某个娘炮对这种事最敏感了！"}],[{"我知道方圆百里内一切美女的信息~~~因为我想和她们交流变漂漂的秘籍~~~"},{""}],299, 57, 0, 2, 0, 0, [{0,0,541004201,521600}],[],0, 301, 0};	
get(301)->
	{tpl_task, 301, 0, 10055, 107, 10085, 107, 4, [{58}],<<"黑龙真身">>, <<"升级至58级">>, [{"炎魔谷的确是来了一个新的美女，不过她好像遇到了麻烦哦..."}],[{"我就是怒海黑龙的真身！怎么样，我是不是好帅？"},{""}],300, 57, 0, 2, 0, 0, [{0,0,541004201,521600}],[],0, 302, 0};	
get(302)->
	{tpl_task, 302, 0, 10085, 107, 10055, 107, 1, [{20050,50,0}],<<"大为惊恐">>, <<"杀火岩怪">>, [{"哈哈哈，我最喜欢强抢漂亮的妹子了！不服来战！"}],[{"天啊天啊天啊~~魔族来炎魔谷了吗~~~好害怕好害怕！！！"},{""}],301, 58, 0, 2, 0, 0, [{0,0,541004201,547800}],[],0, 303, 0};	
get(303)->
	{tpl_task, 303, 0, 10055, 107, 10056, 107, 0, [{10056}],<<"不屑一顾">>, <<"找玄无忧">>, [{"我脆弱的心灵无法承受了啊啊啊~~~快救救我们这些可怜的小散仙吧~~~"}],[{"瞎逼逼啥啊？最受不了这种烦人的娘炮了！魔族来一个杀一个！"},{""}],302, 58, 0, 2, 0, 0, [{0,0,541004201,547800}],[],0, 304, 0};	
get(304)->
	{tpl_task, 304, 0, 10056, 107, 10056, 107, 1, [{20021,50,0}],<<"心烦意乱">>, <<"杀嗜血狂龙">>, [{"刚才被那娘炮吵得我头晕耳鸣啊，快快给我来一发血龙内丹补补。"}],[{"这帮魔族真烦…闹得我都不能好好修炼！"},{""}],303, 58, 0, 2, 0, 0, [{0,0,541004201,547800}],[],0, 305, 0};	
get(305)->
	{tpl_task, 305, 0, 10056, 107, 10055, 107, 9, [{323}],<<"击退黑龙">>, <<"找狐不归">>, [{"快去把那该死的魔族砍了，把妹子救走，不然那娘炮会一直尖叫的！"}],[{"果然把漂漂的妹子救回来了，你很伟大啊，我好葱白你~~~"},{""}],304, 58, 0, 2, 0, 0, [{0,0,541004201,547800}],[],0, 306, 0};	
get(306)->
	{tpl_task, 306, 0, 10055, 107, 10083, 110, 0, [{10083}],<<"大喜过望">>, <<"找鳝力士">>, [{"喂喂，别走，那妹子还没教我如何变漂漂呢~~~~"}],[{"我们的偶像龙妃回来了！欢呼，撒花！"},{""}],305, 58, 0, 2, 0, 0, [{0,0,541004201,547800}],[],0, 307, 0};	
get(307)->
	{tpl_task, 307, 0, 10083, 110, 10079, 110, 0, [{10079}],<<"美人回宫">>, <<"找神海龙王">>, [{"龙妃！回头看看你痴情的粉丝吧~你挥一挥衣袖，不带走一片云彩~"}],[{"龙妃真的回来了，本王饭也吃得香了，觉也睡得着了…"},{""}],306, 58, 0, 2, 0, 0, [{0,0,541004201,547800}],[],0, 308, 0};	
get(308)->
	{tpl_task, 308, 0, 10079, 110, 10077, 110, 2, [{11035,5,0}],<<"受惊过度">>, <<"得补血珊瑚">>, [{"小美人的脸色看起来不好！大概是受惊过度，气血两亏，要补补！"}],[{"对于救了本宫的人，本宫可是重重有赏的哦。"},{""}],307, 58, 0, 2, 0, 0, [{0,0,541004201,547800}],[],0, 309, 0};	
get(309)->
	{tpl_task, 309, 0, 10077, 110, 10077, 110, 1, [{20004,50,0}],<<"调教护卫">>, <<"杀龙虾兵士">>, [{"龙宫的护卫看你这么勇猛，都很想跟你过过招，讨教退敌的心得。"}],[{"他们这次受了你的调教，以后守护龙宫就得力多了。"},{""}],308, 58, 0, 2, 0, 0, [{0,0,541004201,547800}],[],0, 310, 0};	
get(310)->
	{tpl_task, 310, 0, 10077, 110, 10081, 110, 0, [{10081}],<<"提携旧友">>, <<"找玄海真人">>, [{"%s，与怒海黑龙的这一战，可让你在乱神海名声鹊起了。"}],[{"苟富贵，勿相忘啊！现在你可是乱神海的大英雄了，千万记得日后提携小弟！"},{""}],309, 58, 0, 2, 0, 0, [{0,0,541004201,547800}],[],0, 311, 0};	
get(311)->
	{tpl_task, 311, 0, 10081, 110, 10011, 110, 4, [{59}],<<"解除心结">>, <<"升级至59级">>, [{"之前我的表现怕会让师妹误会，我说不出口，只能托你转达，嘿嘿！"}],[{"师兄以后只要不再这么经常性的犯二，我就没什么意见…"},{""}],310, 58, 0, 2, 0, 0, [{0,0,541004201,547800}],[],0, 312, 0};	
get(312)->
	{tpl_task, 312, 0, 10011, 110, 10011, 110, 1, [{20061,50,0}],<<"亡命之徒">>, <<"杀鲛人喽啰">>, [{"怒海黑龙虽然已被打跑，万一它的小弟们回来反扑就糟了。"}],[{"这里果然还躲藏着好些亡命之徒，看来真是不可小觑。"},{""}],311, 59, 0, 2, 0, 0, [{0,0,541004201,573800}],[],0, 313, 0};	
get(313)->
	{tpl_task, 313, 0, 10011, 110, 10011, 110, 0, [{10011}],<<"难以释怀">>, <<"找幻螺女巫">>, [{"我对这件事始终难以释怀，黑龙虽然伤重，最终仍是侥幸逃脱。"}],[{"只怕它侥幸捡回一条小命，逃回魔界，向魔君求援。"},{""}],312, 59, 0, 2, 0, 0, [{0,0,541004201,573800}],[],0, 314, 0};	
get(314)->
	{tpl_task, 314, 0, 10011, 110, 10083, 110, 1, [{20060,50,0}],<<"蛛丝马迹">>, <<"杀鲛人侍卫">>, [{"我们须得打起精神，再前去刺探一番，看看能寻到什么蛛丝马迹。"}],[{"老子看你们没事闲操心，若是魔族再来乱神海骚扰，老子可要了它们的命！"},{""}],313, 59, 0, 2, 0, 0, [{0,0,541004201,573800}],[],0, 315, 0};	
get(315)->
	{tpl_task, 315, 0, 10083, 110, 10011, 110, 2, [{11036,2,0}],<<"暂时作罢">>, <<"得冥海符印">>, [{"这些小事，你们就只需要协助我，布下结界就行！"}],[{"虽然内心不安，可是遍寻不到怒海黑龙的踪迹，也只能暂时作罢。"},{""}],314, 59, 0, 2, 0, 0, [{0,0,541004201,573800}],[],0, 316, 0};	
get(316)->
	{tpl_task, 316, 0, 10011, 110, 10082, 110, 0, [{10082}],<<"扑朔迷离">>, <<"找蚌巡捕">>, [{"不知其他人有没有什么线索，请你再去查查。"}],[{"当时我与黑龙交手，感觉它的体内元魂十分强大，险些抵御不住。"},{""}],315, 59, 0, 2, 0, 0, [{0,0,541004201,573800}],[],0, 317, 0};	
get(317)->
	{tpl_task, 317, 0, 10082, 110, 10075, 110, 0, [{10075}],<<"不可思议">>, <<"找章鱼守卫">>, [{"黑龙只是魔君的坐骑，怎么会有如此强大的元魂？实在是不可思议。"}],[{"虽然我大家都觉得我是个爱财的打酱油的，但在这里我还有几句话要说…"},{""}],316, 59, 0, 2, 0, 0, [{0,0,541004201,573800}],[],0, 318, 0};	
get(318)->
	{tpl_task, 318, 0, 10075, 110, 10075, 110, 2, [{11033,3,0}],<<"爱财心情">>, <<"得东海水晶">>, [{"不过我爱财心切…没点东西装进口袋，实在是说不出口啊…"}],[{"好多好多的水晶，有了这些，我才不管什么黑龙不黑龙的…嘿嘿嘿…"},{""}],317, 59, 0, 2, 0, 0, [{0,0,541004201,573800}],[],0, 319, 0};	
get(319)->
	{tpl_task, 319, 0, 10075, 110, 10011, 110, 0, [{20004}],<<"倍感惆怅">>, <<"找幻螺女巫">>, [{"啊…失态失态，那个，我要说的是…你千万要小心怒海黑龙！"}],[{"真是惆怅，难道这些人已经觉得黑龙一离开，乱神海就能平安了吗？"},{""}],318, 59, 0, 2, 0, 0, [{0,0,541004201,573800}],[],0, 320, 0};	
get(320)->
	{tpl_task, 320, 0, 10011, 110, 10081, 110, 1, [{20004,50,0}],<<"提点虾兵">>, <<"杀龙虾兵士">>, [{"我绝不会掉以轻心的，请你去好好提点那些虾兵，让他们打起精神来！"}],[{"师妹真是个超级负责的人，和她一比我就差远了。"},{""}],319, 59, 0, 2, 0, 0, [{0,0,541004201,573800}],[],0, 321, 0};	
get(321)->
	{tpl_task, 321, 0, 10081, 110, 10074, 110, 4, [{60}],<<"扑朔迷离">>, <<"升级至60级">>, [{"日后乱神海如果再遇危难，希望你能伸出援手。"}],[{"怒海黑龙一事实在扑朔迷离，只怕真会应了那女巫的预感。"},{""}],320, 59, 0, 2, 0, 0, [{0,0,541004201,573800}],[],0, 322, 0};	
get(322)->
	{tpl_task, 322, 0, 10074, 110, 10074, 103, 0, [{10074}],<<"心感欣慰">>, <<"找燕子苏">>, [{"天州城也不能掉以轻心，是该让手下的弟子跟着你好好练一练了。"}],[{"你的功法已比从前提升了不少，能够看你步步成长，真是欣慰。"},{""}],321, 60, 0, 2, 0, 0, [{0,0,541004201,600800}],[],0, 323, 0};	
get(2049)->
	{tpl_task, 2049, 9, 10074, 0, 10074, 101, 1, [{20001,50,0}],<<"击杀山精">>, <<"击杀山精">>, [{""}],[{""},{""}],-1, 36, 0, 2, 0, 0, [{0,0,541004201,100000},{0,0,531004201,3000},{0,0,582001201,1}],[],0, 2050, 0};	
get(2050)->
	{tpl_task, 2050, 9, 10074, 0, 10074, 101, 1, [{20003,90,0}],<<"教训树妖">>, <<"教训树妖">>, [{""}],[{""},{""}],2049, 36, 0, 2, 0, 0, [{0,0,541004201,100000},{0,0,531004201,3000},{0,0,582001201,1}],[],0, 2051, 0};	
get(2051)->
	{tpl_task, 2051, 9, 10074, 0, 10074, 104, 1, [{20005,90,0}],<<"击败黑鲛">>, <<"击败黑鲛">>, [{""}],[{""},{""}],2050, 36, 0, 2, 0, 0, [{0,0,541004201,100000},{0,0,531004201,3000},{0,0,582001201,1}],[],0, 2052, 0};	
get(2052)->
	{tpl_task, 2052, 9, 10074, 0, 10074, 104, 1, [{20006,90,0}],<<"击退鲛女">>, <<"击退鲛女">>, [{""}],[{""},{""}],2051, 36, 0, 2, 0, 0, [{0,0,541004201,100000},{0,0,531004201,3000},{0,0,582001201,1}],[],0, 2053, 0};	
get(2053)->
	{tpl_task, 2053, 9, 10074, 0, 10074, 104, 1, [{20053,80,0}],<<"收服巨虾">>, <<"收服巨虾">>, [{""}],[{""},{""}],2052, 36, 0, 2, 0, 0, [{0,0,541004201,100000},{0,0,531004201,3000},{0,0,582001201,1}],[],0, 2054, 0};	
get(2054)->
	{tpl_task, 2054, 9, 10074, 0, 10074, 105, 1, [{20059,100,0}],<<"斩杀妖女">>, <<"斩杀妖女">>, [{""}],[{""},{""}],2053, 36, 0, 2, 0, 0, [{0,0,541004201,100000},{0,0,531004201,3000},{0,0,582001201,1}],[],0, 2055, 0};	
get(2055)->
	{tpl_task, 2055, 9, 10074, 0, 10074, 105, 1, [{20011,80,0}],<<"击杀游魂">>, <<"击杀游魂">>, [{""}],[{""},{""}],2054, 36, 0, 2, 0, 0, [{0,0,541004201,100000},{0,0,531004201,3000},{0,0,582001201,1}],[],0, 2056, 0};	
get(2056)->
	{tpl_task, 2056, 9, 10074, 0, 10074, 105, 1, [{20008,40,0}],<<"教训雪精">>, <<"教训雪精">>, [{""}],[{""},{""}],2055, 36, 0, 2, 0, 0, [{0,0,541004201,100000},{0,0,531004201,3000},{0,0,582001201,1}],[],0, 2057, 0};	
get(2057)->
	{tpl_task, 2057, 9, 10074, 0, 10074, 107, 1, [{20015,50,0}],<<"击败神王">>, <<"击败神王">>, [{""}],[{""},{""}],2056, 36, 0, 2, 0, 0, [{0,0,541004201,100000},{0,0,531004201,3000},{0,0,582001201,1}],[],0, 2058, 0};	
get(2058)->
	{tpl_task, 2058, 9, 10074, 0, 10074, 107, 1, [{20012,30,0}],<<"击退妖兽">>, <<"击退妖兽">>, [{""}],[{""},{""}],2057, 36, 0, 2, 0, 0, [{0,0,541004201,100000},{0,0,531004201,3000},{0,0,582001201,1}],[],0, 2059, 0};	
get(2059)->
	{tpl_task, 2059, 9, 10074, 0, 10074, 107, 1, [{20050,90,0}],<<"收服火岩">>, <<"收服火岩">>, [{""}],[{""},{""}],2058, 36, 0, 2, 0, 0, [{0,0,541004201,100000},{0,0,531004201,3000},{0,0,582001201,1}],[],0, 2060, 0};	
get(2060)->
	{tpl_task, 2060, 9, 10074, 0, 10074, 109, 1, [{20058,20,0}],<<"斩杀花奴">>, <<"斩杀花奴">>, [{""}],[{""},{""}],2059, 36, 0, 2, 0, 0, [{0,0,541004201,100000},{0,0,531004201,3000},{0,0,582001201,1}],[],0, 2061, 0};	
get(2061)->
	{tpl_task, 2061, 9, 10074, 0, 10074, 109, 1, [{20057,30,0}],<<"击杀灵蛙">>, <<"击杀灵蛙">>, [{""}],[{""},{""}],2060, 37, 0, 2, 0, 0, [{0,0,541004201,100000},{0,0,531004201,3000},{0,0,582001201,1}],[],0, 2062, 0};	
get(2062)->
	{tpl_task, 2062, 9, 10074, 0, 10074, 109, 1, [{20063,90,0}],<<"教训白鹿">>, <<"教训白鹿">>, [{""}],[{""},{""}],2061, 38, 0, 2, 0, 0, [{0,0,541004201,100000},{0,0,531004201,3000},{0,0,582001201,1}],[],0, 2063, 0};	
get(2063)->
	{tpl_task, 2063, 9, 10074, 0, 10074, 109, 1, [{20016,70,0}],<<"击败兰灵">>, <<"击败兰灵">>, [{""}],[{""},{""}],2062, 39, 0, 2, 0, 0, [{0,0,541004201,100000},{0,0,531004201,3000},{0,0,582001201,1}],[],0, 2064, 0};	
get(2064)->
	{tpl_task, 2064, 9, 10074, 0, 10074, 106, 1, [{20054,40,0}],<<"击退凤凰">>, <<"击退凤凰">>, [{""}],[{""},{""}],2063, 37, 0, 2, 0, 0, [{0,0,541004201,100000},{0,0,531004201,3000},{0,0,582001201,1}],[],0, 2065, 0};	
get(2065)->
	{tpl_task, 2065, 9, 10074, 0, 10074, 106, 1, [{20017,40,0}],<<"收服蜂鸟">>, <<"收服蜂鸟">>, [{""}],[{""},{""}],2064, 39, 0, 2, 0, 0, [{0,0,541004201,100000},{0,0,531004201,3000},{0,0,582001201,1}],[],0, 2066, 0};	
get(2066)->
	{tpl_task, 2066, 9, 10074, 0, 10074, 106, 1, [{20055,100,0}],<<"斩杀青狼">>, <<"斩杀青狼">>, [{""}],[{""},{""}],2065, 41, 0, 2, 0, 0, [{0,0,541004201,100000},{0,0,531004201,3000},{0,0,582001201,1}],[],0, 2067, 0};	
get(2067)->
	{tpl_task, 2067, 9, 10074, 0, 10074, 108, 1, [{20024,30,0}],<<"击杀魔蝎">>, <<"击杀魔蝎">>, [{""}],[{""},{""}],2066, 42, 0, 2, 0, 0, [{0,0,541004201,100000},{0,0,531004201,3000},{0,0,582001201,1}],[],0, 2068, 0};	
get(2068)->
	{tpl_task, 2068, 9, 10074, 0, 10074, 108, 1, [{20002,50,0}],<<"教训狂豹">>, <<"教训狂豹">>, [{""}],[{""},{""}],2067, 44, 0, 2, 0, 0, [{0,0,541004201,100000},{0,0,531004201,3000},{0,0,582001201,1}],[],0, 2069, 0};	
get(2069)->
	{tpl_task, 2069, 9, 10074, 0, 10074, 108, 1, [{20022,20,0}],<<"击败守卫">>, <<"击败守卫">>, [{""}],[{""},{""}],2068, 46, 0, 2, 0, 0, [{0,0,541004201,100000},{0,0,531004201,3000},{0,0,582001201,1}],[],0, 2070, 0};	
get(2070)->
	{tpl_task, 2070, 9, 10074, 0, 10074, 108, 1, [{20051,100,0}],<<"击退火元">>, <<"击退火元">>, [{""}],[{""},{""}],2069, 48, 0, 2, 0, 0, [{0,0,541004201,100000},{0,0,531004201,3000},{0,0,582001201,1}],[],0, 2071, 0};	
get(2071)->
	{tpl_task, 2071, 9, 10074, 0, 10074, 108, 1, [{20021,60,0}],<<"收服狂龙">>, <<"收服狂龙">>, [{""}],[{""},{""}],2070, 50, 0, 2, 0, 0, [{0,0,541004201,100000},{0,0,531004201,3000},{0,0,582001201,1}],[],0, 2072, 0};	
get(2072)->
	{tpl_task, 2072, 9, 10074, 0, 10074, 110, 1, [{20004,50,0}],<<"斩杀兵士">>, <<"斩杀兵士">>, [{""}],[{""},{""}],2071, 51, 0, 2, 0, 0, [{0,0,541004201,100000},{0,0,531004201,3000},{0,0,582001201,1}],[],0, 2073, 0};	
get(2073)->
	{tpl_task, 2073, 9, 10074, 0, 10074, 110, 1, [{20060,40,0}],<<"击杀鲛人">>, <<"击杀鲛人">>, [{""}],[{""},{""}],2072, 53, 0, 2, 0, 0, [{0,0,541004201,100000},{0,0,531004201,3000},{0,0,582001201,1}],[],0, 2074, 0};	
get(2074)->
	{tpl_task, 2074, 9, 10074, 0, 10074, 110, 1, [{20061,90,0}],<<"教训喽啰">>, <<"教训喽啰">>, [{""}],[{""},{""}],2073, 55, 0, 2, 0, 0, [{0,0,541004201,100000},{0,0,531004201,3000},{0,0,582001201,1}],[],0, 2075, 0};	
get(2075)->
	{tpl_task, 2075, 9, 10074, 0, 10074, 110, 1, [{20062,30,0}],<<"击败金鳝">>, <<"击败金鳝">>, [{""}],[{""},{""}],2074, 57, 0, 2, 0, 0, [{0,0,541004201,100000},{0,0,531004201,3000},{0,0,582001201,1}],[],0, 2076, 0};	
get(2076)->
	{tpl_task, 2076, 9, 10074, 0, 10074, 110, 1, [{20064,70,0}],<<"击退海卫">>, <<"击退海卫">>, [{""}],[{""},{""}],2075, 59, 0, 2, 0, 0, [{0,0,541004201,100000},{0,0,531004201,3000},{0,0,582001201,1}],[],0, 2077, 0};	
get(2077)->
	{tpl_task, 2077, 9, 10074, 0, 10074, 111, 1, [{20036,40,0}],<<"斩杀魔女">>, <<"斩杀魔女">>, [{""}],[{""},{""}],2076, 63, 0, 2, 0, 0, [{0,0,541004201,100000},{0,0,531004201,3000},{0,0,582001201,1}],[],0, 2078, 0};	
get(2078)->
	{tpl_task, 2078, 9, 10074, 0, 10074, 111, 1, [{20037,80,0}],<<"击杀夜叉">>, <<"击杀夜叉">>, [{""}],[{""},{""}],2077, 67, 0, 2, 0, 0, [{0,0,541004201,100000},{0,0,531004201,3000},{0,0,582001201,1}],[],0, 2079, 0};	
get(2079)->
	{tpl_task, 2079, 9, 10074, 0, 10074, 111, 1, [{20038,100,0}],<<"教训魑魅">>, <<"教训魑魅">>, [{""}],[{""},{""}],2078, 71, 0, 2, 0, 0, [{0,0,541004201,100000},{0,0,531004201,3000},{0,0,582001201,1}],[],0, 2080, 0};	
get(2080)->
	{tpl_task, 2080, 9, 10074, 0, 10074, 111, 1, [{20039,90,0}],<<"击败夜魔">>, <<"击败夜魔">>, [{""}],[{""},{""}],2079, 75, 0, 2, 0, 0, [{0,0,541004201,100000},{0,0,531004201,3000},{0,0,582001201,1}],[],0, 2081, 0};	
get(2081)->
	{tpl_task, 2081, 9, 10074, 0, 10074, 111, 1, [{20040,20,0}],<<"击退魔君">>, <<"击退魔君">>, [{""}],[{""},{""}],2080, 79, 0, 2, 0, 0, [{0,0,541004201,100000},{0,0,531004201,3000},{0,0,582001201,1}],[],0, 2082, 0};	
get(2082)->
	{tpl_task, 2082, 9, 10074, 0, 10074, 112, 1, [{20041,80,0}],<<"收服迷情">>, <<"收服迷情">>, [{""}],[{""},{""}],2081, 99, 0, 2, 0, 0, [{0,0,541004201,100000},{0,0,531004201,3000},{0,0,582001201,1}],[],0, 2083, 0};	
get(2083)->
	{tpl_task, 2083, 9, 10074, 0, 10074, 112, 1, [{20042,90,0}],<<"斩杀酒妖">>, <<"斩杀酒妖">>, [{""}],[{""},{""}],2082, 99, 0, 2, 0, 0, [{0,0,541004201,100000},{0,0,531004201,3000},{0,0,582001201,1}],[],0, 2084, 0};	
get(2084)->
	{tpl_task, 2084, 9, 10074, 0, 10074, 112, 1, [{20043,10,0}],<<"击杀财魔">>, <<"击杀财魔">>, [{""}],[{""},{""}],2083, 99, 0, 2, 0, 0, [{0,0,541004201,100000},{0,0,531004201,3000},{0,0,582001201,1}],[],0, 2085, 0};	
get(2085)->
	{tpl_task, 2085, 9, 10074, 0, 10074, 112, 1, [{20044,90,0}],<<"教训琴魔">>, <<"教训琴魔">>, [{""}],[{""},{""}],2084, 99, 0, 2, 0, 0, [{0,0,541004201,100000},{0,0,531004201,3000},{0,0,582001201,1}],[],0, 2086, 0};	
get(2086)->
	{tpl_task, 2086, 9, 10074, 0, 10074, 113, 1, [{20045,90,0}],<<"击败雪狼">>, <<"击败雪狼">>, [{""}],[{""},{""}],2085, 99, 0, 2, 0, 0, [{0,0,541004201,100000},{0,0,531004201,3000},{0,0,582001201,1}],[],0, 2087, 0};	
get(2087)->
	{tpl_task, 2087, 9, 10074, 0, 10074, 113, 1, [{20046,50,0}],<<"击退飞马">>, <<"击退飞马">>, [{""}],[{""},{""}],2086, 99, 0, 2, 0, 0, [{0,0,541004201,100000},{0,0,531004201,3000},{0,0,582001201,1}],[],0, 2088, 0};	
get(2088)->
	{tpl_task, 2088, 9, 10074, 0, 10074, 113, 1, [{20047,40,0}],<<"收服祭司">>, <<"收服祭司">>, [{""}],[{""},{""}],2087, 99, 0, 2, 0, 0, [{0,0,541004201,100000},{0,0,531004201,3000},{0,0,582001201,1}],[],0, 2089, 0};	
get(2089)->
	{tpl_task, 2089, 9, 10074, 0, 10074, 113, 1, [{20048,80,0}],<<"斩杀狂魔">>, <<"斩杀狂魔">>, [{""}],[{""},{""}],2088, 99, 0, 2, 0, 0, [{0,0,541004201,100000},{0,0,531004201,3000},{0,0,582001201,1}],[],0, 2090, 0};	
get(2090)->
	{tpl_task, 2090, 9, 10074, 0, 10074, 113, 1, [{20049,90,0}],<<"击杀牛妖">>, <<"击杀牛妖">>, [{""}],[{""},{""}],2089, 99, 0, 2, 0, 0, [{0,0,541004201,100000},{0,0,531004201,3000},{0,0,582001201,1}],[],0, 2349, 0};	
get(2349)->
	{tpl_task, 2349, 4, 10031, 0, 10031, 101, 1, [{20001,50,0}],<<"击杀山精">>, <<"击杀山精">>, [{""}],[{""},{""}],2090, 37, 0, 2, 0, 0, [{0,0,541004201,100000},{0,0,531004201,5000},{0,0,584001201,1}],[],0, 2350, 0};	
get(2350)->
	{tpl_task, 2350, 4, 10031, 0, 10031, 101, 1, [{20003,90,0}],<<"教训树妖">>, <<"教训树妖">>, [{""}],[{""},{""}],2349, 37, 0, 2, 0, 0, [{0,0,541004201,100000},{0,0,531004201,5000},{0,0,584001201,1}],[],0, 2351, 0};	
get(2351)->
	{tpl_task, 2351, 4, 10031, 0, 10031, 104, 1, [{20005,90,0}],<<"击败黑鲛">>, <<"击败黑鲛">>, [{""}],[{""},{""}],2350, 37, 0, 2, 0, 0, [{0,0,541004201,100000},{0,0,531004201,5000},{0,0,584001201,1}],[],0, 2352, 0};	
get(2352)->
	{tpl_task, 2352, 4, 10031, 0, 10031, 104, 1, [{20006,90,0}],<<"击退鲛女">>, <<"击退鲛女">>, [{""}],[{""},{""}],2351, 37, 0, 2, 0, 0, [{0,0,541004201,100000},{0,0,531004201,5000},{0,0,584001201,1}],[],0, 2353, 0};	
get(2353)->
	{tpl_task, 2353, 4, 10031, 0, 10031, 104, 1, [{20053,80,0}],<<"收服巨虾">>, <<"收服巨虾">>, [{""}],[{""},{""}],2352, 37, 0, 2, 0, 0, [{0,0,541004201,100000},{0,0,531004201,5000},{0,0,584001201,1}],[],0, 2354, 0};	
get(2354)->
	{tpl_task, 2354, 4, 10031, 0, 10031, 105, 1, [{20059,100,0}],<<"斩杀妖女">>, <<"斩杀妖女">>, [{""}],[{""},{""}],2353, 37, 0, 2, 0, 0, [{0,0,541004201,100000},{0,0,531004201,5000},{0,0,584001201,1}],[],0, 2355, 0};	
get(2355)->
	{tpl_task, 2355, 4, 10031, 0, 10031, 105, 1, [{20011,80,0}],<<"击杀游魂">>, <<"击杀游魂">>, [{""}],[{""},{""}],2354, 37, 0, 2, 0, 0, [{0,0,541004201,100000},{0,0,531004201,5000},{0,0,584001201,1}],[],0, 2356, 0};	
get(2356)->
	{tpl_task, 2356, 4, 10031, 0, 10031, 105, 1, [{20008,40,0}],<<"教训雪精">>, <<"教训雪精">>, [{""}],[{""},{""}],2355, 37, 0, 2, 0, 0, [{0,0,541004201,100000},{0,0,531004201,5000},{0,0,584001201,1}],[],0, 2357, 0};	
get(2357)->
	{tpl_task, 2357, 4, 10031, 0, 10031, 107, 1, [{20015,50,0}],<<"击败神王">>, <<"击败神王">>, [{""}],[{""},{""}],2356, 37, 0, 2, 0, 0, [{0,0,541004201,100000},{0,0,531004201,5000},{0,0,584001201,1}],[],0, 2358, 0};	
get(2358)->
	{tpl_task, 2358, 4, 10031, 0, 10031, 107, 1, [{20012,30,0}],<<"击退妖兽">>, <<"击退妖兽">>, [{""}],[{""},{""}],2357, 37, 0, 2, 0, 0, [{0,0,541004201,100000},{0,0,531004201,5000},{0,0,584001201,1}],[],0, 2359, 0};	
get(2359)->
	{tpl_task, 2359, 4, 10031, 0, 10031, 107, 1, [{20050,90,0}],<<"收服火岩">>, <<"收服火岩">>, [{""}],[{""},{""}],2358, 37, 0, 2, 0, 0, [{0,0,541004201,100000},{0,0,531004201,5000},{0,0,584001201,1}],[],0, 2360, 0};	
get(2360)->
	{tpl_task, 2360, 4, 10031, 0, 10031, 109, 1, [{20058,20,0}],<<"斩杀花奴">>, <<"斩杀花奴">>, [{""}],[{""},{""}],2359, 37, 0, 2, 0, 0, [{0,0,541004201,100000},{0,0,531004201,5000},{0,0,584001201,1}],[],0, 2361, 0};	
get(2361)->
	{tpl_task, 2361, 4, 10031, 0, 10031, 109, 1, [{20057,30,0}],<<"击杀灵蛙">>, <<"击杀灵蛙">>, [{""}],[{""},{""}],2360, 37, 0, 2, 0, 0, [{0,0,541004201,100000},{0,0,531004201,5000},{0,0,584001201,1}],[],0, 2362, 0};	
get(2362)->
	{tpl_task, 2362, 4, 10031, 0, 10031, 109, 1, [{20063,90,0}],<<"教训白鹿">>, <<"教训白鹿">>, [{""}],[{""},{""}],2361, 38, 0, 2, 0, 0, [{0,0,541004201,100000},{0,0,531004201,5000},{0,0,584001201,1}],[],0, 2363, 0};	
get(2363)->
	{tpl_task, 2363, 4, 10031, 0, 10031, 109, 1, [{20016,70,0}],<<"击败兰灵">>, <<"击败兰灵">>, [{""}],[{""},{""}],2362, 39, 0, 2, 0, 0, [{0,0,541004201,100000},{0,0,531004201,5000},{0,0,584001201,1}],[],0, 2364, 0};	
get(2364)->
	{tpl_task, 2364, 4, 10031, 0, 10031, 106, 1, [{20054,40,0}],<<"击退凤凰">>, <<"击退凤凰">>, [{""}],[{""},{""}],2363, 37, 0, 2, 0, 0, [{0,0,541004201,100000},{0,0,531004201,5000},{0,0,584001201,1}],[],0, 2365, 0};	
get(2365)->
	{tpl_task, 2365, 4, 10031, 0, 10031, 106, 1, [{20017,40,0}],<<"收服蜂鸟">>, <<"收服蜂鸟">>, [{""}],[{""},{""}],2364, 39, 0, 2, 0, 0, [{0,0,541004201,100000},{0,0,531004201,5000},{0,0,584001201,1}],[],0, 2366, 0};	
get(2366)->
	{tpl_task, 2366, 4, 10031, 0, 10031, 106, 1, [{20055,100,0}],<<"斩杀青狼">>, <<"斩杀青狼">>, [{""}],[{""},{""}],2365, 41, 0, 2, 0, 0, [{0,0,541004201,100000},{0,0,531004201,5000},{0,0,584001201,1}],[],0, 2367, 0};	
get(2367)->
	{tpl_task, 2367, 4, 10031, 0, 10031, 108, 1, [{20024,30,0}],<<"击杀魔蝎">>, <<"击杀魔蝎">>, [{""}],[{""},{""}],2366, 42, 0, 2, 0, 0, [{0,0,541004201,100000},{0,0,531004201,5000},{0,0,584001201,1}],[],0, 2368, 0};	
get(2368)->
	{tpl_task, 2368, 4, 10031, 0, 10031, 108, 1, [{20002,50,0}],<<"教训狂豹">>, <<"教训狂豹">>, [{""}],[{""},{""}],2367, 44, 0, 2, 0, 0, [{0,0,541004201,100000},{0,0,531004201,5000},{0,0,584001201,1}],[],0, 2369, 0};	
get(2369)->
	{tpl_task, 2369, 4, 10031, 0, 10031, 108, 1, [{20022,20,0}],<<"击败守卫">>, <<"击败守卫">>, [{""}],[{""},{""}],2368, 46, 0, 2, 0, 0, [{0,0,541004201,100000},{0,0,531004201,5000},{0,0,584001201,1}],[],0, 2370, 0};	
get(2370)->
	{tpl_task, 2370, 4, 10031, 0, 10031, 108, 1, [{20051,100,0}],<<"击退火元">>, <<"击退火元">>, [{""}],[{""},{""}],2369, 48, 0, 2, 0, 0, [{0,0,541004201,100000},{0,0,531004201,5000},{0,0,584001201,1}],[],0, 2371, 0};	
get(2371)->
	{tpl_task, 2371, 4, 10031, 0, 10031, 108, 1, [{20021,60,0}],<<"收服狂龙">>, <<"收服狂龙">>, [{""}],[{""},{""}],2370, 50, 0, 2, 0, 0, [{0,0,541004201,100000},{0,0,531004201,5000},{0,0,584001201,1}],[],0, 2372, 0};	
get(2372)->
	{tpl_task, 2372, 4, 10031, 0, 10031, 110, 1, [{20004,50,0}],<<"斩杀兵士">>, <<"斩杀兵士">>, [{""}],[{""},{""}],2371, 51, 0, 2, 0, 0, [{0,0,541004201,100000},{0,0,531004201,5000},{0,0,584001201,1}],[],0, 2373, 0};	
get(2373)->
	{tpl_task, 2373, 4, 10031, 0, 10031, 110, 1, [{20060,40,0}],<<"击杀鲛人">>, <<"击杀鲛人">>, [{""}],[{""},{""}],2372, 53, 0, 2, 0, 0, [{0,0,541004201,100000},{0,0,531004201,5000},{0,0,584001201,1}],[],0, 2374, 0};	
get(2374)->
	{tpl_task, 2374, 4, 10031, 0, 10031, 110, 1, [{20061,90,0}],<<"教训喽啰">>, <<"教训喽啰">>, [{""}],[{""},{""}],2373, 55, 0, 2, 0, 0, [{0,0,541004201,100000},{0,0,531004201,5000},{0,0,584001201,1}],[],0, 2375, 0};	
get(2375)->
	{tpl_task, 2375, 4, 10031, 0, 10031, 110, 1, [{20062,30,0}],<<"击败金鳝">>, <<"击败金鳝">>, [{""}],[{""},{""}],2374, 57, 0, 2, 0, 0, [{0,0,541004201,100000},{0,0,531004201,5000},{0,0,584001201,1}],[],0, 2376, 0};	
get(2376)->
	{tpl_task, 2376, 4, 10031, 0, 10031, 110, 1, [{20064,70,0}],<<"击退海卫">>, <<"击退海卫">>, [{""}],[{""},{""}],2375, 59, 0, 2, 0, 0, [{0,0,541004201,100000},{0,0,531004201,5000},{0,0,584001201,1}],[],0, 2377, 0};	
get(2377)->
	{tpl_task, 2377, 4, 10031, 0, 10031, 111, 1, [{20036,40,0}],<<"斩杀魔女">>, <<"斩杀魔女">>, [{""}],[{""},{""}],2376, 63, 0, 2, 0, 0, [{0,0,541004201,100000},{0,0,531004201,5000},{0,0,584001201,1}],[],0, 2378, 0};	
get(2378)->
	{tpl_task, 2378, 4, 10031, 0, 10031, 111, 1, [{20037,80,0}],<<"击杀夜叉">>, <<"击杀夜叉">>, [{""}],[{""},{""}],2377, 67, 0, 2, 0, 0, [{0,0,541004201,100000},{0,0,531004201,5000},{0,0,584001201,1}],[],0, 2379, 0};	
get(2379)->
	{tpl_task, 2379, 4, 10031, 0, 10031, 111, 1, [{20038,100,0}],<<"教训魑魅">>, <<"教训魑魅">>, [{""}],[{""},{""}],2378, 71, 0, 2, 0, 0, [{0,0,541004201,100000},{0,0,531004201,5000},{0,0,584001201,1}],[],0, 2380, 0};	
get(2380)->
	{tpl_task, 2380, 4, 10031, 0, 10031, 111, 1, [{20039,90,0}],<<"击败夜魔">>, <<"击败夜魔">>, [{""}],[{""},{""}],2379, 75, 0, 2, 0, 0, [{0,0,541004201,100000},{0,0,531004201,5000},{0,0,584001201,1}],[],0, 2381, 0};	
get(2381)->
	{tpl_task, 2381, 4, 10031, 0, 10031, 111, 1, [{20040,20,0}],<<"击退魔君">>, <<"击退魔君">>, [{""}],[{""},{""}],2380, 79, 0, 2, 0, 0, [{0,0,541004201,100000},{0,0,531004201,5000},{0,0,584001201,1}],[],0, 2382, 0};	
get(2382)->
	{tpl_task, 2382, 4, 10031, 0, 10031, 112, 1, [{20041,80,0}],<<"收服迷情">>, <<"收服迷情">>, [{""}],[{""},{""}],2381, 99, 0, 2, 0, 0, [{0,0,541004201,100000},{0,0,531004201,5000},{0,0,584001201,1}],[],0, 2383, 0};	
get(2383)->
	{tpl_task, 2383, 4, 10031, 0, 10031, 112, 1, [{20042,90,0}],<<"斩杀酒妖">>, <<"斩杀酒妖">>, [{""}],[{""},{""}],2382, 99, 0, 2, 0, 0, [{0,0,541004201,100000},{0,0,531004201,5000},{0,0,584001201,1}],[],0, 2384, 0};	
get(2384)->
	{tpl_task, 2384, 4, 10031, 0, 10031, 112, 1, [{20043,10,0}],<<"击杀财魔">>, <<"击杀财魔">>, [{""}],[{""},{""}],2383, 99, 0, 2, 0, 0, [{0,0,541004201,100000},{0,0,531004201,5000},{0,0,584001201,1}],[],0, 2385, 0};	
get(2385)->
	{tpl_task, 2385, 4, 10031, 0, 10031, 112, 1, [{20044,90,0}],<<"教训琴魔">>, <<"教训琴魔">>, [{""}],[{""},{""}],2384, 99, 0, 2, 0, 0, [{0,0,541004201,100000},{0,0,531004201,5000},{0,0,584001201,1}],[],0, 2386, 0};	
get(2386)->
	{tpl_task, 2386, 4, 10031, 0, 10031, 113, 1, [{20045,90,0}],<<"击败雪狼">>, <<"击败雪狼">>, [{""}],[{""},{""}],2385, 99, 0, 2, 0, 0, [{0,0,541004201,100000},{0,0,531004201,5000},{0,0,584001201,1}],[],0, 2387, 0};	
get(2387)->
	{tpl_task, 2387, 4, 10031, 0, 10031, 113, 1, [{20046,50,0}],<<"击退飞马">>, <<"击退飞马">>, [{""}],[{""},{""}],2386, 99, 0, 2, 0, 0, [{0,0,541004201,100000},{0,0,531004201,5000},{0,0,584001201,1}],[],0, 2388, 0};	
get(2388)->
	{tpl_task, 2388, 4, 10031, 0, 10031, 113, 1, [{20047,40,0}],<<"收服祭司">>, <<"收服祭司">>, [{""}],[{""},{""}],2387, 99, 0, 2, 0, 0, [{0,0,541004201,100000},{0,0,531004201,5000},{0,0,584001201,1}],[],0, 2389, 0};	
get(2389)->
	{tpl_task, 2389, 4, 10031, 0, 10031, 113, 1, [{20048,80,0}],<<"斩杀狂魔">>, <<"斩杀狂魔">>, [{""}],[{""},{""}],2388, 99, 0, 2, 0, 0, [{0,0,541004201,100000},{0,0,531004201,5000},{0,0,584001201,1}],[],0, 2390, 0};	
get(2390)->
	{tpl_task, 2390, 4, 10031, 0, 10031, 113, 1, [{20049,90,0}],<<"击杀牛妖">>, <<"击杀牛妖">>, [{""}],[{""},{""}],2389, 99, 0, 2, 0, 0, [{0,0,541004201,100000},{0,0,531004201,5000},{0,0,584001201,1}],[],0, 2649, 0};	
get(2649)->
	{tpl_task, 2649, 5, 10023, 0, 10023, 101, 1, [{20001,50,0}],<<"击杀山精">>, <<"击杀山精">>, [{""}],[{""},{""}],2390, 34, 0, 2, 0, 0, [{0,0,541004201,100000},{0,0,531004201,6000},{0,0,506001404,1}],[],0, 2650, 0};	
get(2650)->
	{tpl_task, 2650, 5, 10023, 0, 10023, 101, 1, [{20003,90,0}],<<"教训树妖">>, <<"教训树妖">>, [{""}],[{""},{""}],2649, 34, 0, 2, 0, 0, [{0,0,541004201,100000},{0,0,531004201,6000},{0,0,506001404,1}],[],0, 2651, 0};	
get(2651)->
	{tpl_task, 2651, 5, 10023, 0, 10023, 104, 1, [{20005,90,0}],<<"击败黑鲛">>, <<"击败黑鲛">>, [{""}],[{""},{""}],2650, 34, 0, 2, 0, 0, [{0,0,541004201,100000},{0,0,531004201,6000},{0,0,506001404,1}],[],0, 2652, 0};	
get(2652)->
	{tpl_task, 2652, 5, 10023, 0, 10023, 104, 1, [{20006,90,0}],<<"击退鲛女">>, <<"击退鲛女">>, [{""}],[{""},{""}],2651, 34, 0, 2, 0, 0, [{0,0,541004201,100000},{0,0,531004201,6000},{0,0,506001404,1}],[],0, 2653, 0};	
get(2653)->
	{tpl_task, 2653, 5, 10023, 0, 10023, 104, 1, [{20053,80,0}],<<"收服巨虾">>, <<"收服巨虾">>, [{""}],[{""},{""}],2652, 34, 0, 2, 0, 0, [{0,0,541004201,100000},{0,0,531004201,6000},{0,0,506001404,1}],[],0, 2654, 0};	
get(2654)->
	{tpl_task, 2654, 5, 10023, 0, 10023, 105, 1, [{20059,100,0}],<<"斩杀妖女">>, <<"斩杀妖女">>, [{""}],[{""},{""}],2653, 34, 0, 2, 0, 0, [{0,0,541004201,100000},{0,0,531004201,6000},{0,0,506001404,1}],[],0, 2655, 0};	
get(2655)->
	{tpl_task, 2655, 5, 10023, 0, 10023, 105, 1, [{20011,80,0}],<<"击杀游魂">>, <<"击杀游魂">>, [{""}],[{""},{""}],2654, 34, 0, 2, 0, 0, [{0,0,541004201,100000},{0,0,531004201,6000},{0,0,506001404,1}],[],0, 2656, 0};	
get(2656)->
	{tpl_task, 2656, 5, 10023, 0, 10023, 105, 1, [{20008,40,0}],<<"教训雪精">>, <<"教训雪精">>, [{""}],[{""},{""}],2655, 34, 0, 2, 0, 0, [{0,0,541004201,100000},{0,0,531004201,6000},{0,0,506001404,1}],[],0, 2657, 0};	
get(2657)->
	{tpl_task, 2657, 5, 10023, 0, 10023, 107, 1, [{20015,50,0}],<<"击败神王">>, <<"击败神王">>, [{""}],[{""},{""}],2656, 34, 0, 2, 0, 0, [{0,0,541004201,100000},{0,0,531004201,6000},{0,0,506001404,1}],[],0, 2658, 0};	
get(2658)->
	{tpl_task, 2658, 5, 10023, 0, 10023, 107, 1, [{20012,30,0}],<<"击退妖兽">>, <<"击退妖兽">>, [{""}],[{""},{""}],2657, 34, 0, 2, 0, 0, [{0,0,541004201,100000},{0,0,531004201,6000},{0,0,506001404,1}],[],0, 2659, 0};	
get(2659)->
	{tpl_task, 2659, 5, 10023, 0, 10023, 107, 1, [{20050,90,0}],<<"收服火岩">>, <<"收服火岩">>, [{""}],[{""},{""}],2658, 35, 0, 2, 0, 0, [{0,0,541004201,100000},{0,0,531004201,6000},{0,0,506001404,1}],[],0, 2660, 0};	
get(2660)->
	{tpl_task, 2660, 5, 10023, 0, 10023, 109, 1, [{20058,20,0}],<<"斩杀花奴">>, <<"斩杀花奴">>, [{""}],[{""},{""}],2659, 36, 0, 2, 0, 0, [{0,0,541004201,100000},{0,0,531004201,6000},{0,0,506001404,1}],[],0, 2661, 0};	
get(2661)->
	{tpl_task, 2661, 5, 10023, 0, 10023, 109, 1, [{20057,30,0}],<<"击杀灵蛙">>, <<"击杀灵蛙">>, [{""}],[{""},{""}],2660, 37, 0, 2, 0, 0, [{0,0,541004201,100000},{0,0,531004201,6000},{0,0,506001404,1}],[],0, 2662, 0};	
get(2662)->
	{tpl_task, 2662, 5, 10023, 0, 10023, 109, 1, [{20063,90,0}],<<"教训白鹿">>, <<"教训白鹿">>, [{""}],[{""},{""}],2661, 38, 0, 2, 0, 0, [{0,0,541004201,100000},{0,0,531004201,6000},{0,0,506001404,1}],[],0, 2663, 0};	
get(2663)->
	{tpl_task, 2663, 5, 10023, 0, 10023, 109, 1, [{20016,70,0}],<<"击败兰灵">>, <<"击败兰灵">>, [{""}],[{""},{""}],2662, 39, 0, 2, 0, 0, [{0,0,541004201,100000},{0,0,531004201,6000},{0,0,506001404,1}],[],0, 2664, 0};	
get(2664)->
	{tpl_task, 2664, 5, 10023, 0, 10023, 106, 1, [{20054,40,0}],<<"击退凤凰">>, <<"击退凤凰">>, [{""}],[{""},{""}],2663, 37, 0, 2, 0, 0, [{0,0,541004201,100000},{0,0,531004201,6000},{0,0,506001404,1}],[],0, 2665, 0};	
get(2665)->
	{tpl_task, 2665, 5, 10023, 0, 10023, 106, 1, [{20017,40,0}],<<"收服蜂鸟">>, <<"收服蜂鸟">>, [{""}],[{""},{""}],2664, 39, 0, 2, 0, 0, [{0,0,541004201,100000},{0,0,531004201,6000},{0,0,506001404,1}],[],0, 2666, 0};	
get(2666)->
	{tpl_task, 2666, 5, 10023, 0, 10023, 106, 1, [{20055,100,0}],<<"斩杀青狼">>, <<"斩杀青狼">>, [{""}],[{""},{""}],2665, 41, 0, 2, 0, 0, [{0,0,541004201,100000},{0,0,531004201,6000},{0,0,506001404,1}],[],0, 2667, 0};	
get(2667)->
	{tpl_task, 2667, 5, 10023, 0, 10023, 108, 1, [{20024,30,0}],<<"击杀魔蝎">>, <<"击杀魔蝎">>, [{""}],[{""},{""}],2666, 42, 0, 2, 0, 0, [{0,0,541004201,100000},{0,0,531004201,6000},{0,0,506001404,1}],[],0, 2668, 0};	
get(2668)->
	{tpl_task, 2668, 5, 10023, 0, 10023, 108, 1, [{20002,50,0}],<<"教训狂豹">>, <<"教训狂豹">>, [{""}],[{""},{""}],2667, 44, 0, 2, 0, 0, [{0,0,541004201,100000},{0,0,531004201,6000},{0,0,506001404,1}],[],0, 2669, 0};	
get(2669)->
	{tpl_task, 2669, 5, 10023, 0, 10023, 108, 1, [{20022,20,0}],<<"击败守卫">>, <<"击败守卫">>, [{""}],[{""},{""}],2668, 46, 0, 2, 0, 0, [{0,0,541004201,100000},{0,0,531004201,6000},{0,0,506001404,1}],[],0, 2670, 0};	
get(2670)->
	{tpl_task, 2670, 5, 10023, 0, 10023, 108, 1, [{20051,100,0}],<<"击退火元">>, <<"击退火元">>, [{""}],[{""},{""}],2669, 48, 0, 2, 0, 0, [{0,0,541004201,100000},{0,0,531004201,6000},{0,0,506001404,1}],[],0, 2671, 0};	
get(2671)->
	{tpl_task, 2671, 5, 10023, 0, 10023, 108, 1, [{20021,60,0}],<<"收服狂龙">>, <<"收服狂龙">>, [{""}],[{""},{""}],2670, 50, 0, 2, 0, 0, [{0,0,541004201,100000},{0,0,531004201,6000},{0,0,506001404,1}],[],0, 2672, 0};	
get(2672)->
	{tpl_task, 2672, 5, 10023, 0, 10023, 110, 1, [{20004,50,0}],<<"斩杀兵士">>, <<"斩杀兵士">>, [{""}],[{""},{""}],2671, 51, 0, 2, 0, 0, [{0,0,541004201,100000},{0,0,531004201,6000},{0,0,506001404,1}],[],0, 2673, 0};	
get(2673)->
	{tpl_task, 2673, 5, 10023, 0, 10023, 110, 1, [{20060,40,0}],<<"击杀鲛人">>, <<"击杀鲛人">>, [{""}],[{""},{""}],2672, 53, 0, 2, 0, 0, [{0,0,541004201,100000},{0,0,531004201,6000},{0,0,506001404,1}],[],0, 2674, 0};	
get(2674)->
	{tpl_task, 2674, 5, 10023, 0, 10023, 110, 1, [{20061,90,0}],<<"教训喽啰">>, <<"教训喽啰">>, [{""}],[{""},{""}],2673, 55, 0, 2, 0, 0, [{0,0,541004201,100000},{0,0,531004201,6000},{0,0,506001404,1}],[],0, 2675, 0};	
get(2675)->
	{tpl_task, 2675, 5, 10023, 0, 10023, 110, 1, [{20062,30,0}],<<"击败金鳝">>, <<"击败金鳝">>, [{""}],[{""},{""}],2674, 57, 0, 2, 0, 0, [{0,0,541004201,100000},{0,0,531004201,6000},{0,0,506001404,1}],[],0, 2676, 0};	
get(2676)->
	{tpl_task, 2676, 5, 10023, 0, 10023, 110, 1, [{20064,70,0}],<<"击退海卫">>, <<"击退海卫">>, [{""}],[{""},{""}],2675, 59, 0, 2, 0, 0, [{0,0,541004201,100000},{0,0,531004201,6000},{0,0,506001404,1}],[],0, 2677, 0};	
get(2677)->
	{tpl_task, 2677, 5, 10023, 0, 10023, 111, 1, [{20036,40,0}],<<"斩杀魔女">>, <<"斩杀魔女">>, [{""}],[{""},{""}],2676, 63, 0, 2, 0, 0, [{0,0,541004201,100000},{0,0,531004201,6000},{0,0,506001404,1}],[],0, 2678, 0};	
get(2678)->
	{tpl_task, 2678, 5, 10023, 0, 10023, 111, 1, [{20037,80,0}],<<"击杀夜叉">>, <<"击杀夜叉">>, [{""}],[{""},{""}],2677, 67, 0, 2, 0, 0, [{0,0,541004201,100000},{0,0,531004201,6000},{0,0,506001404,1}],[],0, 2679, 0};	
get(2679)->
	{tpl_task, 2679, 5, 10023, 0, 10023, 111, 1, [{20038,100,0}],<<"教训魑魅">>, <<"教训魑魅">>, [{""}],[{""},{""}],2678, 71, 0, 2, 0, 0, [{0,0,541004201,100000},{0,0,531004201,6000},{0,0,506001404,1}],[],0, 2680, 0};	
get(2680)->
	{tpl_task, 2680, 5, 10023, 0, 10023, 111, 1, [{20039,90,0}],<<"击败夜魔">>, <<"击败夜魔">>, [{""}],[{""},{""}],2679, 75, 0, 2, 0, 0, [{0,0,541004201,100000},{0,0,531004201,6000},{0,0,506001404,1}],[],0, 2681, 0};	
get(2681)->
	{tpl_task, 2681, 5, 10023, 0, 10023, 111, 1, [{20040,20,0}],<<"击退魔君">>, <<"击退魔君">>, [{""}],[{""},{""}],2680, 79, 0, 2, 0, 0, [{0,0,541004201,100000},{0,0,531004201,6000},{0,0,506001404,1}],[],0, 2682, 0};	
get(2682)->
	{tpl_task, 2682, 5, 10023, 0, 10023, 112, 1, [{20041,80,0}],<<"收服迷情">>, <<"收服迷情">>, [{""}],[{""},{""}],2681, 99, 0, 2, 0, 0, [{0,0,541004201,100000},{0,0,531004201,6000},{0,0,506001404,1}],[],0, 2683, 0};	
get(2683)->
	{tpl_task, 2683, 5, 10023, 0, 10023, 112, 1, [{20042,90,0}],<<"斩杀酒妖">>, <<"斩杀酒妖">>, [{""}],[{""},{""}],2682, 99, 0, 2, 0, 0, [{0,0,541004201,100000},{0,0,531004201,6000},{0,0,506001404,1}],[],0, 2684, 0};	
get(2684)->
	{tpl_task, 2684, 5, 10023, 0, 10023, 112, 1, [{20043,10,0}],<<"击杀财魔">>, <<"击杀财魔">>, [{""}],[{""},{""}],2683, 99, 0, 2, 0, 0, [{0,0,541004201,100000},{0,0,531004201,6000},{0,0,506001404,1}],[],0, 2685, 0};	
get(2685)->
	{tpl_task, 2685, 5, 10023, 0, 10023, 112, 1, [{20044,90,0}],<<"教训琴魔">>, <<"教训琴魔">>, [{""}],[{""},{""}],2684, 99, 0, 2, 0, 0, [{0,0,541004201,100000},{0,0,531004201,6000},{0,0,506001404,1}],[],0, 2686, 0};	
get(2686)->
	{tpl_task, 2686, 5, 10023, 0, 10023, 113, 1, [{20045,90,0}],<<"击败雪狼">>, <<"击败雪狼">>, [{""}],[{""},{""}],2685, 99, 0, 2, 0, 0, [{0,0,541004201,100000},{0,0,531004201,6000},{0,0,506001404,1}],[],0, 2687, 0};	
get(2687)->
	{tpl_task, 2687, 5, 10023, 0, 10023, 113, 1, [{20046,50,0}],<<"击退飞马">>, <<"击退飞马">>, [{""}],[{""},{""}],2686, 99, 0, 2, 0, 0, [{0,0,541004201,100000},{0,0,531004201,6000},{0,0,506001404,1}],[],0, 2688, 0};	
get(2688)->
	{tpl_task, 2688, 5, 10023, 0, 10023, 113, 1, [{20047,40,0}],<<"收服祭司">>, <<"收服祭司">>, [{""}],[{""},{""}],2687, 99, 0, 2, 0, 0, [{0,0,541004201,100000},{0,0,531004201,6000},{0,0,506001404,1}],[],0, 2689, 0};	
get(2689)->
	{tpl_task, 2689, 5, 10023, 0, 10023, 113, 1, [{20048,80,0}],<<"斩杀狂魔">>, <<"斩杀狂魔">>, [{""}],[{""},{""}],2688, 99, 0, 2, 0, 0, [{0,0,541004201,100000},{0,0,531004201,6000},{0,0,506001404,1}],[],0, 2690, 0};	
get(2690)->
	{tpl_task, 2690, 5, 10023, 0, 10023, 113, 1, [{20049,90,0}],<<"击杀牛妖">>, <<"击杀牛妖">>, [{""}],[{""},{""}],2689, 99, 0, 2, 0, 0, [{0,0,541004201,100000},{0,0,531004201,6000},{0,0,506001404,1}],[],0, 2949, 0};	
get(2949)->
	{tpl_task, 2949, 6, 10030, 0, 10030, 101, 1, [{20001,50,0}],<<"击杀山精">>, <<"击杀山精">>, [{""}],[{""},{""}],2690, 33, 0, 2, 0, 0, [{0,0,541004201,100000},{0,0,531004201,3300},{0,0,531004201,5000},{1,1,518001201,1},{1,2,518002201,1},{1,3,518003201,1}],[],0, 2950, 0};	
get(2950)->
	{tpl_task, 2950, 6, 10030, 0, 10030, 101, 1, [{20003,90,0}],<<"教训树妖">>, <<"教训树妖">>, [{""}],[{""},{""}],2949, 33, 0, 2, 0, 0, [{0,0,541004201,100000},{0,0,531004201,3300},{0,0,531004201,5000},{1,1,518001201,1},{1,2,518002201,1},{1,3,518003201,1}],[],0, 2951, 0};	
get(2951)->
	{tpl_task, 2951, 6, 10030, 0, 10030, 104, 1, [{20005,90,0}],<<"击败黑鲛">>, <<"击败黑鲛">>, [{""}],[{""},{""}],2950, 33, 0, 2, 0, 0, [{0,0,541004201,100000},{0,0,531004201,3300},{0,0,531004201,5000},{1,1,518001201,1},{1,2,518002201,1},{1,3,518003201,1}],[],0, 2952, 0};	
get(2952)->
	{tpl_task, 2952, 6, 10030, 0, 10030, 104, 1, [{20006,90,0}],<<"击退鲛女">>, <<"击退鲛女">>, [{""}],[{""},{""}],2951, 33, 0, 2, 0, 0, [{0,0,541004201,100000},{0,0,531004201,3300},{0,0,531004201,5000},{1,1,518001201,1},{1,2,518002201,1},{1,3,518003201,1}],[],0, 2953, 0};	
get(2953)->
	{tpl_task, 2953, 6, 10030, 0, 10030, 104, 1, [{20053,80,0}],<<"收服巨虾">>, <<"收服巨虾">>, [{""}],[{""},{""}],2952, 33, 0, 2, 0, 0, [{0,0,541004201,100000},{0,0,531004201,3300},{0,0,531004201,5000},{1,1,518001201,1},{1,2,518002201,1},{1,3,518003201,1}],[],0, 2954, 0};	
get(2954)->
	{tpl_task, 2954, 6, 10030, 0, 10030, 105, 1, [{20059,100,0}],<<"斩杀妖女">>, <<"斩杀妖女">>, [{""}],[{""},{""}],2953, 33, 0, 2, 0, 0, [{0,0,541004201,100000},{0,0,531004201,3200},{0,0,531004201,5000},{1,1,518001201,1},{1,2,518002201,1},{1,3,518003201,1}],[],0, 2955, 0};	
get(2955)->
	{tpl_task, 2955, 6, 10030, 0, 10030, 105, 1, [{20011,80,0}],<<"击杀游魂">>, <<"击杀游魂">>, [{""}],[{""},{""}],2954, 33, 0, 2, 0, 0, [{0,0,541004201,100000},{0,0,531004201,3200},{0,0,531004201,5000},{1,1,518001201,1},{1,2,518002201,1},{1,3,518003201,1}],[],0, 2956, 0};	
get(2956)->
	{tpl_task, 2956, 6, 10030, 0, 10030, 105, 1, [{20008,40,0}],<<"教训雪精">>, <<"教训雪精">>, [{""}],[{""},{""}],2955, 33, 0, 2, 0, 0, [{0,0,541004201,100000},{0,0,531004201,3200},{0,0,531004201,5000},{1,1,518001201,1},{1,2,518002201,1},{1,3,518003201,1}],[],0, 2957, 0};	
get(2957)->
	{tpl_task, 2957, 6, 10030, 0, 10030, 107, 1, [{20015,50,0}],<<"击败神王">>, <<"击败神王">>, [{""}],[{""},{""}],2956, 33, 0, 2, 0, 0, [{0,0,541004201,100000},{0,0,531004201,3200},{0,0,531004201,5000},{1,1,518001201,1},{1,2,518002201,1},{1,3,518003201,1}],[],0, 2958, 0};	
get(2958)->
	{tpl_task, 2958, 6, 10030, 0, 10030, 107, 1, [{20012,30,0}],<<"击退妖兽">>, <<"击退妖兽">>, [{""}],[{""},{""}],2957, 34, 0, 2, 0, 0, [{0,0,541004201,100000},{0,0,531004201,3200},{0,0,531004201,5000},{1,1,518001201,1},{1,2,518002201,1},{1,3,518003201,1}],[],0, 2959, 0};	
get(2959)->
	{tpl_task, 2959, 6, 10030, 0, 10030, 107, 1, [{20050,90,0}],<<"收服火岩">>, <<"收服火岩">>, [{""}],[{""},{""}],2958, 35, 0, 2, 0, 0, [{0,0,541004201,100000},{0,0,531004201,3300},{0,0,531004201,5000},{1,1,518001201,1},{1,2,518002201,1},{1,3,518003201,1}],[],0, 2960, 0};	
get(2960)->
	{tpl_task, 2960, 6, 10030, 0, 10030, 109, 1, [{20058,20,0}],<<"斩杀花奴">>, <<"斩杀花奴">>, [{""}],[{""},{""}],2959, 36, 0, 2, 0, 0, [{0,0,541004201,100000},{0,0,531004201,3300},{0,0,531004201,5000},{1,1,518001201,1},{1,2,518002201,1},{1,3,518003201,1}],[],0, 2961, 0};	
get(2961)->
	{tpl_task, 2961, 6, 10030, 0, 10030, 109, 1, [{20057,30,0}],<<"击杀灵蛙">>, <<"击杀灵蛙">>, [{""}],[{""},{""}],2960, 37, 0, 2, 0, 0, [{0,0,541004201,100000},{0,0,531004201,3200},{0,0,531004201,5000},{1,1,518001201,1},{1,2,518002201,1},{1,3,518003201,1}],[],0, 2962, 0};	
get(2962)->
	{tpl_task, 2962, 6, 10030, 0, 10030, 109, 1, [{20063,90,0}],<<"教训白鹿">>, <<"教训白鹿">>, [{""}],[{""},{""}],2961, 38, 0, 2, 0, 0, [{0,0,541004201,100000},{0,0,531004201,3200},{0,0,531004201,5000},{1,1,518001201,1},{1,2,518002201,1},{1,3,518003201,1}],[],0, 2963, 0};	
get(2963)->
	{tpl_task, 2963, 6, 10030, 0, 10030, 109, 1, [{20016,70,0}],<<"击败兰灵">>, <<"击败兰灵">>, [{""}],[{""},{""}],2962, 39, 0, 2, 0, 0, [{0,0,541004201,100000},{0,0,531004201,3200},{0,0,531004201,5000},{1,1,518001201,1},{1,2,518002201,1},{1,3,518003201,1}],[],0, 2964, 0};	
get(2964)->
	{tpl_task, 2964, 6, 10030, 0, 10030, 106, 1, [{20054,40,0}],<<"击退凤凰">>, <<"击退凤凰">>, [{""}],[{""},{""}],2963, 37, 0, 2, 0, 0, [{0,0,541004201,100000},{0,0,531004201,3300},{0,0,531004201,5000},{1,1,518001201,1},{1,2,518002201,1},{1,3,518003201,1}],[],0, 2965, 0};	
get(2965)->
	{tpl_task, 2965, 6, 10030, 0, 10030, 106, 1, [{20017,40,0}],<<"收服蜂鸟">>, <<"收服蜂鸟">>, [{""}],[{""},{""}],2964, 39, 0, 2, 0, 0, [{0,0,541004201,100000},{0,0,531004201,3200},{0,0,531004201,5000},{1,1,518001201,1},{1,2,518002201,1},{1,3,518003201,1}],[],0, 2966, 0};	
get(2966)->
	{tpl_task, 2966, 6, 10030, 0, 10030, 106, 1, [{20055,100,0}],<<"斩杀青狼">>, <<"斩杀青狼">>, [{""}],[{""},{""}],2965, 41, 0, 2, 0, 0, [{0,0,541004201,100000},{0,0,531004201,3300},{0,0,531004201,5000},{1,1,518001201,1},{1,2,518002201,1},{1,3,518003201,1}],[],0, 2967, 0};	
get(2967)->
	{tpl_task, 2967, 6, 10030, 0, 10030, 108, 1, [{20024,30,0}],<<"击杀魔蝎">>, <<"击杀魔蝎">>, [{""}],[{""},{""}],2966, 42, 0, 2, 0, 0, [{0,0,541004201,100000},{0,0,531004201,3200},{0,0,531004201,5000},{1,1,518001201,1},{1,2,518002201,1},{1,3,518003201,1}],[],0, 2968, 0};	
get(2968)->
	{tpl_task, 2968, 6, 10030, 0, 10030, 108, 1, [{20002,50,0}],<<"教训狂豹">>, <<"教训狂豹">>, [{""}],[{""},{""}],2967, 44, 0, 2, 0, 0, [{0,0,541004201,100000},{0,0,531004201,3300},{0,0,531004201,5000},{1,1,518001201,1},{1,2,518002201,1},{1,3,518003201,1}],[],0, 2969, 0};	
get(2969)->
	{tpl_task, 2969, 6, 10030, 0, 10030, 108, 1, [{20022,20,0}],<<"击败守卫">>, <<"击败守卫">>, [{""}],[{""},{""}],2968, 46, 0, 2, 0, 0, [{0,0,541004201,100000},{0,0,531004201,3300},{0,0,531004201,5000},{1,1,518001201,1},{1,2,518002201,1},{1,3,518003201,1}],[],0, 2970, 0};	
get(2970)->
	{tpl_task, 2970, 6, 10030, 0, 10030, 108, 1, [{20051,100,0}],<<"击退火元">>, <<"击退火元">>, [{""}],[{""},{""}],2969, 48, 0, 2, 0, 0, [{0,0,541004201,100000},{0,0,531004201,3300},{0,0,531004201,5000},{1,1,518001201,1},{1,2,518002201,1},{1,3,518003201,1}],[],0, 2971, 0};	
get(2971)->
	{tpl_task, 2971, 6, 10030, 0, 10030, 108, 1, [{20021,60,0}],<<"收服狂龙">>, <<"收服狂龙">>, [{""}],[{""},{""}],2970, 50, 0, 2, 0, 0, [{0,0,541004201,100000},{0,0,531004201,3200},{0,0,531004201,5000},{1,1,518001201,1},{1,2,518002201,1},{1,3,518003201,1}],[],0, 2972, 0};	
get(2972)->
	{tpl_task, 2972, 6, 10030, 0, 10030, 110, 1, [{20004,50,0}],<<"斩杀兵士">>, <<"斩杀兵士">>, [{""}],[{""},{""}],2971, 51, 0, 2, 0, 0, [{0,0,541004201,100000},{0,0,531004201,3200},{0,0,531004201,5000},{1,1,518001201,1},{1,2,518002201,1},{1,3,518003201,1}],[],0, 2973, 0};	
get(2973)->
	{tpl_task, 2973, 6, 10030, 0, 10030, 110, 1, [{20060,40,0}],<<"击杀鲛人">>, <<"击杀鲛人">>, [{""}],[{""},{""}],2972, 53, 0, 2, 0, 0, [{0,0,541004201,100000},{0,0,531004201,3300},{0,0,531004201,5000},{1,1,518001201,1},{1,2,518002201,1},{1,3,518003201,1}],[],0, 2974, 0};	
get(2974)->
	{tpl_task, 2974, 6, 10030, 0, 10030, 110, 1, [{20061,90,0}],<<"教训喽啰">>, <<"教训喽啰">>, [{""}],[{""},{""}],2973, 55, 0, 2, 0, 0, [{0,0,541004201,100000},{0,0,531004201,3200},{0,0,531004201,5000},{1,1,518001201,1},{1,2,518002201,1},{1,3,518003201,1}],[],0, 2975, 0};	
get(2975)->
	{tpl_task, 2975, 6, 10030, 0, 10030, 110, 1, [{20062,30,0}],<<"击败金鳝">>, <<"击败金鳝">>, [{""}],[{""},{""}],2974, 57, 0, 2, 0, 0, [{0,0,541004201,100000},{0,0,531004201,3200},{0,0,531004201,5000},{1,1,518001201,1},{1,2,518002201,1},{1,3,518003201,1}],[],0, 2976, 0};	
get(2976)->
	{tpl_task, 2976, 6, 10030, 0, 10030, 110, 1, [{20064,70,0}],<<"击退海卫">>, <<"击退海卫">>, [{""}],[{""},{""}],2975, 59, 0, 2, 0, 0, [{0,0,541004201,100000},{0,0,531004201,3300},{0,0,531004201,5000},{1,1,518001201,1},{1,2,518002201,1},{1,3,518003201,1}],[],0, 2977, 0};	
get(2977)->
	{tpl_task, 2977, 6, 10030, 0, 10030, 111, 1, [{20036,40,0}],<<"斩杀魔女">>, <<"斩杀魔女">>, [{""}],[{""},{""}],2976, 63, 0, 2, 0, 0, [{0,0,541004201,100000},{0,0,531004201,3200},{0,0,531004201,5000},{1,1,518001201,1},{1,2,518002201,1},{1,3,518003201,1}],[],0, 2978, 0};	
get(2978)->
	{tpl_task, 2978, 6, 10030, 0, 10030, 111, 1, [{20037,80,0}],<<"击杀夜叉">>, <<"击杀夜叉">>, [{""}],[{""},{""}],2977, 67, 0, 2, 0, 0, [{0,0,541004201,100000},{0,0,531004201,3200},{0,0,531004201,5000},{1,1,518001201,1},{1,2,518002201,1},{1,3,518003201,1}],[],0, 2979, 0};	
get(2979)->
	{tpl_task, 2979, 6, 10030, 0, 10030, 111, 1, [{20038,100,0}],<<"教训魑魅">>, <<"教训魑魅">>, [{""}],[{""},{""}],2978, 71, 0, 2, 0, 0, [{0,0,541004201,100000},{0,0,531004201,3300},{0,0,531004201,5000},{1,1,518001201,1},{1,2,518002201,1},{1,3,518003201,1}],[],0, 2980, 0};	
get(2980)->
	{tpl_task, 2980, 6, 10030, 0, 10030, 111, 1, [{20039,90,0}],<<"击败夜魔">>, <<"击败夜魔">>, [{""}],[{""},{""}],2979, 75, 0, 2, 0, 0, [{0,0,541004201,100000},{0,0,531004201,3300},{0,0,531004201,5000},{1,1,518001201,1},{1,2,518002201,1},{1,3,518003201,1}],[],0, 2981, 0};	
get(2981)->
	{tpl_task, 2981, 6, 10030, 0, 10030, 111, 1, [{20040,20,0}],<<"击退魔君">>, <<"击退魔君">>, [{""}],[{""},{""}],2980, 79, 0, 2, 0, 0, [{0,0,541004201,100000},{0,0,531004201,3300},{0,0,531004201,5000},{1,1,518001201,1},{1,2,518002201,1},{1,3,518003201,1}],[],0, 2982, 0};	
get(2982)->
	{tpl_task, 2982, 6, 10030, 0, 10030, 112, 1, [{20041,80,0}],<<"收服迷情">>, <<"收服迷情">>, [{""}],[{""},{""}],2981, 99, 0, 2, 0, 0, [{0,0,541004201,100000},{0,0,531004201,3200},{0,0,531004201,5000},{1,1,518001201,1},{1,2,518002201,1},{1,3,518003201,1}],[],0, 2983, 0};	
get(2983)->
	{tpl_task, 2983, 6, 10030, 0, 10030, 112, 1, [{20042,90,0}],<<"斩杀酒妖">>, <<"斩杀酒妖">>, [{""}],[{""},{""}],2982, 99, 0, 2, 0, 0, [{0,0,541004201,100000},{0,0,531004201,3300},{0,0,531004201,5000},{1,1,518001201,1},{1,2,518002201,1},{1,3,518003201,1}],[],0, 2984, 0};	
get(2984)->
	{tpl_task, 2984, 6, 10030, 0, 10030, 112, 1, [{20043,10,0}],<<"击杀财魔">>, <<"击杀财魔">>, [{""}],[{""},{""}],2983, 99, 0, 2, 0, 0, [{0,0,541004201,100000},{0,0,531004201,3200},{0,0,531004201,5000},{1,1,518001201,1},{1,2,518002201,1},{1,3,518003201,1}],[],0, 2985, 0};	
get(2985)->
	{tpl_task, 2985, 6, 10030, 0, 10030, 112, 1, [{20044,90,0}],<<"教训琴魔">>, <<"教训琴魔">>, [{""}],[{""},{""}],2984, 99, 0, 2, 0, 0, [{0,0,541004201,100000},{0,0,531004201,3200},{0,0,531004201,5000},{1,1,518001201,1},{1,2,518002201,1},{1,3,518003201,1}],[],0, 2986, 0};	
get(2986)->
	{tpl_task, 2986, 6, 10030, 0, 10030, 113, 1, [{20045,90,0}],<<"击败雪狼">>, <<"击败雪狼">>, [{""}],[{""},{""}],2985, 99, 0, 2, 0, 0, [{0,0,541004201,100000},{0,0,531004201,3300},{0,0,531004201,5000},{1,1,518001201,1},{1,2,518002201,1},{1,3,518003201,1}],[],0, 2987, 0};	
get(2987)->
	{tpl_task, 2987, 6, 10030, 0, 10030, 113, 1, [{20046,50,0}],<<"击退飞马">>, <<"击退飞马">>, [{""}],[{""},{""}],2986, 99, 0, 2, 0, 0, [{0,0,541004201,100000},{0,0,531004201,3200},{0,0,531004201,5000},{1,1,518001201,1},{1,2,518002201,1},{1,3,518003201,1}],[],0, 2988, 0};	
get(2988)->
	{tpl_task, 2988, 6, 10030, 0, 10030, 113, 1, [{20047,40,0}],<<"收服祭司">>, <<"收服祭司">>, [{""}],[{""},{""}],2987, 99, 0, 2, 0, 0, [{0,0,541004201,100000},{0,0,531004201,3300},{0,0,531004201,5000},{1,1,518001201,1},{1,2,518002201,1},{1,3,518003201,1}],[],0, 2989, 0};	
get(2989)->
	{tpl_task, 2989, 6, 10030, 0, 10030, 113, 1, [{20048,80,0}],<<"斩杀狂魔">>, <<"斩杀狂魔">>, [{""}],[{""},{""}],2988, 99, 0, 2, 0, 0, [{0,0,541004201,100000},{0,0,531004201,3200},{0,0,531004201,5000},{1,1,518001201,1},{1,2,518002201,1},{1,3,518003201,1}],[],0, 2990, 0};	
get(2990)->
	{tpl_task, 2990, 6, 10030, 0, 10030, 113, 1, [{20049,90,0}],<<"击杀牛妖">>, <<"击杀牛妖">>, [{""}],[{""},{""}],2989, 99, 0, 2, 0, 0, [{0,0,541004201,100000},{0,0,531004201,3200},{0,0,531004201,5000},{1,1,518001201,1},{1,2,518002201,1},{1,3,518003201,1}],[],0, 3249, 0};	
get(3249)->
	{tpl_task, 3249, 7, 10039, 0, 10039, 101, 1, [{20001,50,0}],<<"击杀山精">>, <<"击杀山精">>, [{""}],[{""},{""}],2990, 35, 0, 2, 0, 0, [{0,0,541004201,100000},{0,0,551004201,1100},{0,0,531004201,4000},{0,0,520001201,1}],[],0, 3250, 0};	
get(3250)->
	{tpl_task, 3250, 7, 10039, 0, 10039, 101, 1, [{20003,90,0}],<<"教训树妖">>, <<"教训树妖">>, [{""}],[{""},{""}],3249, 35, 0, 2, 0, 0, [{0,0,541004201,100000},{0,0,551004201,960},{0,0,531004201,4000},{0,0,520001201,1}],[],0, 3251, 0};	
get(3251)->
	{tpl_task, 3251, 7, 10039, 0, 10039, 104, 1, [{20005,90,0}],<<"击败黑鲛">>, <<"击败黑鲛">>, [{""}],[{""},{""}],3250, 35, 0, 2, 0, 0, [{0,0,541004201,100000},{0,0,551004201,1000},{0,0,531004201,4000},{0,0,520001201,1}],[],0, 3252, 0};	
get(3252)->
	{tpl_task, 3252, 7, 10039, 0, 10039, 104, 1, [{20006,90,0}],<<"击退鲛女">>, <<"击退鲛女">>, [{""}],[{""},{""}],3251, 35, 0, 2, 0, 0, [{0,0,541004201,100000},{0,0,551004201,1100},{0,0,531004201,4000},{0,0,520001201,1}],[],0, 3253, 0};	
get(3253)->
	{tpl_task, 3253, 7, 10039, 0, 10039, 104, 1, [{20053,80,0}],<<"收服巨虾">>, <<"收服巨虾">>, [{""}],[{""},{""}],3252, 35, 0, 2, 0, 0, [{0,0,541004201,100000},{0,0,551004201,970},{0,0,531004201,4000},{0,0,520001201,1}],[],0, 3254, 0};	
get(3254)->
	{tpl_task, 3254, 7, 10039, 0, 10039, 105, 1, [{20059,100,0}],<<"斩杀妖女">>, <<"斩杀妖女">>, [{""}],[{""},{""}],3253, 35, 0, 2, 0, 0, [{0,0,541004201,100000},{0,0,551004201,1100},{0,0,531004201,4000},{0,0,520001201,1}],[],0, 3255, 0};	
get(3255)->
	{tpl_task, 3255, 7, 10039, 0, 10039, 105, 1, [{20011,80,0}],<<"击杀游魂">>, <<"击杀游魂">>, [{""}],[{""},{""}],3254, 35, 0, 2, 0, 0, [{0,0,541004201,100000},{0,0,551004201,1100},{0,0,531004201,4000},{0,0,520001201,1}],[],0, 3256, 0};	
get(3256)->
	{tpl_task, 3256, 7, 10039, 0, 10039, 105, 1, [{20008,40,0}],<<"教训雪精">>, <<"教训雪精">>, [{""}],[{""},{""}],3255, 35, 0, 2, 0, 0, [{0,0,541004201,100000},{0,0,551004201,990},{0,0,531004201,4000},{0,0,520001201,1}],[],0, 3257, 0};	
get(3257)->
	{tpl_task, 3257, 7, 10039, 0, 10039, 107, 1, [{20015,50,0}],<<"击败神王">>, <<"击败神王">>, [{""}],[{""},{""}],3256, 35, 0, 2, 0, 0, [{0,0,541004201,100000},{0,0,551004201,1000},{0,0,531004201,4000},{0,0,520001201,1}],[],0, 3258, 0};	
get(3258)->
	{tpl_task, 3258, 7, 10039, 0, 10039, 107, 1, [{20012,30,0}],<<"击退妖兽">>, <<"击退妖兽">>, [{""}],[{""},{""}],3257, 35, 0, 2, 0, 0, [{0,0,541004201,100000},{0,0,551004201,1100},{0,0,531004201,4000},{0,0,520001201,1}],[],0, 3259, 0};	
get(3259)->
	{tpl_task, 3259, 7, 10039, 0, 10039, 107, 1, [{20050,90,0}],<<"收服火岩">>, <<"收服火岩">>, [{""}],[{""},{""}],3258, 35, 0, 2, 0, 0, [{0,0,541004201,100000},{0,0,551004201,1100},{0,0,531004201,4000},{0,0,520001201,1}],[],0, 3260, 0};	
get(3260)->
	{tpl_task, 3260, 7, 10039, 0, 10039, 109, 1, [{20058,20,0}],<<"斩杀花奴">>, <<"斩杀花奴">>, [{""}],[{""},{""}],3259, 36, 0, 2, 0, 0, [{0,0,541004201,100000},{0,0,551004201,960},{0,0,531004201,4000},{0,0,520001201,1}],[],0, 3261, 0};	
get(3261)->
	{tpl_task, 3261, 7, 10039, 0, 10039, 109, 1, [{20057,30,0}],<<"击杀灵蛙">>, <<"击杀灵蛙">>, [{""}],[{""},{""}],3260, 37, 0, 2, 0, 0, [{0,0,541004201,100000},{0,0,551004201,1000},{0,0,531004201,4000},{0,0,520001201,1}],[],0, 3262, 0};	
get(3262)->
	{tpl_task, 3262, 7, 10039, 0, 10039, 109, 1, [{20063,90,0}],<<"教训白鹿">>, <<"教训白鹿">>, [{""}],[{""},{""}],3261, 38, 0, 2, 0, 0, [{0,0,541004201,100000},{0,0,551004201,990},{0,0,531004201,4000},{0,0,520001201,1}],[],0, 3263, 0};	
get(3263)->
	{tpl_task, 3263, 7, 10039, 0, 10039, 109, 1, [{20016,70,0}],<<"击败兰灵">>, <<"击败兰灵">>, [{""}],[{""},{""}],3262, 39, 0, 2, 0, 0, [{0,0,541004201,100000},{0,0,551004201,990},{0,0,531004201,4000},{0,0,520001201,1}],[],0, 3264, 0};	
get(3264)->
	{tpl_task, 3264, 7, 10039, 0, 10039, 106, 1, [{20054,40,0}],<<"击退凤凰">>, <<"击退凤凰">>, [{""}],[{""},{""}],3263, 37, 0, 2, 0, 0, [{0,0,541004201,100000},{0,0,551004201,1100},{0,0,531004201,4000},{0,0,520001201,1}],[],0, 3265, 0};	
get(3265)->
	{tpl_task, 3265, 7, 10039, 0, 10039, 106, 1, [{20017,40,0}],<<"收服蜂鸟">>, <<"收服蜂鸟">>, [{""}],[{""},{""}],3264, 39, 0, 2, 0, 0, [{0,0,541004201,100000},{0,0,551004201,960},{0,0,531004201,4000},{0,0,520001201,1}],[],0, 3266, 0};	
get(3266)->
	{tpl_task, 3266, 7, 10039, 0, 10039, 106, 1, [{20055,100,0}],<<"斩杀青狼">>, <<"斩杀青狼">>, [{""}],[{""},{""}],3265, 41, 0, 2, 0, 0, [{0,0,541004201,100000},{0,0,551004201,1000},{0,0,531004201,4000},{0,0,520001201,1}],[],0, 3267, 0};	
get(3267)->
	{tpl_task, 3267, 7, 10039, 0, 10039, 108, 1, [{20024,30,0}],<<"击杀魔蝎">>, <<"击杀魔蝎">>, [{""}],[{""},{""}],3266, 42, 0, 2, 0, 0, [{0,0,541004201,100000},{0,0,551004201,1100},{0,0,531004201,4000},{0,0,520001201,1}],[],0, 3268, 0};	
get(3268)->
	{tpl_task, 3268, 7, 10039, 0, 10039, 108, 1, [{20002,50,0}],<<"教训狂豹">>, <<"教训狂豹">>, [{""}],[{""},{""}],3267, 44, 0, 2, 0, 0, [{0,0,541004201,100000},{0,0,551004201,1100},{0,0,531004201,4000},{0,0,520001201,1}],[],0, 3269, 0};	
get(3269)->
	{tpl_task, 3269, 7, 10039, 0, 10039, 108, 1, [{20022,20,0}],<<"击败守卫">>, <<"击败守卫">>, [{""}],[{""},{""}],3268, 46, 0, 2, 0, 0, [{0,0,541004201,100000},{0,0,551004201,1100},{0,0,531004201,4000},{0,0,520001201,1}],[],0, 3270, 0};	
get(3270)->
	{tpl_task, 3270, 7, 10039, 0, 10039, 108, 1, [{20051,100,0}],<<"击退火元">>, <<"击退火元">>, [{""}],[{""},{""}],3269, 48, 0, 2, 0, 0, [{0,0,541004201,100000},{0,0,551004201,1000},{0,0,531004201,4000},{0,0,520001201,1}],[],0, 3271, 0};	
get(3271)->
	{tpl_task, 3271, 7, 10039, 0, 10039, 108, 1, [{20021,60,0}],<<"收服狂龙">>, <<"收服狂龙">>, [{""}],[{""},{""}],3270, 50, 0, 2, 0, 0, [{0,0,541004201,100000},{0,0,551004201,1100},{0,0,531004201,4000},{0,0,520001201,1}],[],0, 3272, 0};	
get(3272)->
	{tpl_task, 3272, 7, 10039, 0, 10039, 110, 1, [{20004,50,0}],<<"斩杀兵士">>, <<"斩杀兵士">>, [{""}],[{""},{""}],3271, 51, 0, 2, 0, 0, [{0,0,541004201,100000},{0,0,551004201,1100},{0,0,531004201,4000},{0,0,520001201,1}],[],0, 3273, 0};	
get(3273)->
	{tpl_task, 3273, 7, 10039, 0, 10039, 110, 1, [{20060,40,0}],<<"击杀鲛人">>, <<"击杀鲛人">>, [{""}],[{""},{""}],3272, 53, 0, 2, 0, 0, [{0,0,541004201,100000},{0,0,551004201,990},{0,0,531004201,4000},{0,0,520001201,1}],[],0, 3274, 0};	
get(3274)->
	{tpl_task, 3274, 7, 10039, 0, 10039, 110, 1, [{20061,90,0}],<<"教训喽啰">>, <<"教训喽啰">>, [{""}],[{""},{""}],3273, 55, 0, 2, 0, 0, [{0,0,541004201,100000},{0,0,551004201,1100},{0,0,531004201,4000},{0,0,520001201,1}],[],0, 3275, 0};	
get(3275)->
	{tpl_task, 3275, 7, 10039, 0, 10039, 110, 1, [{20062,30,0}],<<"击败金鳝">>, <<"击败金鳝">>, [{""}],[{""},{""}],3274, 57, 0, 2, 0, 0, [{0,0,541004201,100000},{0,0,551004201,960},{0,0,531004201,4000},{0,0,520001201,1}],[],0, 3276, 0};	
get(3276)->
	{tpl_task, 3276, 7, 10039, 0, 10039, 110, 1, [{20064,70,0}],<<"击退海卫">>, <<"击退海卫">>, [{""}],[{""},{""}],3275, 59, 0, 2, 0, 0, [{0,0,541004201,100000},{0,0,551004201,1100},{0,0,531004201,4000},{0,0,520001201,1}],[],0, 3277, 0};	
get(3277)->
	{tpl_task, 3277, 7, 10039, 0, 10039, 111, 1, [{20036,40,0}],<<"斩杀魔女">>, <<"斩杀魔女">>, [{""}],[{""},{""}],3276, 63, 0, 2, 0, 0, [{0,0,541004201,100000},{0,0,551004201,1100},{0,0,531004201,4000},{0,0,520001201,1}],[],0, 3278, 0};	
get(3278)->
	{tpl_task, 3278, 7, 10039, 0, 10039, 111, 1, [{20037,80,0}],<<"击杀夜叉">>, <<"击杀夜叉">>, [{""}],[{""},{""}],3277, 67, 0, 2, 0, 0, [{0,0,541004201,100000},{0,0,551004201,1100},{0,0,531004201,4000},{0,0,520001201,1}],[],0, 3279, 0};	
get(3279)->
	{tpl_task, 3279, 7, 10039, 0, 10039, 111, 1, [{20038,100,0}],<<"教训魑魅">>, <<"教训魑魅">>, [{""}],[{""},{""}],3278, 71, 0, 2, 0, 0, [{0,0,541004201,100000},{0,0,551004201,1100},{0,0,531004201,4000},{0,0,520001201,1}],[],0, 3280, 0};	
get(3280)->
	{tpl_task, 3280, 7, 10039, 0, 10039, 111, 1, [{20039,90,0}],<<"击败夜魔">>, <<"击败夜魔">>, [{""}],[{""},{""}],3279, 75, 0, 2, 0, 0, [{0,0,541004201,100000},{0,0,551004201,1100},{0,0,531004201,4000},{0,0,520001201,1}],[],0, 3281, 0};	
get(3281)->
	{tpl_task, 3281, 7, 10039, 0, 10039, 111, 1, [{20040,20,0}],<<"击退魔君">>, <<"击退魔君">>, [{""}],[{""},{""}],3280, 79, 0, 2, 0, 0, [{0,0,541004201,100000},{0,0,551004201,1100},{0,0,531004201,4000},{0,0,520001201,1}],[],0, 3282, 0};	
get(3282)->
	{tpl_task, 3282, 7, 10039, 0, 10039, 112, 1, [{20041,80,0}],<<"收服迷情">>, <<"收服迷情">>, [{""}],[{""},{""}],3281, 99, 0, 2, 0, 0, [{0,0,541004201,100000},{0,0,551004201,960},{0,0,531004201,4000},{0,0,520001201,1}],[],0, 3283, 0};	
get(3283)->
	{tpl_task, 3283, 7, 10039, 0, 10039, 112, 1, [{20042,90,0}],<<"斩杀酒妖">>, <<"斩杀酒妖">>, [{""}],[{""},{""}],3282, 99, 0, 2, 0, 0, [{0,0,541004201,100000},{0,0,551004201,970},{0,0,531004201,4000},{0,0,520001201,1}],[],0, 3284, 0};	
get(3284)->
	{tpl_task, 3284, 7, 10039, 0, 10039, 112, 1, [{20043,10,0}],<<"击杀财魔">>, <<"击杀财魔">>, [{""}],[{""},{""}],3283, 99, 0, 2, 0, 0, [{0,0,541004201,100000},{0,0,551004201,990},{0,0,531004201,4000},{0,0,520001201,1}],[],0, 3285, 0};	
get(3285)->
	{tpl_task, 3285, 7, 10039, 0, 10039, 112, 1, [{20044,90,0}],<<"教训琴魔">>, <<"教训琴魔">>, [{""}],[{""},{""}],3284, 99, 0, 2, 0, 0, [{0,0,541004201,100000},{0,0,551004201,970},{0,0,531004201,4000},{0,0,520001201,1}],[],0, 3286, 0};	
get(3286)->
	{tpl_task, 3286, 7, 10039, 0, 10039, 113, 1, [{20045,90,0}],<<"击败雪狼">>, <<"击败雪狼">>, [{""}],[{""},{""}],3285, 99, 0, 2, 0, 0, [{0,0,541004201,100000},{0,0,551004201,1100},{0,0,531004201,4000},{0,0,520001201,1}],[],0, 3287, 0};	
get(3287)->
	{tpl_task, 3287, 7, 10039, 0, 10039, 113, 1, [{20046,50,0}],<<"击退飞马">>, <<"击退飞马">>, [{""}],[{""},{""}],3286, 99, 0, 2, 0, 0, [{0,0,541004201,100000},{0,0,551004201,1100},{0,0,531004201,4000},{0,0,520001201,1}],[],0, 3288, 0};	
get(3288)->
	{tpl_task, 3288, 7, 10039, 0, 10039, 113, 1, [{20047,40,0}],<<"收服祭司">>, <<"收服祭司">>, [{""}],[{""},{""}],3287, 99, 0, 2, 0, 0, [{0,0,541004201,100000},{0,0,551004201,970},{0,0,531004201,4000},{0,0,520001201,1}],[],0, 3289, 0};	
get(3289)->
	{tpl_task, 3289, 7, 10039, 0, 10039, 113, 1, [{20048,80,0}],<<"斩杀狂魔">>, <<"斩杀狂魔">>, [{""}],[{""},{""}],3288, 99, 0, 2, 0, 0, [{0,0,541004201,100000},{0,0,551004201,960},{0,0,531004201,4000},{0,0,520001201,1}],[],0, 3290, 0};	
get(3290)->
	{tpl_task, 3290, 7, 10039, 0, 10039, 113, 1, [{20049,90,0}],<<"击杀牛妖">>, <<"击杀牛妖">>, [{""}],[{""},{""}],3289, 99, 0, 2, 0, 0, [{0,0,541004201,100000},{0,0,551004201,980},{0,0,531004201,4000},{0,0,520001201,1}],[],0, 3549, 0};	
get(3549)->
	{tpl_task, 3549, 8, 10027, 0, 10027, 101, 1, [{20001,50,0}],<<"击杀山精">>, <<"击杀山精">>, [{""}],[{""},{""}],3290, 40, 0, 2, 0, 0, [{0,0,541004201,100000}],[],0, 3550, 0};	
get(3550)->
	{tpl_task, 3550, 8, 10027, 0, 10027, 101, 1, [{20003,90,0}],<<"教训树妖">>, <<"教训树妖">>, [{""}],[{""},{""}],3549, 40, 0, 2, 0, 0, [{0,0,541004201,100000}],[],0, 3551, 0};	
get(3551)->
	{tpl_task, 3551, 8, 10027, 0, 10027, 104, 1, [{20005,90,0}],<<"击败黑鲛">>, <<"击败黑鲛">>, [{""}],[{""},{""}],3550, 40, 0, 2, 0, 0, [{0,0,541004201,100000}],[],0, 3552, 0};	
get(3552)->
	{tpl_task, 3552, 8, 10027, 0, 10027, 104, 1, [{20006,90,0}],<<"击退鲛女">>, <<"击退鲛女">>, [{""}],[{""},{""}],3551, 40, 0, 2, 0, 0, [{0,0,541004201,100000}],[],0, 3553, 0};	
get(3553)->
	{tpl_task, 3553, 8, 10027, 0, 10027, 104, 1, [{20053,80,0}],<<"收服巨虾">>, <<"收服巨虾">>, [{""}],[{""},{""}],3552, 40, 0, 2, 0, 0, [{0,0,541004201,100000}],[],0, 3554, 0};	
get(3554)->
	{tpl_task, 3554, 8, 10027, 0, 10027, 105, 1, [{20059,100,0}],<<"斩杀妖女">>, <<"斩杀妖女">>, [{""}],[{""},{""}],3553, 40, 0, 2, 0, 0, [{0,0,541004201,100000}],[],0, 3555, 0};	
get(3555)->
	{tpl_task, 3555, 8, 10027, 0, 10027, 105, 1, [{20011,80,0}],<<"击杀游魂">>, <<"击杀游魂">>, [{""}],[{""},{""}],3554, 40, 0, 2, 0, 0, [{0,0,541004201,100000}],[],0, 3556, 0};	
get(3556)->
	{tpl_task, 3556, 8, 10027, 0, 10027, 105, 1, [{20008,40,0}],<<"教训雪精">>, <<"教训雪精">>, [{""}],[{""},{""}],3555, 40, 0, 2, 0, 0, [{0,0,541004201,100000}],[],0, 3557, 0};	
get(3557)->
	{tpl_task, 3557, 8, 10027, 0, 10027, 107, 1, [{20015,50,0}],<<"击败神王">>, <<"击败神王">>, [{""}],[{""},{""}],3556, 40, 0, 2, 0, 0, [{0,0,541004201,100000}],[],0, 3558, 0};	
get(3558)->
	{tpl_task, 3558, 8, 10027, 0, 10027, 107, 1, [{20012,30,0}],<<"击退妖兽">>, <<"击退妖兽">>, [{""}],[{""},{""}],3557, 40, 0, 2, 0, 0, [{0,0,541004201,100000}],[],0, 3559, 0};	
get(3559)->
	{tpl_task, 3559, 8, 10027, 0, 10027, 107, 1, [{20050,90,0}],<<"收服火岩">>, <<"收服火岩">>, [{""}],[{""},{""}],3558, 40, 0, 2, 0, 0, [{0,0,541004201,100000}],[],0, 3560, 0};	
get(3560)->
	{tpl_task, 3560, 8, 10027, 0, 10027, 109, 1, [{20058,20,0}],<<"斩杀花奴">>, <<"斩杀花奴">>, [{""}],[{""},{""}],3559, 40, 0, 2, 0, 0, [{0,0,541004201,100000}],[],0, 3561, 0};	
get(3561)->
	{tpl_task, 3561, 8, 10027, 0, 10027, 109, 1, [{20057,30,0}],<<"击杀灵蛙">>, <<"击杀灵蛙">>, [{""}],[{""},{""}],3560, 40, 0, 2, 0, 0, [{0,0,541004201,100000}],[],0, 3562, 0};	
get(3562)->
	{tpl_task, 3562, 8, 10027, 0, 10027, 109, 1, [{20063,90,0}],<<"教训白鹿">>, <<"教训白鹿">>, [{""}],[{""},{""}],3561, 40, 0, 2, 0, 0, [{0,0,541004201,100000}],[],0, 3563, 0};	
get(3563)->
	{tpl_task, 3563, 8, 10027, 0, 10027, 109, 1, [{20016,70,0}],<<"击败兰灵">>, <<"击败兰灵">>, [{""}],[{""},{""}],3562, 40, 0, 2, 0, 0, [{0,0,541004201,100000}],[],0, 3564, 0};	
get(3564)->
	{tpl_task, 3564, 8, 10027, 0, 10027, 106, 1, [{20054,40,0}],<<"击退凤凰">>, <<"击退凤凰">>, [{""}],[{""},{""}],3563, 40, 0, 2, 0, 0, [{0,0,541004201,100000}],[],0, 3565, 0};	
get(3565)->
	{tpl_task, 3565, 8, 10027, 0, 10027, 106, 1, [{20017,40,0}],<<"收服蜂鸟">>, <<"收服蜂鸟">>, [{""}],[{""},{""}],3564, 40, 0, 2, 0, 0, [{0,0,541004201,100000}],[],0, 3566, 0};	
get(3566)->
	{tpl_task, 3566, 8, 10027, 0, 10027, 106, 1, [{20055,100,0}],<<"斩杀青狼">>, <<"斩杀青狼">>, [{""}],[{""},{""}],3565, 41, 0, 2, 0, 0, [{0,0,541004201,100000}],[],0, 3567, 0};	
get(3567)->
	{tpl_task, 3567, 8, 10027, 0, 10027, 108, 1, [{20024,30,0}],<<"击杀魔蝎">>, <<"击杀魔蝎">>, [{""}],[{""},{""}],3566, 42, 0, 2, 0, 0, [{0,0,541004201,100000}],[],0, 3568, 0};	
get(3568)->
	{tpl_task, 3568, 8, 10027, 0, 10027, 108, 1, [{20002,50,0}],<<"教训狂豹">>, <<"教训狂豹">>, [{""}],[{""},{""}],3567, 44, 0, 2, 0, 0, [{0,0,541004201,100000}],[],0, 3569, 0};	
get(3569)->
	{tpl_task, 3569, 8, 10027, 0, 10027, 108, 1, [{20022,20,0}],<<"击败守卫">>, <<"击败守卫">>, [{""}],[{""},{""}],3568, 46, 0, 2, 0, 0, [{0,0,541004201,100000}],[],0, 3570, 0};	
get(3570)->
	{tpl_task, 3570, 8, 10027, 0, 10027, 108, 1, [{20051,100,0}],<<"击退火元">>, <<"击退火元">>, [{""}],[{""},{""}],3569, 48, 0, 2, 0, 0, [{0,0,541004201,100000}],[],0, 3571, 0};	
get(3571)->
	{tpl_task, 3571, 8, 10027, 0, 10027, 108, 1, [{20021,60,0}],<<"收服狂龙">>, <<"收服狂龙">>, [{""}],[{""},{""}],3570, 50, 0, 2, 0, 0, [{0,0,541004201,100000}],[],0, 3572, 0};	
get(3572)->
	{tpl_task, 3572, 8, 10027, 0, 10027, 110, 1, [{20004,50,0}],<<"斩杀兵士">>, <<"斩杀兵士">>, [{""}],[{""},{""}],3571, 51, 0, 2, 0, 0, [{0,0,541004201,100000}],[],0, 3573, 0};	
get(3573)->
	{tpl_task, 3573, 8, 10027, 0, 10027, 110, 1, [{20060,40,0}],<<"击杀鲛人">>, <<"击杀鲛人">>, [{""}],[{""},{""}],3572, 53, 0, 2, 0, 0, [{0,0,541004201,100000}],[],0, 3574, 0};	
get(3574)->
	{tpl_task, 3574, 8, 10027, 0, 10027, 110, 1, [{20061,90,0}],<<"教训喽啰">>, <<"教训喽啰">>, [{""}],[{""},{""}],3573, 55, 0, 2, 0, 0, [{0,0,541004201,100000}],[],0, 3575, 0};	
get(3575)->
	{tpl_task, 3575, 8, 10027, 0, 10027, 110, 1, [{20062,30,0}],<<"击败金鳝">>, <<"击败金鳝">>, [{""}],[{""},{""}],3574, 57, 0, 2, 0, 0, [{0,0,541004201,100000}],[],0, 3576, 0};	
get(3576)->
	{tpl_task, 3576, 8, 10027, 0, 10027, 110, 1, [{20064,70,0}],<<"击退海卫">>, <<"击退海卫">>, [{""}],[{""},{""}],3575, 59, 0, 2, 0, 0, [{0,0,541004201,100000}],[],0, 3577, 0};	
get(3577)->
	{tpl_task, 3577, 8, 10027, 0, 10027, 111, 1, [{20036,40,0}],<<"斩杀魔女">>, <<"斩杀魔女">>, [{""}],[{""},{""}],3576, 63, 0, 2, 0, 0, [{0,0,541004201,100000}],[],0, 3578, 0};	
get(3578)->
	{tpl_task, 3578, 8, 10027, 0, 10027, 111, 1, [{20037,80,0}],<<"击杀夜叉">>, <<"击杀夜叉">>, [{""}],[{""},{""}],3577, 67, 0, 2, 0, 0, [{0,0,541004201,100000}],[],0, 3579, 0};	
get(3579)->
	{tpl_task, 3579, 8, 10027, 0, 10027, 111, 1, [{20038,100,0}],<<"教训魑魅">>, <<"教训魑魅">>, [{""}],[{""},{""}],3578, 71, 0, 2, 0, 0, [{0,0,541004201,100000}],[],0, 3580, 0};	
get(3580)->
	{tpl_task, 3580, 8, 10027, 0, 10027, 111, 1, [{20039,90,0}],<<"击败夜魔">>, <<"击败夜魔">>, [{""}],[{""},{""}],3579, 75, 0, 2, 0, 0, [{0,0,541004201,100000}],[],0, 3581, 0};	
get(3581)->
	{tpl_task, 3581, 8, 10027, 0, 10027, 111, 1, [{20040,20,0}],<<"击退魔君">>, <<"击退魔君">>, [{""}],[{""},{""}],3580, 79, 0, 2, 0, 0, [{0,0,541004201,100000}],[],0, 3582, 0};	
get(3582)->
	{tpl_task, 3582, 8, 10027, 0, 10027, 112, 1, [{20041,80,0}],<<"收服迷情">>, <<"收服迷情">>, [{""}],[{""},{""}],3581, 99, 0, 2, 0, 0, [{0,0,541004201,100000}],[],0, 3583, 0};	
get(3583)->
	{tpl_task, 3583, 8, 10027, 0, 10027, 112, 1, [{20042,90,0}],<<"斩杀酒妖">>, <<"斩杀酒妖">>, [{""}],[{""},{""}],3582, 99, 0, 2, 0, 0, [{0,0,541004201,100000}],[],0, 3584, 0};	
get(3584)->
	{tpl_task, 3584, 8, 10027, 0, 10027, 112, 1, [{20043,10,0}],<<"击杀财魔">>, <<"击杀财魔">>, [{""}],[{""},{""}],3583, 99, 0, 2, 0, 0, [{0,0,541004201,100000}],[],0, 3585, 0};	
get(3585)->
	{tpl_task, 3585, 8, 10027, 0, 10027, 112, 1, [{20044,90,0}],<<"教训琴魔">>, <<"教训琴魔">>, [{""}],[{""},{""}],3584, 99, 0, 2, 0, 0, [{0,0,541004201,100000}],[],0, 3586, 0};	
get(3586)->
	{tpl_task, 3586, 8, 10027, 0, 10027, 113, 1, [{20045,90,0}],<<"击败雪狼">>, <<"击败雪狼">>, [{""}],[{""},{""}],3585, 99, 0, 2, 0, 0, [{0,0,541004201,100000}],[],0, 3587, 0};	
get(3587)->
	{tpl_task, 3587, 8, 10027, 0, 10027, 113, 1, [{20046,50,0}],<<"击退飞马">>, <<"击退飞马">>, [{""}],[{""},{""}],3586, 99, 0, 2, 0, 0, [{0,0,541004201,100000}],[],0, 3588, 0};	
get(3588)->
	{tpl_task, 3588, 8, 10027, 0, 10027, 113, 1, [{20047,40,0}],<<"收服祭司">>, <<"收服祭司">>, [{""}],[{""},{""}],3587, 99, 0, 2, 0, 0, [{0,0,541004201,100000}],[],0, 3589, 0};	
get(3589)->
	{tpl_task, 3589, 8, 10027, 0, 10027, 113, 1, [{20048,80,0}],<<"斩杀狂魔">>, <<"斩杀狂魔">>, [{""}],[{""},{""}],3588, 99, 0, 2, 0, 0, [{0,0,541004201,100000}],[],0, 3590, 0};	
get(3590)->
	{tpl_task, 3590, 8, 10027, 0, 10027, 113, 1, [{20049,90,0}],<<"击杀牛妖">>, <<"击杀牛妖">>, [{""}],[{""},{""}],3589, 99, 0, 2, 0, 0, [{0,0,541004201,100000}],[],0, 3849, 0};	
get(3849)->
	{tpl_task, 3849, 2, 10042, 0, 10042, 101, 1, [{20001,50,0}],<<"击杀山精">>, <<"击杀山精">>, [{""}],[{""},{""}],3590, 38, 0, 2, 0, 0, [{0,0,541004201,100000},{0,0,531004201,4000},{0,0,504014204,1}],[],0, 3850, 0};	
get(3850)->
	{tpl_task, 3850, 2, 10042, 0, 10042, 101, 1, [{20003,90,0}],<<"教训树妖">>, <<"教训树妖">>, [{""}],[{""},{""}],3849, 38, 0, 2, 0, 0, [{0,0,541004201,100000},{0,0,531004201,4000},{0,0,504014204,1}],[],0, 3851, 0};	
get(3851)->
	{tpl_task, 3851, 2, 10042, 0, 10042, 104, 1, [{20005,90,0}],<<"击败黑鲛">>, <<"击败黑鲛">>, [{""}],[{""},{""}],3850, 38, 0, 2, 0, 0, [{0,0,541004201,100000},{0,0,531004201,4000},{0,0,504014204,1}],[],0, 3852, 0};	
get(3852)->
	{tpl_task, 3852, 2, 10042, 0, 10042, 104, 1, [{20006,90,0}],<<"击退鲛女">>, <<"击退鲛女">>, [{""}],[{""},{""}],3851, 38, 0, 2, 0, 0, [{0,0,541004201,100000},{0,0,531004201,4000},{0,0,504014204,1}],[],0, 3853, 0};	
get(3853)->
	{tpl_task, 3853, 2, 10042, 0, 10042, 104, 1, [{20053,80,0}],<<"收服巨虾">>, <<"收服巨虾">>, [{""}],[{""},{""}],3852, 38, 0, 2, 0, 0, [{0,0,541004201,100000},{0,0,531004201,4000},{0,0,504014204,1}],[],0, 3854, 0};	
get(3854)->
	{tpl_task, 3854, 2, 10042, 0, 10042, 105, 1, [{20059,100,0}],<<"斩杀妖女">>, <<"斩杀妖女">>, [{""}],[{""},{""}],3853, 38, 0, 2, 0, 0, [{0,0,541004201,100000},{0,0,531004201,4000},{0,0,504014204,1}],[],0, 3855, 0};	
get(3855)->
	{tpl_task, 3855, 2, 10042, 0, 10042, 105, 1, [{20011,80,0}],<<"击杀游魂">>, <<"击杀游魂">>, [{""}],[{""},{""}],3854, 38, 0, 2, 0, 0, [{0,0,541004201,100000},{0,0,531004201,4000},{0,0,504014204,1}],[],0, 3856, 0};	
get(3856)->
	{tpl_task, 3856, 2, 10042, 0, 10042, 105, 1, [{20008,40,0}],<<"教训雪精">>, <<"教训雪精">>, [{""}],[{""},{""}],3855, 38, 0, 2, 0, 0, [{0,0,541004201,100000},{0,0,531004201,4000},{0,0,504014204,1}],[],0, 3857, 0};	
get(3857)->
	{tpl_task, 3857, 2, 10042, 0, 10042, 107, 1, [{20015,50,0}],<<"击败神王">>, <<"击败神王">>, [{""}],[{""},{""}],3856, 38, 0, 2, 0, 0, [{0,0,541004201,100000},{0,0,531004201,4000},{0,0,504014204,1}],[],0, 3858, 0};	
get(3858)->
	{tpl_task, 3858, 2, 10042, 0, 10042, 107, 1, [{20012,30,0}],<<"击退妖兽">>, <<"击退妖兽">>, [{""}],[{""},{""}],3857, 38, 0, 2, 0, 0, [{0,0,541004201,100000},{0,0,531004201,4000},{0,0,504014204,1}],[],0, 3859, 0};	
get(3859)->
	{tpl_task, 3859, 2, 10042, 0, 10042, 107, 1, [{20050,90,0}],<<"收服火岩">>, <<"收服火岩">>, [{""}],[{""},{""}],3858, 38, 0, 2, 0, 0, [{0,0,541004201,100000},{0,0,531004201,4000},{0,0,504014204,1}],[],0, 3860, 0};	
get(3860)->
	{tpl_task, 3860, 2, 10042, 0, 10042, 109, 1, [{20058,20,0}],<<"斩杀花奴">>, <<"斩杀花奴">>, [{""}],[{""},{""}],3859, 38, 0, 2, 0, 0, [{0,0,541004201,100000},{0,0,531004201,4000},{0,0,504014204,1}],[],0, 3861, 0};	
get(3861)->
	{tpl_task, 3861, 2, 10042, 0, 10042, 109, 1, [{20057,30,0}],<<"击杀灵蛙">>, <<"击杀灵蛙">>, [{""}],[{""},{""}],3860, 38, 0, 2, 0, 0, [{0,0,541004201,100000},{0,0,531004201,4000},{0,0,504014204,1}],[],0, 3862, 0};	
get(3862)->
	{tpl_task, 3862, 2, 10042, 0, 10042, 109, 1, [{20063,90,0}],<<"教训白鹿">>, <<"教训白鹿">>, [{""}],[{""},{""}],3861, 38, 0, 2, 0, 0, [{0,0,541004201,100000},{0,0,531004201,4000},{0,0,504014204,1}],[],0, 3863, 0};	
get(3863)->
	{tpl_task, 3863, 2, 10042, 0, 10042, 109, 1, [{20016,70,0}],<<"击败兰灵">>, <<"击败兰灵">>, [{""}],[{""},{""}],3862, 38, 0, 2, 0, 0, [{0,0,541004201,100000},{0,0,531004201,4000},{0,0,504014204,1}],[],0, 3864, 0};	
get(3864)->
	{tpl_task, 3864, 2, 10042, 0, 10042, 106, 1, [{20054,40,0}],<<"击退凤凰">>, <<"击退凤凰">>, [{""}],[{""},{""}],3863, 38, 0, 2, 0, 0, [{0,0,541004201,100000},{0,0,531004201,4000},{0,0,504014204,1}],[],0, 3865, 0};	
get(3865)->
	{tpl_task, 3865, 2, 10042, 0, 10042, 106, 1, [{20017,40,0}],<<"收服蜂鸟">>, <<"收服蜂鸟">>, [{""}],[{""},{""}],3864, 39, 0, 2, 0, 0, [{0,0,541004201,100000},{0,0,531004201,4000},{0,0,504014204,1}],[],0, 3866, 0};	
get(3866)->
	{tpl_task, 3866, 2, 10042, 0, 10042, 106, 1, [{20055,100,0}],<<"斩杀青狼">>, <<"斩杀青狼">>, [{""}],[{""},{""}],3865, 41, 0, 2, 0, 0, [{0,0,541004201,100000},{0,0,531004201,4000},{0,0,504014204,1}],[],0, 3867, 0};	
get(3867)->
	{tpl_task, 3867, 2, 10042, 0, 10042, 108, 1, [{20024,30,0}],<<"击杀魔蝎">>, <<"击杀魔蝎">>, [{""}],[{""},{""}],3866, 42, 0, 2, 0, 0, [{0,0,541004201,100000},{0,0,531004201,4000},{0,0,504014204,1}],[],0, 3868, 0};	
get(3868)->
	{tpl_task, 3868, 2, 10042, 0, 10042, 108, 1, [{20002,50,0}],<<"教训狂豹">>, <<"教训狂豹">>, [{""}],[{""},{""}],3867, 44, 0, 2, 0, 0, [{0,0,541004201,100000},{0,0,531004201,4000},{0,0,504014204,1}],[],0, 3869, 0};	
get(3869)->
	{tpl_task, 3869, 2, 10042, 0, 10042, 108, 1, [{20022,20,0}],<<"击败守卫">>, <<"击败守卫">>, [{""}],[{""},{""}],3868, 46, 0, 2, 0, 0, [{0,0,541004201,100000},{0,0,531004201,4000},{0,0,504014204,1}],[],0, 3870, 0};	
get(3870)->
	{tpl_task, 3870, 2, 10042, 0, 10042, 108, 1, [{20051,100,0}],<<"击退火元">>, <<"击退火元">>, [{""}],[{""},{""}],3869, 48, 0, 2, 0, 0, [{0,0,541004201,100000},{0,0,531004201,4000},{0,0,504014204,1}],[],0, 3871, 0};	
get(3871)->
	{tpl_task, 3871, 2, 10042, 0, 10042, 108, 1, [{20021,60,0}],<<"收服狂龙">>, <<"收服狂龙">>, [{""}],[{""},{""}],3870, 50, 0, 2, 0, 0, [{0,0,541004201,100000},{0,0,531004201,4000},{0,0,504014204,1}],[],0, 3872, 0};	
get(3872)->
	{tpl_task, 3872, 2, 10042, 0, 10042, 110, 1, [{20004,50,0}],<<"斩杀兵士">>, <<"斩杀兵士">>, [{""}],[{""},{""}],3871, 51, 0, 2, 0, 0, [{0,0,541004201,100000},{0,0,531004201,4000},{0,0,504014204,1}],[],0, 3873, 0};	
get(3873)->
	{tpl_task, 3873, 2, 10042, 0, 10042, 110, 1, [{20060,40,0}],<<"击杀鲛人">>, <<"击杀鲛人">>, [{""}],[{""},{""}],3872, 53, 0, 2, 0, 0, [{0,0,541004201,100000},{0,0,531004201,4000},{0,0,504014204,1}],[],0, 3874, 0};	
get(3874)->
	{tpl_task, 3874, 2, 10042, 0, 10042, 110, 1, [{20061,90,0}],<<"教训喽啰">>, <<"教训喽啰">>, [{""}],[{""},{""}],3873, 55, 0, 2, 0, 0, [{0,0,541004201,100000},{0,0,531004201,4000},{0,0,504014204,1}],[],0, 3875, 0};	
get(3875)->
	{tpl_task, 3875, 2, 10042, 0, 10042, 110, 1, [{20062,30,0}],<<"击败金鳝">>, <<"击败金鳝">>, [{""}],[{""},{""}],3874, 57, 0, 2, 0, 0, [{0,0,541004201,100000},{0,0,531004201,4000},{0,0,504014204,1}],[],0, 3876, 0};	
get(3876)->
	{tpl_task, 3876, 2, 10042, 0, 10042, 110, 1, [{20064,70,0}],<<"击退海卫">>, <<"击退海卫">>, [{""}],[{""},{""}],3875, 59, 0, 2, 0, 0, [{0,0,541004201,100000},{0,0,531004201,4000},{0,0,504014204,1}],[],0, 3877, 0};	
get(3877)->
	{tpl_task, 3877, 2, 10042, 0, 10042, 111, 1, [{20036,40,0}],<<"斩杀魔女">>, <<"斩杀魔女">>, [{""}],[{""},{""}],3876, 63, 0, 2, 0, 0, [{0,0,541004201,100000},{0,0,531004201,4000},{0,0,504014204,1}],[],0, 3878, 0};	
get(3878)->
	{tpl_task, 3878, 2, 10042, 0, 10042, 111, 1, [{20037,80,0}],<<"击杀夜叉">>, <<"击杀夜叉">>, [{""}],[{""},{""}],3877, 67, 0, 2, 0, 0, [{0,0,541004201,100000},{0,0,531004201,4000},{0,0,504014204,1}],[],0, 3879, 0};	
get(3879)->
	{tpl_task, 3879, 2, 10042, 0, 10042, 111, 1, [{20038,100,0}],<<"教训魑魅">>, <<"教训魑魅">>, [{""}],[{""},{""}],3878, 71, 0, 2, 0, 0, [{0,0,541004201,100000},{0,0,531004201,4000},{0,0,504014204,1}],[],0, 3880, 0};	
get(3880)->
	{tpl_task, 3880, 2, 10042, 0, 10042, 111, 1, [{20039,90,0}],<<"击败夜魔">>, <<"击败夜魔">>, [{""}],[{""},{""}],3879, 75, 0, 2, 0, 0, [{0,0,541004201,100000},{0,0,531004201,4000},{0,0,504014204,1}],[],0, 3881, 0};	
get(3881)->
	{tpl_task, 3881, 2, 10042, 0, 10042, 111, 1, [{20040,20,0}],<<"击退魔君">>, <<"击退魔君">>, [{""}],[{""},{""}],3880, 79, 0, 2, 0, 0, [{0,0,541004201,100000},{0,0,531004201,4000},{0,0,504014204,1}],[],0, 3882, 0};	
get(3882)->
	{tpl_task, 3882, 2, 10042, 0, 10042, 112, 1, [{20041,80,0}],<<"收服迷情">>, <<"收服迷情">>, [{""}],[{""},{""}],3881, 99, 0, 2, 0, 0, [{0,0,541004201,100000},{0,0,531004201,4000},{0,0,504014204,1}],[],0, 3883, 0};	
get(3883)->
	{tpl_task, 3883, 2, 10042, 0, 10042, 112, 1, [{20042,90,0}],<<"斩杀酒妖">>, <<"斩杀酒妖">>, [{""}],[{""},{""}],3882, 99, 0, 2, 0, 0, [{0,0,541004201,100000},{0,0,531004201,4000},{0,0,504014204,1}],[],0, 3884, 0};	
get(3884)->
	{tpl_task, 3884, 2, 10042, 0, 10042, 112, 1, [{20043,10,0}],<<"击杀财魔">>, <<"击杀财魔">>, [{""}],[{""},{""}],3883, 99, 0, 2, 0, 0, [{0,0,541004201,100000},{0,0,531004201,4000},{0,0,504014204,1}],[],0, 3885, 0};	
get(3885)->
	{tpl_task, 3885, 2, 10042, 0, 10042, 112, 1, [{20044,90,0}],<<"教训琴魔">>, <<"教训琴魔">>, [{""}],[{""},{""}],3884, 99, 0, 2, 0, 0, [{0,0,541004201,100000},{0,0,531004201,4000},{0,0,504014204,1}],[],0, 3886, 0};	
get(3886)->
	{tpl_task, 3886, 2, 10042, 0, 10042, 113, 1, [{20045,90,0}],<<"击败雪狼">>, <<"击败雪狼">>, [{""}],[{""},{""}],3885, 99, 0, 2, 0, 0, [{0,0,541004201,100000},{0,0,531004201,4000},{0,0,504014204,1}],[],0, 3887, 0};	
get(3887)->
	{tpl_task, 3887, 2, 10042, 0, 10042, 113, 1, [{20046,50,0}],<<"击退飞马">>, <<"击退飞马">>, [{""}],[{""},{""}],3886, 99, 0, 2, 0, 0, [{0,0,541004201,100000},{0,0,531004201,4000},{0,0,504014204,1}],[],0, 3888, 0};	
get(3888)->
	{tpl_task, 3888, 2, 10042, 0, 10042, 113, 1, [{20047,40,0}],<<"收服祭司">>, <<"收服祭司">>, [{""}],[{""},{""}],3887, 99, 0, 2, 0, 0, [{0,0,541004201,100000},{0,0,531004201,4000},{0,0,504014204,1}],[],0, 3889, 0};	
get(3889)->
	{tpl_task, 3889, 2, 10042, 0, 10042, 113, 1, [{20048,80,0}],<<"斩杀狂魔">>, <<"斩杀狂魔">>, [{""}],[{""},{""}],3888, 99, 0, 2, 0, 0, [{0,0,541004201,100000},{0,0,531004201,4000},{0,0,504014204,1}],[],0, 3890, 0};	
get(3890)->
	{tpl_task, 3890, 2, 10042, 0, 10042, 113, 1, [{20049,90,0}],<<"击杀牛妖">>, <<"击杀牛妖">>, [{""}],[{""},{""}],3889, 99, 0, 2, 0, 0, [{0,0,541004201,100000},{0,0,531004201,4000},{0,0,504014204,1}],[],0, 4149, 0};	
get(4149)->
	{tpl_task, 4149, 2, 10042, 0, 10042, 101, 1, [{20001,50,0}],<<"击杀山精">>, <<"击杀山精">>, [{""}],[{""},{""}],3890, 4, 0, 2, 0, 0, [{0,0,541004201,100000},{0,0,531004201,4000},{0,0,504014204,1}],[],1, 4150, 1};	
get(4150)->
	{tpl_task, 4150, 2, 10042, 0, 10042, 101, 1, [{20003,90,0}],<<"教训树妖">>, <<"教训树妖">>, [{""}],[{""},{""}],4149, 5, 0, 2, 0, 0, [{0,0,541004201,100000},{0,0,531004201,4000},{0,0,504014204,1}],[],2, 4151, 2};	
get(4151)->
	{tpl_task, 4151, 2, 10042, 0, 10042, 104, 1, [{20005,90,0}],<<"击败黑鲛">>, <<"击败黑鲛">>, [{""}],[{""},{""}],4150, 13, 0, 2, 0, 0, [{0,0,541004201,100000},{0,0,531004201,4000},{0,0,504014204,1}],[],3, 4152, 3};	
get(4152)->
	{tpl_task, 4152, 2, 10042, 0, 10042, 104, 1, [{20006,90,0}],<<"击退鲛女">>, <<"击退鲛女">>, [{""}],[{""},{""}],4151, 19, 0, 2, 0, 0, [{0,0,541004201,100000},{0,0,531004201,4000},{0,0,504014204,1}],[],4, 4153, 4};	
get(4153)->
	{tpl_task, 4153, 2, 10042, 0, 10042, 104, 1, [{20053,80,0}],<<"收服巨虾">>, <<"收服巨虾">>, [{""}],[{""},{""}],4152, 22, 0, 2, 0, 0, [{0,0,541004201,100000},{0,0,531004201,4000},{0,0,504014204,1}],[],5, 4154, 5};	
get(4154)->
	{tpl_task, 4154, 2, 10042, 0, 10042, 105, 1, [{20059,100,0}],<<"斩杀妖女">>, <<"斩杀妖女">>, [{""}],[{""},{""}],4153, 27, 0, 2, 0, 0, [{0,0,541004201,100000},{0,0,531004201,4000},{0,0,504014204,1}],[],6, 4155, 6};	
get(4155)->
	{tpl_task, 4155, 2, 10042, 0, 10042, 105, 1, [{20011,80,0}],<<"击杀游魂">>, <<"击杀游魂">>, [{""}],[{""},{""}],4154, 29, 0, 2, 0, 0, [{0,0,541004201,100000},{0,0,531004201,4000},{0,0,504014204,1}],[],7, 4156, 7};	
get(4156)->
	{tpl_task, 4156, 2, 10042, 0, 10042, 105, 1, [{20008,40,0}],<<"教训雪精">>, <<"教训雪精">>, [{""}],[{""},{""}],4155, 31, 0, 2, 0, 0, [{0,0,541004201,100000},{0,0,531004201,4000},{0,0,504014204,1}],[],8, 4157, 8};	
get(4157)->
	{tpl_task, 4157, 2, 10042, 0, 10042, 107, 1, [{20015,50,0}],<<"击败神王">>, <<"击败神王">>, [{""}],[{""},{""}],4156, 32, 0, 2, 0, 0, [{0,0,541004201,100000},{0,0,531004201,4000},{0,0,504014204,1}],[],9, 4158, 9};	
get(4158)->
	{tpl_task, 4158, 2, 10042, 0, 10042, 107, 1, [{20012,30,0}],<<"击退妖兽">>, <<"击退妖兽">>, [{""}],[{""},{""}],4157, 34, 0, 2, 0, 0, [{0,0,541004201,100000},{0,0,531004201,4000},{0,0,504014204,1}],[],10, 4159, 10};	
get(4159)->
	{tpl_task, 4159, 2, 10042, 0, 10042, 107, 1, [{20050,90,0}],<<"收服火岩">>, <<"收服火岩">>, [{""}],[{""},{""}],4158, 35, 0, 2, 0, 0, [{0,0,541004201,100000},{0,0,531004201,4000},{0,0,504014204,1}],[],11, 4160, 11};	
get(4160)->
	{tpl_task, 4160, 2, 10042, 0, 10042, 109, 1, [{20058,20,0}],<<"斩杀花奴">>, <<"斩杀花奴">>, [{""}],[{""},{""}],4159, 36, 0, 2, 0, 0, [{0,0,541004201,100000},{0,0,531004201,4000},{0,0,504014204,1}],[],12, 4161, 12};	
get(4161)->
	{tpl_task, 4161, 2, 10042, 0, 10042, 109, 1, [{20057,30,0}],<<"击杀灵蛙">>, <<"击杀灵蛙">>, [{""}],[{""},{""}],4160, 37, 0, 2, 0, 0, [{0,0,541004201,100000},{0,0,531004201,4000},{0,0,504014204,1}],[],13, 4162, 13};	
get(4162)->
	{tpl_task, 4162, 2, 10042, 0, 10042, 109, 1, [{20063,90,0}],<<"教训白鹿">>, <<"教训白鹿">>, [{""}],[{""},{""}],4161, 38, 0, 2, 0, 0, [{0,0,541004201,100000},{0,0,531004201,4000},{0,0,504014204,1}],[],14, 4163, 14};	
get(4163)->
	{tpl_task, 4163, 2, 10042, 0, 10042, 109, 1, [{20016,70,0}],<<"击败兰灵">>, <<"击败兰灵">>, [{""}],[{""},{""}],4162, 39, 0, 2, 0, 0, [{0,0,541004201,100000},{0,0,531004201,4000},{0,0,504014204,1}],[],15, 4164, 15};	
get(4164)->
	{tpl_task, 4164, 2, 10042, 0, 10042, 106, 1, [{20054,40,0}],<<"击退凤凰">>, <<"击退凤凰">>, [{""}],[{""},{""}],4163, 37, 0, 2, 0, 0, [{0,0,541004201,100000},{0,0,531004201,4000},{0,0,504014204,1}],[],16, 4165, 16};	
get(4165)->
	{tpl_task, 4165, 2, 10042, 0, 10042, 106, 1, [{20017,40,0}],<<"收服蜂鸟">>, <<"收服蜂鸟">>, [{""}],[{""},{""}],4164, 39, 0, 2, 0, 0, [{0,0,541004201,100000},{0,0,531004201,4000},{0,0,504014204,1}],[],17, 4166, 17};	
get(4166)->
	{tpl_task, 4166, 2, 10042, 0, 10042, 106, 1, [{20055,100,0}],<<"斩杀青狼">>, <<"斩杀青狼">>, [{""}],[{""},{""}],4165, 41, 0, 2, 0, 0, [{0,0,541004201,100000},{0,0,531004201,4000},{0,0,504014204,1}],[],18, 4167, 18};	
get(4167)->
	{tpl_task, 4167, 2, 10042, 0, 10042, 108, 1, [{20024,30,0}],<<"击杀魔蝎">>, <<"击杀魔蝎">>, [{""}],[{""},{""}],4166, 42, 0, 2, 0, 0, [{0,0,541004201,100000},{0,0,531004201,4000},{0,0,504014204,1}],[],19, 4168, 19};	
get(4168)->
	{tpl_task, 4168, 2, 10042, 0, 10042, 108, 1, [{20002,50,0}],<<"教训狂豹">>, <<"教训狂豹">>, [{""}],[{""},{""}],4167, 44, 0, 2, 0, 0, [{0,0,541004201,100000},{0,0,531004201,4000},{0,0,504014204,1}],[],20, 4169, 20};	
get(4169)->
	{tpl_task, 4169, 2, 10042, 0, 10042, 108, 1, [{20022,20,0}],<<"击败守卫">>, <<"击败守卫">>, [{""}],[{""},{""}],4168, 46, 0, 2, 0, 0, [{0,0,541004201,100000},{0,0,531004201,4000},{0,0,504014204,1}],[],21, 4170, 21};	
get(4170)->
	{tpl_task, 4170, 2, 10042, 0, 10042, 108, 1, [{20051,100,0}],<<"击退火元">>, <<"击退火元">>, [{""}],[{""},{""}],4169, 48, 0, 2, 0, 0, [{0,0,541004201,100000},{0,0,531004201,4000},{0,0,504014204,1}],[],22, 4171, 22};	
get(4171)->
	{tpl_task, 4171, 2, 10042, 0, 10042, 108, 1, [{20021,60,0}],<<"收服狂龙">>, <<"收服狂龙">>, [{""}],[{""},{""}],4170, 50, 0, 2, 0, 0, [{0,0,541004201,100000},{0,0,531004201,4000},{0,0,504014204,1}],[],23, 4172, 23};	
get(4172)->
	{tpl_task, 4172, 2, 10042, 0, 10042, 110, 1, [{20004,50,0}],<<"斩杀兵士">>, <<"斩杀兵士">>, [{""}],[{""},{""}],4171, 51, 0, 2, 0, 0, [{0,0,541004201,100000},{0,0,531004201,4000},{0,0,504014204,1}],[],24, 4173, 24};	
get(4173)->
	{tpl_task, 4173, 2, 10042, 0, 10042, 110, 1, [{20060,40,0}],<<"击杀鲛人">>, <<"击杀鲛人">>, [{""}],[{""},{""}],4172, 53, 0, 2, 0, 0, [{0,0,541004201,100000},{0,0,531004201,4000},{0,0,504014204,1}],[],25, 4174, 25};	
get(4174)->
	{tpl_task, 4174, 2, 10042, 0, 10042, 110, 1, [{20061,90,0}],<<"教训喽啰">>, <<"教训喽啰">>, [{""}],[{""},{""}],4173, 55, 0, 2, 0, 0, [{0,0,541004201,100000},{0,0,531004201,4000},{0,0,504014204,1}],[],26, 4175, 26};	
get(4175)->
	{tpl_task, 4175, 2, 10042, 0, 10042, 110, 1, [{20062,30,0}],<<"击败金鳝">>, <<"击败金鳝">>, [{""}],[{""},{""}],4174, 57, 0, 2, 0, 0, [{0,0,541004201,100000},{0,0,531004201,4000},{0,0,504014204,1}],[],27, 4176, 27};	
get(4176)->
	{tpl_task, 4176, 2, 10042, 0, 10042, 110, 1, [{20064,70,0}],<<"击退海卫">>, <<"击退海卫">>, [{""}],[{""},{""}],4175, 59, 0, 2, 0, 0, [{0,0,541004201,100000},{0,0,531004201,4000},{0,0,504014204,1}],[],28, 4177, 28};	
get(4177)->
	{tpl_task, 4177, 2, 10042, 0, 10042, 111, 1, [{20036,40,0}],<<"斩杀魔女">>, <<"斩杀魔女">>, [{""}],[{""},{""}],4176, 63, 0, 2, 0, 0, [{0,0,541004201,100000},{0,0,531004201,4000},{0,0,504014204,1}],[],29, 4178, 29};	
get(4178)->
	{tpl_task, 4178, 2, 10042, 0, 10042, 111, 1, [{20037,80,0}],<<"击杀夜叉">>, <<"击杀夜叉">>, [{""}],[{""},{""}],4177, 67, 0, 2, 0, 0, [{0,0,541004201,100000},{0,0,531004201,4000},{0,0,504014204,1}],[],30, 4179, 30};	
get(4179)->
	{tpl_task, 4179, 2, 10042, 0, 10042, 111, 1, [{20038,100,0}],<<"教训魑魅">>, <<"教训魑魅">>, [{""}],[{""},{""}],4178, 71, 0, 2, 0, 0, [{0,0,541004201,100000},{0,0,531004201,4000},{0,0,504014204,1}],[],31, 4180, 31};	
get(4180)->
	{tpl_task, 4180, 2, 10042, 0, 10042, 111, 1, [{20039,90,0}],<<"击败夜魔">>, <<"击败夜魔">>, [{""}],[{""},{""}],4179, 75, 0, 2, 0, 0, [{0,0,541004201,100000},{0,0,531004201,4000},{0,0,504014204,1}],[],32, 4181, 32};	
get(4181)->
	{tpl_task, 4181, 2, 10042, 0, 10042, 111, 1, [{20040,20,0}],<<"击退魔君">>, <<"击退魔君">>, [{""}],[{""},{""}],4180, 79, 0, 2, 0, 0, [{0,0,541004201,100000},{0,0,531004201,4000},{0,0,504014204,1}],[],33, 4182, 33};	
get(4182)->
	{tpl_task, 4182, 2, 10042, 0, 10042, 112, 1, [{20041,80,0}],<<"收服迷情">>, <<"收服迷情">>, [{""}],[{""},{""}],4181, 99, 0, 2, 0, 0, [{0,0,541004201,100000},{0,0,531004201,4000},{0,0,504014204,1}],[],34, 4183, 34};	
get(4183)->
	{tpl_task, 4183, 2, 10042, 0, 10042, 112, 1, [{20042,90,0}],<<"斩杀酒妖">>, <<"斩杀酒妖">>, [{""}],[{""},{""}],4182, 99, 0, 2, 0, 0, [{0,0,541004201,100000},{0,0,531004201,4000},{0,0,504014204,1}],[],35, 4184, 35};	
get(4184)->
	{tpl_task, 4184, 2, 10042, 0, 10042, 112, 1, [{20043,10,0}],<<"击杀财魔">>, <<"击杀财魔">>, [{""}],[{""},{""}],4183, 99, 0, 2, 0, 0, [{0,0,541004201,100000},{0,0,531004201,4000},{0,0,504014204,1}],[],36, 4185, 36};	
get(4185)->
	{tpl_task, 4185, 2, 10042, 0, 10042, 112, 1, [{20044,90,0}],<<"教训琴魔">>, <<"教训琴魔">>, [{""}],[{""},{""}],4184, 99, 0, 2, 0, 0, [{0,0,541004201,100000},{0,0,531004201,4000},{0,0,504014204,1}],[],37, 4186, 37};	
get(4186)->
	{tpl_task, 4186, 2, 10042, 0, 10042, 113, 1, [{20045,90,0}],<<"击败雪狼">>, <<"击败雪狼">>, [{""}],[{""},{""}],4185, 99, 0, 2, 0, 0, [{0,0,541004201,100000},{0,0,531004201,4000},{0,0,504014204,1}],[],38, 4187, 38};	
get(4187)->
	{tpl_task, 4187, 2, 10042, 0, 10042, 113, 1, [{20046,50,0}],<<"击退飞马">>, <<"击退飞马">>, [{""}],[{""},{""}],4186, 99, 0, 2, 0, 0, [{0,0,541004201,100000},{0,0,531004201,4000},{0,0,504014204,1}],[],39, 4188, 39};	
get(4188)->
	{tpl_task, 4188, 2, 10042, 0, 10042, 113, 1, [{20047,40,0}],<<"收服祭司">>, <<"收服祭司">>, [{""}],[{""},{""}],4187, 99, 0, 2, 0, 0, [{0,0,541004201,100000},{0,0,531004201,4000},{0,0,504014204,1}],[],40, 4189, 40};	
get(4189)->
	{tpl_task, 4189, 2, 10042, 0, 10042, 113, 1, [{20048,80,0}],<<"斩杀狂魔">>, <<"斩杀狂魔">>, [{""}],[{""},{""}],4188, 99, 0, 2, 0, 0, [{0,0,541004201,100000},{0,0,531004201,4000},{0,0,504014204,1}],[],41, 4190, 41};	
get(4190)->
	{tpl_task, 4190, 2, 10042, 0, 10042, 113, 1, [{20049,90,0}],<<"击杀牛妖">>, <<"击杀牛妖">>, [{""}],[{""},{""}],4189, 99, 0, 2, 0, 0, [{0,0,541004201,100000},{0,0,531004201,4000},{0,0,504014204,1}],[],42, 0, 42};	
get(_)->	
	[].	
	
get_by_type(0)->	
	 lists:map(fun([TID])->tpl_task:get(TID) end,
	[[1],[2],[3],[4],[5],[6],[7],[8],[9],[10],[11],[12],[13],[14],[15],[16],[17],[18],[19],[20],[21],[22],[23],[24],[25],[26],[27],[28],[29],[30],[31],[32],[33],[34],[35],[36],[37],[38],[39],[40],[41],[42],[43],[44],[45],[46],[47],[48],[49],[50],[51],[52],[53],[54],[55],[56],[57],[58],[59],[60],[61],[62],[63],[64],[65],[66],[67],[68],[69],[70],[71],[72],[73],[74],[75],[76],[77],[78],[79],[80],[81],[82],[83],[84],[85],[86],[87],[88],[89],[90],[91],[92],[93],[94],[95],[96],[97],[98],[99],[100],[101],[102],[103],[104],[105],[106],[107],[108],[109],[110],[111],[112],[113],[114],[115],[116],[117],[118],[119],[120],[121],[122],[123],[124],[125],[126],[127],[128],[129],[130],[131],[132],[133],[134],[135],[136],[137],[138],[139],[140],[141],[142],[143],[144],[145],[146],[147],[148],[149],[150],[151],[152],[153],[154],[155],[156],[157],[158],[159],[160],[161],[162],[163],[164],[165],[166],[167],[168],[169],[170],[171],[172],[173],[174],[175],[176],[177],[178],[179],[180],[181],[182],[183],[184],[185],[186],[187],[188],[189],[190],[191],[192],[193],[194],[195],[196],[197],[198],[199],[200],[201],[202],[203],[204],[205],[206],[207],[208],[209],[210],[211],[212],[213],[214],[215],[216],[217],[218],[219],[220],[221],[222],[223],[224],[225],[226],[227],[228],[229],[230],[231],[232],[233],[234],[235],[236],[237],[238],[239],[240],[241],[242],[243],[244],[245],[246],[247],[248],[249],[250],[251],[252],[253],[254],[255],[256],[257],[258],[259],[260],[261],[262],[263],[264],[265],[266],[267],[268],[269],[270],[271],[272],[273],[274],[275],[276],[277],[278],[279],[280],[281],[282],[283],[284],[285],[286],[287],[288],[289],[290],[291],[292],[293],[294],[295],[296],[297],[298],[299],[300],[301],[302],[303],[304],[305],[306],[307],[308],[309],[310],[311],[312],[313],[314],[315],[316],[317],[318],[319],[320],[321],[322]]);	
	
get_by_type(9)->	
	 lists:map(fun([TID])->tpl_task:get(TID) end,
	[[2049],[2050],[2051],[2052],[2053],[2054],[2055],[2056],[2057],[2058],[2059],[2060],[2061],[2062],[2063],[2064],[2065],[2066],[2067],[2068],[2069],[2070],[2071],[2072],[2073],[2074],[2075],[2076],[2077],[2078],[2079],[2080],[2081],[2082],[2083],[2084],[2085],[2086],[2087],[2088],[2089],[2090]]);	
	
get_by_type(4)->	
	 lists:map(fun([TID])->tpl_task:get(TID) end,
	[[2349],[2350],[2351],[2352],[2353],[2354],[2355],[2356],[2357],[2358],[2359],[2360],[2361],[2362],[2363],[2364],[2365],[2366],[2367],[2368],[2369],[2370],[2371],[2372],[2373],[2374],[2375],[2376],[2377],[2378],[2379],[2380],[2381],[2382],[2383],[2384],[2385],[2386],[2387],[2388],[2389],[2390]]);	
	
get_by_type(5)->	
	 lists:map(fun([TID])->tpl_task:get(TID) end,
	[[2649],[2650],[2651],[2652],[2653],[2654],[2655],[2656],[2657],[2658],[2659],[2660],[2661],[2662],[2663],[2664],[2665],[2666],[2667],[2668],[2669],[2670],[2671],[2672],[2673],[2674],[2675],[2676],[2677],[2678],[2679],[2680],[2681],[2682],[2683],[2684],[2685],[2686],[2687],[2688],[2689],[2690]]);	
	
get_by_type(6)->	
	 lists:map(fun([TID])->tpl_task:get(TID) end,
	[[2949],[2950],[2951],[2952],[2953],[2954],[2955],[2956],[2957],[2958],[2959],[2960],[2961],[2962],[2963],[2964],[2965],[2966],[2967],[2968],[2969],[2970],[2971],[2972],[2973],[2974],[2975],[2976],[2977],[2978],[2979],[2980],[2981],[2982],[2983],[2984],[2985],[2986],[2987],[2988],[2989],[2990]]);	
	
get_by_type(7)->	
	 lists:map(fun([TID])->tpl_task:get(TID) end,
	[[3249],[3250],[3251],[3252],[3253],[3254],[3255],[3256],[3257],[3258],[3259],[3260],[3261],[3262],[3263],[3264],[3265],[3266],[3267],[3268],[3269],[3270],[3271],[3272],[3273],[3274],[3275],[3276],[3277],[3278],[3279],[3280],[3281],[3282],[3283],[3284],[3285],[3286],[3287],[3288],[3289],[3290]]);	
	
get_by_type(8)->	
	 lists:map(fun([TID])->tpl_task:get(TID) end,
	[[3549],[3550],[3551],[3552],[3553],[3554],[3555],[3556],[3557],[3558],[3559],[3560],[3561],[3562],[3563],[3564],[3565],[3566],[3567],[3568],[3569],[3570],[3571],[3572],[3573],[3574],[3575],[3576],[3577],[3578],[3579],[3580],[3581],[3582],[3583],[3584],[3585],[3586],[3587],[3588],[3589],[3590]]);	
	
get_by_type(2)->	
	 lists:map(fun([TID])->tpl_task:get(TID) end,
	[[3849],[3850],[3851],[3852],[3853],[3854],[3855],[3856],[3857],[3858],[3859],[3860],[3861],[3862],[3863],[3864],[3865],[3866],[3867],[3868],[3869],[3870],[3871],[3872],[3873],[3874],[3875],[3876],[3877],[3878],[3879],[3880],[3881],[3882],[3883],[3884],[3885],[3886],[3887],[3888],[3889],[3890],[4149],[4150],[4151],[4152],[4153],[4154],[4155],[4156],[4157],[4158],[4159],[4160],[4161],[4162],[4163],[4164],[4165],[4166],[4167],[4168],[4169],[4170],[4171],[4172],[4173],[4174],[4175],[4176],[4177],[4178],[4179],[4180],[4181],[4182],[4183],[4184],[4185],[4186],[4187],[4188],[4189],[4190]]);	
	
get_by_type(_)->	
 [].	
	
get_by_type_level(0,1)->	
	 lists:map(fun([TID])->tpl_task:get(TID) end,
	[[1]]);	
	
get_by_type_level(0,2)->	
	 lists:map(fun([TID])->tpl_task:get(TID) end,
	[[2]]);	
	
get_by_type_level(0,3)->	
	 lists:map(fun([TID])->tpl_task:get(TID) end,
	[[3]]);	
	
get_by_type_level(0,4)->	
	 lists:map(fun([TID])->tpl_task:get(TID) end,
	[[4],[5]]);	
	
get_by_type_level(0,5)->	
	 lists:map(fun([TID])->tpl_task:get(TID) end,
	[[6],[7]]);	
	
get_by_type_level(0,6)->	
	 lists:map(fun([TID])->tpl_task:get(TID) end,
	[[8]]);	
	
get_by_type_level(0,7)->	
	 lists:map(fun([TID])->tpl_task:get(TID) end,
	[[9]]);	
	
get_by_type_level(0,8)->	
	 lists:map(fun([TID])->tpl_task:get(TID) end,
	[[10]]);	
	
get_by_type_level(0,10)->	
	 lists:map(fun([TID])->tpl_task:get(TID) end,
	[[11]]);	
	
get_by_type_level(0,11)->	
	 lists:map(fun([TID])->tpl_task:get(TID) end,
	[[12]]);	
	
get_by_type_level(0,12)->	
	 lists:map(fun([TID])->tpl_task:get(TID) end,
	[[13]]);	
	
get_by_type_level(0,13)->	
	 lists:map(fun([TID])->tpl_task:get(TID) end,
	[[14],[15]]);	
	
get_by_type_level(0,14)->	
	 lists:map(fun([TID])->tpl_task:get(TID) end,
	[[16],[17]]);	
	
get_by_type_level(0,15)->	
	 lists:map(fun([TID])->tpl_task:get(TID) end,
	[[18],[19]]);	
	
get_by_type_level(0,16)->	
	 lists:map(fun([TID])->tpl_task:get(TID) end,
	[[20],[21]]);	
	
get_by_type_level(0,17)->	
	 lists:map(fun([TID])->tpl_task:get(TID) end,
	[[22]]);	
	
get_by_type_level(0,18)->	
	 lists:map(fun([TID])->tpl_task:get(TID) end,
	[[23],[24]]);	
	
get_by_type_level(0,19)->	
	 lists:map(fun([TID])->tpl_task:get(TID) end,
	[[25],[26]]);	
	
get_by_type_level(0,20)->	
	 lists:map(fun([TID])->tpl_task:get(TID) end,
	[[27]]);	
	
get_by_type_level(0,21)->	
	 lists:map(fun([TID])->tpl_task:get(TID) end,
	[[28]]);	
	
get_by_type_level(0,22)->	
	 lists:map(fun([TID])->tpl_task:get(TID) end,
	[[29]]);	
	
get_by_type_level(0,23)->	
	 lists:map(fun([TID])->tpl_task:get(TID) end,
	[[30],[31]]);	
	
get_by_type_level(0,24)->	
	 lists:map(fun([TID])->tpl_task:get(TID) end,
	[[32],[33]]);	
	
get_by_type_level(0,25)->	
	 lists:map(fun([TID])->tpl_task:get(TID) end,
	[[34],[35],[36]]);	
	
get_by_type_level(0,26)->	
	 lists:map(fun([TID])->tpl_task:get(TID) end,
	[[37],[38],[39]]);	
	
get_by_type_level(0,27)->	
	 lists:map(fun([TID])->tpl_task:get(TID) end,
	[[40],[41],[42]]);	
	
get_by_type_level(0,28)->	
	 lists:map(fun([TID])->tpl_task:get(TID) end,
	[[43],[44],[45]]);	
	
get_by_type_level(0,29)->	
	 lists:map(fun([TID])->tpl_task:get(TID) end,
	[[46],[47],[48]]);	
	
get_by_type_level(0,30)->	
	 lists:map(fun([TID])->tpl_task:get(TID) end,
	[[49],[50],[51],[52]]);	
	
get_by_type_level(0,31)->	
	 lists:map(fun([TID])->tpl_task:get(TID) end,
	[[53],[54],[55],[56],[57]]);	
	
get_by_type_level(0,32)->	
	 lists:map(fun([TID])->tpl_task:get(TID) end,
	[[58],[59],[60],[61],[62],[63]]);	
	
get_by_type_level(0,33)->	
	 lists:map(fun([TID])->tpl_task:get(TID) end,
	[[64],[65],[66],[67],[68],[69]]);	
	
get_by_type_level(0,34)->	
	 lists:map(fun([TID])->tpl_task:get(TID) end,
	[[70],[71],[72],[73],[74],[75],[76],[77]]);	
	
get_by_type_level(0,35)->	
	 lists:map(fun([TID])->tpl_task:get(TID) end,
	[[78],[79],[80],[81],[82],[83],[84],[85]]);	
	
get_by_type_level(0,36)->	
	 lists:map(fun([TID])->tpl_task:get(TID) end,
	[[86],[87],[88],[89],[90],[91],[92],[93],[94]]);	
	
get_by_type_level(0,37)->	
	 lists:map(fun([TID])->tpl_task:get(TID) end,
	[[95],[96],[97],[98],[99],[100],[101],[102],[103]]);	
	
get_by_type_level(0,38)->	
	 lists:map(fun([TID])->tpl_task:get(TID) end,
	[[104],[105],[106],[107],[108],[109],[110],[111],[112]]);	
	
get_by_type_level(0,39)->	
	 lists:map(fun([TID])->tpl_task:get(TID) end,
	[[113],[114],[115],[116],[117],[118],[119],[120],[121]]);	
	
get_by_type_level(0,40)->	
	 lists:map(fun([TID])->tpl_task:get(TID) end,
	[[122],[123],[124],[125],[126],[127],[128],[129],[130],[131]]);	
	
get_by_type_level(0,41)->	
	 lists:map(fun([TID])->tpl_task:get(TID) end,
	[[132],[133],[134],[135],[136],[137],[138],[139],[140],[141]]);	
	
get_by_type_level(0,42)->	
	 lists:map(fun([TID])->tpl_task:get(TID) end,
	[[142],[143],[144],[145],[146],[147],[148],[149],[150],[151]]);	
	
get_by_type_level(0,43)->	
	 lists:map(fun([TID])->tpl_task:get(TID) end,
	[[152],[153],[154],[155],[156],[157],[158],[159],[160],[161]]);	
	
get_by_type_level(0,44)->	
	 lists:map(fun([TID])->tpl_task:get(TID) end,
	[[162],[163],[164],[165],[166],[167],[168],[169],[170],[171]]);	
	
get_by_type_level(0,45)->	
	 lists:map(fun([TID])->tpl_task:get(TID) end,
	[[172],[173],[174],[175],[176],[177],[178],[179],[180],[181]]);	
	
get_by_type_level(0,46)->	
	 lists:map(fun([TID])->tpl_task:get(TID) end,
	[[182],[183],[184],[185],[186],[187],[188],[189],[190],[191]]);	
	
get_by_type_level(0,47)->	
	 lists:map(fun([TID])->tpl_task:get(TID) end,
	[[192],[193],[194],[195],[196],[197],[198],[199],[200],[201]]);	
	
get_by_type_level(0,48)->	
	 lists:map(fun([TID])->tpl_task:get(TID) end,
	[[202],[203],[204],[205],[206],[207],[208],[209],[210],[211]]);	
	
get_by_type_level(0,49)->	
	 lists:map(fun([TID])->tpl_task:get(TID) end,
	[[212],[213],[214],[215],[216],[217],[218],[219],[220],[221]]);	
	
get_by_type_level(0,50)->	
	 lists:map(fun([TID])->tpl_task:get(TID) end,
	[[222],[223],[224],[225],[226],[227],[228],[229],[230],[231]]);	
	
get_by_type_level(0,51)->	
	 lists:map(fun([TID])->tpl_task:get(TID) end,
	[[232],[233],[234],[235],[236],[237],[238],[239],[240],[241]]);	
	
get_by_type_level(0,52)->	
	 lists:map(fun([TID])->tpl_task:get(TID) end,
	[[242],[243],[244],[245],[246],[247],[248],[249],[250],[251]]);	
	
get_by_type_level(0,53)->	
	 lists:map(fun([TID])->tpl_task:get(TID) end,
	[[252],[253],[254],[255],[256],[257],[258],[259],[260],[261]]);	
	
get_by_type_level(0,54)->	
	 lists:map(fun([TID])->tpl_task:get(TID) end,
	[[262],[263],[264],[265],[266],[267],[268],[269],[270],[271]]);	
	
get_by_type_level(0,55)->	
	 lists:map(fun([TID])->tpl_task:get(TID) end,
	[[272],[273],[274],[275],[276],[277],[278],[279],[280],[281]]);	
	
get_by_type_level(0,56)->	
	 lists:map(fun([TID])->tpl_task:get(TID) end,
	[[282],[283],[284],[285],[286],[287],[288],[289],[290],[291]]);	
	
get_by_type_level(0,57)->	
	 lists:map(fun([TID])->tpl_task:get(TID) end,
	[[292],[293],[294],[295],[296],[297],[298],[299],[300],[301]]);	
	
get_by_type_level(0,58)->	
	 lists:map(fun([TID])->tpl_task:get(TID) end,
	[[302],[303],[304],[305],[306],[307],[308],[309],[310],[311]]);	
	
get_by_type_level(0,59)->	
	 lists:map(fun([TID])->tpl_task:get(TID) end,
	[[312],[313],[314],[315],[316],[317],[318],[319],[320],[321]]);	
	
get_by_type_level(0,60)->	
	 lists:map(fun([TID])->tpl_task:get(TID) end,
	[[322]]);	
	
get_by_type_level(9,36)->	
	 lists:map(fun([TID])->tpl_task:get(TID) end,
	[[2049],[2050],[2051],[2052],[2053],[2054],[2055],[2056],[2057],[2058],[2059],[2060]]);	
	
get_by_type_level(9,37)->	
	 lists:map(fun([TID])->tpl_task:get(TID) end,
	[[2061],[2064]]);	
	
get_by_type_level(9,38)->	
	 lists:map(fun([TID])->tpl_task:get(TID) end,
	[[2062]]);	
	
get_by_type_level(9,39)->	
	 lists:map(fun([TID])->tpl_task:get(TID) end,
	[[2063],[2065]]);	
	
get_by_type_level(9,41)->	
	 lists:map(fun([TID])->tpl_task:get(TID) end,
	[[2066]]);	
	
get_by_type_level(9,42)->	
	 lists:map(fun([TID])->tpl_task:get(TID) end,
	[[2067]]);	
	
get_by_type_level(9,44)->	
	 lists:map(fun([TID])->tpl_task:get(TID) end,
	[[2068]]);	
	
get_by_type_level(9,46)->	
	 lists:map(fun([TID])->tpl_task:get(TID) end,
	[[2069]]);	
	
get_by_type_level(9,48)->	
	 lists:map(fun([TID])->tpl_task:get(TID) end,
	[[2070]]);	
	
get_by_type_level(9,50)->	
	 lists:map(fun([TID])->tpl_task:get(TID) end,
	[[2071]]);	
	
get_by_type_level(9,51)->	
	 lists:map(fun([TID])->tpl_task:get(TID) end,
	[[2072]]);	
	
get_by_type_level(9,53)->	
	 lists:map(fun([TID])->tpl_task:get(TID) end,
	[[2073]]);	
	
get_by_type_level(9,55)->	
	 lists:map(fun([TID])->tpl_task:get(TID) end,
	[[2074]]);	
	
get_by_type_level(9,57)->	
	 lists:map(fun([TID])->tpl_task:get(TID) end,
	[[2075]]);	
	
get_by_type_level(9,59)->	
	 lists:map(fun([TID])->tpl_task:get(TID) end,
	[[2076]]);	
	
get_by_type_level(9,63)->	
	 lists:map(fun([TID])->tpl_task:get(TID) end,
	[[2077]]);	
	
get_by_type_level(9,67)->	
	 lists:map(fun([TID])->tpl_task:get(TID) end,
	[[2078]]);	
	
get_by_type_level(9,71)->	
	 lists:map(fun([TID])->tpl_task:get(TID) end,
	[[2079]]);	
	
get_by_type_level(9,75)->	
	 lists:map(fun([TID])->tpl_task:get(TID) end,
	[[2080]]);	
	
get_by_type_level(9,79)->	
	 lists:map(fun([TID])->tpl_task:get(TID) end,
	[[2081]]);	
	
get_by_type_level(9,99)->	
	 lists:map(fun([TID])->tpl_task:get(TID) end,
	[[2082],[2083],[2084],[2085],[2086],[2087],[2088],[2089],[2090]]);	
	
get_by_type_level(4,37)->	
	 lists:map(fun([TID])->tpl_task:get(TID) end,
	[[2349],[2350],[2351],[2352],[2353],[2354],[2355],[2356],[2357],[2358],[2359],[2360],[2361],[2364]]);	
	
get_by_type_level(4,38)->	
	 lists:map(fun([TID])->tpl_task:get(TID) end,
	[[2362]]);	
	
get_by_type_level(4,39)->	
	 lists:map(fun([TID])->tpl_task:get(TID) end,
	[[2363],[2365]]);	
	
get_by_type_level(4,41)->	
	 lists:map(fun([TID])->tpl_task:get(TID) end,
	[[2366]]);	
	
get_by_type_level(4,42)->	
	 lists:map(fun([TID])->tpl_task:get(TID) end,
	[[2367]]);	
	
get_by_type_level(4,44)->	
	 lists:map(fun([TID])->tpl_task:get(TID) end,
	[[2368]]);	
	
get_by_type_level(4,46)->	
	 lists:map(fun([TID])->tpl_task:get(TID) end,
	[[2369]]);	
	
get_by_type_level(4,48)->	
	 lists:map(fun([TID])->tpl_task:get(TID) end,
	[[2370]]);	
	
get_by_type_level(4,50)->	
	 lists:map(fun([TID])->tpl_task:get(TID) end,
	[[2371]]);	
	
get_by_type_level(4,51)->	
	 lists:map(fun([TID])->tpl_task:get(TID) end,
	[[2372]]);	
	
get_by_type_level(4,53)->	
	 lists:map(fun([TID])->tpl_task:get(TID) end,
	[[2373]]);	
	
get_by_type_level(4,55)->	
	 lists:map(fun([TID])->tpl_task:get(TID) end,
	[[2374]]);	
	
get_by_type_level(4,57)->	
	 lists:map(fun([TID])->tpl_task:get(TID) end,
	[[2375]]);	
	
get_by_type_level(4,59)->	
	 lists:map(fun([TID])->tpl_task:get(TID) end,
	[[2376]]);	
	
get_by_type_level(4,63)->	
	 lists:map(fun([TID])->tpl_task:get(TID) end,
	[[2377]]);	
	
get_by_type_level(4,67)->	
	 lists:map(fun([TID])->tpl_task:get(TID) end,
	[[2378]]);	
	
get_by_type_level(4,71)->	
	 lists:map(fun([TID])->tpl_task:get(TID) end,
	[[2379]]);	
	
get_by_type_level(4,75)->	
	 lists:map(fun([TID])->tpl_task:get(TID) end,
	[[2380]]);	
	
get_by_type_level(4,79)->	
	 lists:map(fun([TID])->tpl_task:get(TID) end,
	[[2381]]);	
	
get_by_type_level(4,99)->	
	 lists:map(fun([TID])->tpl_task:get(TID) end,
	[[2382],[2383],[2384],[2385],[2386],[2387],[2388],[2389],[2390]]);	
	
get_by_type_level(5,34)->	
	 lists:map(fun([TID])->tpl_task:get(TID) end,
	[[2649],[2650],[2651],[2652],[2653],[2654],[2655],[2656],[2657],[2658]]);	
	
get_by_type_level(5,35)->	
	 lists:map(fun([TID])->tpl_task:get(TID) end,
	[[2659]]);	
	
get_by_type_level(5,36)->	
	 lists:map(fun([TID])->tpl_task:get(TID) end,
	[[2660]]);	
	
get_by_type_level(5,37)->	
	 lists:map(fun([TID])->tpl_task:get(TID) end,
	[[2661],[2664]]);	
	
get_by_type_level(5,38)->	
	 lists:map(fun([TID])->tpl_task:get(TID) end,
	[[2662]]);	
	
get_by_type_level(5,39)->	
	 lists:map(fun([TID])->tpl_task:get(TID) end,
	[[2663],[2665]]);	
	
get_by_type_level(5,41)->	
	 lists:map(fun([TID])->tpl_task:get(TID) end,
	[[2666]]);	
	
get_by_type_level(5,42)->	
	 lists:map(fun([TID])->tpl_task:get(TID) end,
	[[2667]]);	
	
get_by_type_level(5,44)->	
	 lists:map(fun([TID])->tpl_task:get(TID) end,
	[[2668]]);	
	
get_by_type_level(5,46)->	
	 lists:map(fun([TID])->tpl_task:get(TID) end,
	[[2669]]);	
	
get_by_type_level(5,48)->	
	 lists:map(fun([TID])->tpl_task:get(TID) end,
	[[2670]]);	
	
get_by_type_level(5,50)->	
	 lists:map(fun([TID])->tpl_task:get(TID) end,
	[[2671]]);	
	
get_by_type_level(5,51)->	
	 lists:map(fun([TID])->tpl_task:get(TID) end,
	[[2672]]);	
	
get_by_type_level(5,53)->	
	 lists:map(fun([TID])->tpl_task:get(TID) end,
	[[2673]]);	
	
get_by_type_level(5,55)->	
	 lists:map(fun([TID])->tpl_task:get(TID) end,
	[[2674]]);	
	
get_by_type_level(5,57)->	
	 lists:map(fun([TID])->tpl_task:get(TID) end,
	[[2675]]);	
	
get_by_type_level(5,59)->	
	 lists:map(fun([TID])->tpl_task:get(TID) end,
	[[2676]]);	
	
get_by_type_level(5,63)->	
	 lists:map(fun([TID])->tpl_task:get(TID) end,
	[[2677]]);	
	
get_by_type_level(5,67)->	
	 lists:map(fun([TID])->tpl_task:get(TID) end,
	[[2678]]);	
	
get_by_type_level(5,71)->	
	 lists:map(fun([TID])->tpl_task:get(TID) end,
	[[2679]]);	
	
get_by_type_level(5,75)->	
	 lists:map(fun([TID])->tpl_task:get(TID) end,
	[[2680]]);	
	
get_by_type_level(5,79)->	
	 lists:map(fun([TID])->tpl_task:get(TID) end,
	[[2681]]);	
	
get_by_type_level(5,99)->	
	 lists:map(fun([TID])->tpl_task:get(TID) end,
	[[2682],[2683],[2684],[2685],[2686],[2687],[2688],[2689],[2690]]);	
	
get_by_type_level(6,33)->	
	 lists:map(fun([TID])->tpl_task:get(TID) end,
	[[2949],[2950],[2951],[2952],[2953],[2954],[2955],[2956],[2957]]);	
	
get_by_type_level(6,34)->	
	 lists:map(fun([TID])->tpl_task:get(TID) end,
	[[2958]]);	
	
get_by_type_level(6,35)->	
	 lists:map(fun([TID])->tpl_task:get(TID) end,
	[[2959]]);	
	
get_by_type_level(6,36)->	
	 lists:map(fun([TID])->tpl_task:get(TID) end,
	[[2960]]);	
	
get_by_type_level(6,37)->	
	 lists:map(fun([TID])->tpl_task:get(TID) end,
	[[2961],[2964]]);	
	
get_by_type_level(6,38)->	
	 lists:map(fun([TID])->tpl_task:get(TID) end,
	[[2962]]);	
	
get_by_type_level(6,39)->	
	 lists:map(fun([TID])->tpl_task:get(TID) end,
	[[2963],[2965]]);	
	
get_by_type_level(6,41)->	
	 lists:map(fun([TID])->tpl_task:get(TID) end,
	[[2966]]);	
	
get_by_type_level(6,42)->	
	 lists:map(fun([TID])->tpl_task:get(TID) end,
	[[2967]]);	
	
get_by_type_level(6,44)->	
	 lists:map(fun([TID])->tpl_task:get(TID) end,
	[[2968]]);	
	
get_by_type_level(6,46)->	
	 lists:map(fun([TID])->tpl_task:get(TID) end,
	[[2969]]);	
	
get_by_type_level(6,48)->	
	 lists:map(fun([TID])->tpl_task:get(TID) end,
	[[2970]]);	
	
get_by_type_level(6,50)->	
	 lists:map(fun([TID])->tpl_task:get(TID) end,
	[[2971]]);	
	
get_by_type_level(6,51)->	
	 lists:map(fun([TID])->tpl_task:get(TID) end,
	[[2972]]);	
	
get_by_type_level(6,53)->	
	 lists:map(fun([TID])->tpl_task:get(TID) end,
	[[2973]]);	
	
get_by_type_level(6,55)->	
	 lists:map(fun([TID])->tpl_task:get(TID) end,
	[[2974]]);	
	
get_by_type_level(6,57)->	
	 lists:map(fun([TID])->tpl_task:get(TID) end,
	[[2975]]);	
	
get_by_type_level(6,59)->	
	 lists:map(fun([TID])->tpl_task:get(TID) end,
	[[2976]]);	
	
get_by_type_level(6,63)->	
	 lists:map(fun([TID])->tpl_task:get(TID) end,
	[[2977]]);	
	
get_by_type_level(6,67)->	
	 lists:map(fun([TID])->tpl_task:get(TID) end,
	[[2978]]);	
	
get_by_type_level(6,71)->	
	 lists:map(fun([TID])->tpl_task:get(TID) end,
	[[2979]]);	
	
get_by_type_level(6,75)->	
	 lists:map(fun([TID])->tpl_task:get(TID) end,
	[[2980]]);	
	
get_by_type_level(6,79)->	
	 lists:map(fun([TID])->tpl_task:get(TID) end,
	[[2981]]);	
	
get_by_type_level(6,99)->	
	 lists:map(fun([TID])->tpl_task:get(TID) end,
	[[2982],[2983],[2984],[2985],[2986],[2987],[2988],[2989],[2990]]);	
	
get_by_type_level(7,35)->	
	 lists:map(fun([TID])->tpl_task:get(TID) end,
	[[3249],[3250],[3251],[3252],[3253],[3254],[3255],[3256],[3257],[3258],[3259]]);	
	
get_by_type_level(7,36)->	
	 lists:map(fun([TID])->tpl_task:get(TID) end,
	[[3260]]);	
	
get_by_type_level(7,37)->	
	 lists:map(fun([TID])->tpl_task:get(TID) end,
	[[3261],[3264]]);	
	
get_by_type_level(7,38)->	
	 lists:map(fun([TID])->tpl_task:get(TID) end,
	[[3262]]);	
	
get_by_type_level(7,39)->	
	 lists:map(fun([TID])->tpl_task:get(TID) end,
	[[3263],[3265]]);	
	
get_by_type_level(7,41)->	
	 lists:map(fun([TID])->tpl_task:get(TID) end,
	[[3266]]);	
	
get_by_type_level(7,42)->	
	 lists:map(fun([TID])->tpl_task:get(TID) end,
	[[3267]]);	
	
get_by_type_level(7,44)->	
	 lists:map(fun([TID])->tpl_task:get(TID) end,
	[[3268]]);	
	
get_by_type_level(7,46)->	
	 lists:map(fun([TID])->tpl_task:get(TID) end,
	[[3269]]);	
	
get_by_type_level(7,48)->	
	 lists:map(fun([TID])->tpl_task:get(TID) end,
	[[3270]]);	
	
get_by_type_level(7,50)->	
	 lists:map(fun([TID])->tpl_task:get(TID) end,
	[[3271]]);	
	
get_by_type_level(7,51)->	
	 lists:map(fun([TID])->tpl_task:get(TID) end,
	[[3272]]);	
	
get_by_type_level(7,53)->	
	 lists:map(fun([TID])->tpl_task:get(TID) end,
	[[3273]]);	
	
get_by_type_level(7,55)->	
	 lists:map(fun([TID])->tpl_task:get(TID) end,
	[[3274]]);	
	
get_by_type_level(7,57)->	
	 lists:map(fun([TID])->tpl_task:get(TID) end,
	[[3275]]);	
	
get_by_type_level(7,59)->	
	 lists:map(fun([TID])->tpl_task:get(TID) end,
	[[3276]]);	
	
get_by_type_level(7,63)->	
	 lists:map(fun([TID])->tpl_task:get(TID) end,
	[[3277]]);	
	
get_by_type_level(7,67)->	
	 lists:map(fun([TID])->tpl_task:get(TID) end,
	[[3278]]);	
	
get_by_type_level(7,71)->	
	 lists:map(fun([TID])->tpl_task:get(TID) end,
	[[3279]]);	
	
get_by_type_level(7,75)->	
	 lists:map(fun([TID])->tpl_task:get(TID) end,
	[[3280]]);	
	
get_by_type_level(7,79)->	
	 lists:map(fun([TID])->tpl_task:get(TID) end,
	[[3281]]);	
	
get_by_type_level(7,99)->	
	 lists:map(fun([TID])->tpl_task:get(TID) end,
	[[3282],[3283],[3284],[3285],[3286],[3287],[3288],[3289],[3290]]);	
	
get_by_type_level(8,40)->	
	 lists:map(fun([TID])->tpl_task:get(TID) end,
	[[3549],[3550],[3551],[3552],[3553],[3554],[3555],[3556],[3557],[3558],[3559],[3560],[3561],[3562],[3563],[3564],[3565]]);	
	
get_by_type_level(8,41)->	
	 lists:map(fun([TID])->tpl_task:get(TID) end,
	[[3566]]);	
	
get_by_type_level(8,42)->	
	 lists:map(fun([TID])->tpl_task:get(TID) end,
	[[3567]]);	
	
get_by_type_level(8,44)->	
	 lists:map(fun([TID])->tpl_task:get(TID) end,
	[[3568]]);	
	
get_by_type_level(8,46)->	
	 lists:map(fun([TID])->tpl_task:get(TID) end,
	[[3569]]);	
	
get_by_type_level(8,48)->	
	 lists:map(fun([TID])->tpl_task:get(TID) end,
	[[3570]]);	
	
get_by_type_level(8,50)->	
	 lists:map(fun([TID])->tpl_task:get(TID) end,
	[[3571]]);	
	
get_by_type_level(8,51)->	
	 lists:map(fun([TID])->tpl_task:get(TID) end,
	[[3572]]);	
	
get_by_type_level(8,53)->	
	 lists:map(fun([TID])->tpl_task:get(TID) end,
	[[3573]]);	
	
get_by_type_level(8,55)->	
	 lists:map(fun([TID])->tpl_task:get(TID) end,
	[[3574]]);	
	
get_by_type_level(8,57)->	
	 lists:map(fun([TID])->tpl_task:get(TID) end,
	[[3575]]);	
	
get_by_type_level(8,59)->	
	 lists:map(fun([TID])->tpl_task:get(TID) end,
	[[3576]]);	
	
get_by_type_level(8,63)->	
	 lists:map(fun([TID])->tpl_task:get(TID) end,
	[[3577]]);	
	
get_by_type_level(8,67)->	
	 lists:map(fun([TID])->tpl_task:get(TID) end,
	[[3578]]);	
	
get_by_type_level(8,71)->	
	 lists:map(fun([TID])->tpl_task:get(TID) end,
	[[3579]]);	
	
get_by_type_level(8,75)->	
	 lists:map(fun([TID])->tpl_task:get(TID) end,
	[[3580]]);	
	
get_by_type_level(8,79)->	
	 lists:map(fun([TID])->tpl_task:get(TID) end,
	[[3581]]);	
	
get_by_type_level(8,99)->	
	 lists:map(fun([TID])->tpl_task:get(TID) end,
	[[3582],[3583],[3584],[3585],[3586],[3587],[3588],[3589],[3590]]);	
	
get_by_type_level(2,38)->	
	 lists:map(fun([TID])->tpl_task:get(TID) end,
	[[3849],[3850],[3851],[3852],[3853],[3854],[3855],[3856],[3857],[3858],[3859],[3860],[3861],[3862],[3863],[3864],[4162]]);	
	
get_by_type_level(2,39)->	
	 lists:map(fun([TID])->tpl_task:get(TID) end,
	[[3865],[4163],[4165]]);	
	
get_by_type_level(2,41)->	
	 lists:map(fun([TID])->tpl_task:get(TID) end,
	[[3866],[4166]]);	
	
get_by_type_level(2,42)->	
	 lists:map(fun([TID])->tpl_task:get(TID) end,
	[[3867],[4167]]);	
	
get_by_type_level(2,44)->	
	 lists:map(fun([TID])->tpl_task:get(TID) end,
	[[3868],[4168]]);	
	
get_by_type_level(2,46)->	
	 lists:map(fun([TID])->tpl_task:get(TID) end,
	[[3869],[4169]]);	
	
get_by_type_level(2,48)->	
	 lists:map(fun([TID])->tpl_task:get(TID) end,
	[[3870],[4170]]);	
	
get_by_type_level(2,50)->	
	 lists:map(fun([TID])->tpl_task:get(TID) end,
	[[3871],[4171]]);	
	
get_by_type_level(2,51)->	
	 lists:map(fun([TID])->tpl_task:get(TID) end,
	[[3872],[4172]]);	
	
get_by_type_level(2,53)->	
	 lists:map(fun([TID])->tpl_task:get(TID) end,
	[[3873],[4173]]);	
	
get_by_type_level(2,55)->	
	 lists:map(fun([TID])->tpl_task:get(TID) end,
	[[3874],[4174]]);	
	
get_by_type_level(2,57)->	
	 lists:map(fun([TID])->tpl_task:get(TID) end,
	[[3875],[4175]]);	
	
get_by_type_level(2,59)->	
	 lists:map(fun([TID])->tpl_task:get(TID) end,
	[[3876],[4176]]);	
	
get_by_type_level(2,63)->	
	 lists:map(fun([TID])->tpl_task:get(TID) end,
	[[3877],[4177]]);	
	
get_by_type_level(2,67)->	
	 lists:map(fun([TID])->tpl_task:get(TID) end,
	[[3878],[4178]]);	
	
get_by_type_level(2,71)->	
	 lists:map(fun([TID])->tpl_task:get(TID) end,
	[[3879],[4179]]);	
	
get_by_type_level(2,75)->	
	 lists:map(fun([TID])->tpl_task:get(TID) end,
	[[3880],[4180]]);	
	
get_by_type_level(2,79)->	
	 lists:map(fun([TID])->tpl_task:get(TID) end,
	[[3881],[4181]]);	
	
get_by_type_level(2,99)->	
	 lists:map(fun([TID])->tpl_task:get(TID) end,
	[[3882],[3883],[3884],[3885],[3886],[3887],[3888],[3889],[3890],[4182],[4183],[4184],[4185],[4186],[4187],[4188],[4189],[4190]]);	
	
get_by_type_level(2,4)->	
	 lists:map(fun([TID])->tpl_task:get(TID) end,
	[[4149]]);	
	
get_by_type_level(2,5)->	
	 lists:map(fun([TID])->tpl_task:get(TID) end,
	[[4150]]);	
	
get_by_type_level(2,13)->	
	 lists:map(fun([TID])->tpl_task:get(TID) end,
	[[4151]]);	
	
get_by_type_level(2,19)->	
	 lists:map(fun([TID])->tpl_task:get(TID) end,
	[[4152]]);	
	
get_by_type_level(2,22)->	
	 lists:map(fun([TID])->tpl_task:get(TID) end,
	[[4153]]);	
	
get_by_type_level(2,27)->	
	 lists:map(fun([TID])->tpl_task:get(TID) end,
	[[4154]]);	
	
get_by_type_level(2,29)->	
	 lists:map(fun([TID])->tpl_task:get(TID) end,
	[[4155]]);	
	
get_by_type_level(2,31)->	
	 lists:map(fun([TID])->tpl_task:get(TID) end,
	[[4156]]);	
	
get_by_type_level(2,32)->	
	 lists:map(fun([TID])->tpl_task:get(TID) end,
	[[4157]]);	
	
get_by_type_level(2,34)->	
	 lists:map(fun([TID])->tpl_task:get(TID) end,
	[[4158]]);	
	
get_by_type_level(2,35)->	
	 lists:map(fun([TID])->tpl_task:get(TID) end,
	[[4159]]);	
	
get_by_type_level(2,36)->	
	 lists:map(fun([TID])->tpl_task:get(TID) end,
	[[4160]]);	
	
get_by_type_level(2,37)->	
	 lists:map(fun([TID])->tpl_task:get(TID) end,
	[[4161],[4164]]);	
	
get_by_type_level(_,_)->	
 [].	
