%%%------------------------------------------------	
%%% File    : tpl_tips.erl	
%%% Author  : table_to_erlang	
%%% Created : 
%%% Description:从数据库表temp_tips生成
%%% WARNING:程序生成，请不要增加手工代码！
%%%------------------------------------------------    	
 	
-module(tpl_tips). 	
-compile(export_all). 	
	
get(1002002)->
	{temp_tips, 1002002, 0, 4, <<"账号不存在">>};	
get(1002003)->
	{temp_tips, 1002003, 0, 4, <<"密码错误">>};	
get(1002004)->
	{temp_tips, 1002004, 0, 4, <<"请不要输入字母和数字以外的字符">>};	
get(1002005)->
	{temp_tips, 1002005, 0, 4, <<"输入的字母或数字长度小于6">>};	
get(1002006)->
	{temp_tips, 1002006, 0, 4, <<"输入的字母或数字长度大于12">>};	
get(1002007)->
	{temp_tips, 1002007, 0, 4, <<"两次密码输入不一致">>};	
get(1002008)->
	{temp_tips, 1002008, 0, 4, <<"该账号已被使用，请更换其他账号">>};	
get(1002009)->
	{temp_tips, 1002009, 0, 4, <<"字数不够，可以再长点">>};	
get(1002010)->
	{temp_tips, 1002010, 0, 4, <<"请不要输入特殊符号">>};	
get(1002011)->
	{temp_tips, 1002011, 0, 4, <<"该名字已被使用，请更换其他名字">>};	
get(1002012)->
	{temp_tips, 1002012, 0, 4, <<"名字太长啦，最多6个汉字">>};	
get(1002013)->
	{temp_tips, 1002013, 0, 4, <<"对不起，请勿输入非法字符">>};	
get(1002014)->
	{temp_tips, 1002014, 0, 4, <<"师出必有名，请先输入角色名">>};	
get(1002015)->
	{temp_tips, 1002015, 0, 4, <<"请先选择服务器">>};	
get(1101001)->
	{temp_tips, 1101001, 0, 4, <<"系统繁忙，请重试">>};	
get(1101002)->
	{temp_tips, 1101002, 0, 4, <<"对不起，找不到对应的商品，请联系GM">>};	
get(1101003)->
	{temp_tips, 1101003, 0, 4, <<"不能太贪心，超过限购个数啦">>};	
get(1101004)->
	{temp_tips, 1101004, 0, 4, <<"兑换物品不足">>};	
get(1302001)->
	{temp_tips, 1302001, 0, 4, <<"先提升品阶后才能继续提升成长">>};	
get(1302002)->
	{temp_tips, 1302002, 0, 4, <<"成长已达满级">>};	
get(1302003)->
	{temp_tips, 1302003, 1, 4, <<"铜钱不足">>};	
get(1302004)->
	{temp_tips, 1302004, 0, 4, <<"成功提升成长！">>};	
get(1303001)->
	{temp_tips, 1303001, 0, 4, <<"成功进阶！">>};	
get(1304001)->
	{temp_tips, 1304001, 0, 4, <<"成功提升资质！">>};	
get(1304002)->
	{temp_tips, 1304002, 0, 4, <<"成功增加祝福值，请再接再厉">>};	
get(1305001)->
	{temp_tips, 1305001, 0, 4, <<"成功幻化宠物！">>};	
get(1305002)->
	{temp_tips, 1305002, 0, 4, <<"成功使用该形象！">>};	
get(1305003)->
	{temp_tips, 1305003, 0, 4, <<"成功续期形象！">>};	
get(1305004)->
	{temp_tips, 1305004, 0, 4, <<"正在使用该形象，无需幻化">>};	
get(1307001)->
	{temp_tips, 1307001, 0, 4, <<"请先学习低级技能">>};	
get(1307002)->
	{temp_tips, 1307002, 0, 4, <<"当前宠物技能数已满">>};	
get(1307003)->
	{temp_tips, 1307003, 0, 4, <<"宠物技能槽不足">>};	
get(1307004)->
	{temp_tips, 1307004, 0, 4, <<"成功移除技能">>};	
get(1307005)->
	{temp_tips, 1307005, 0, 4, <<"成功升级技能！">>};	
get(1307006)->
	{temp_tips, 1307006, 0, 4, <<"缺少下一级技能书">>};	
get(1307007)->
	{temp_tips, 1307007, 0, 4, <<"成功学习新技能！">>};	
get(1307008)->
	{temp_tips, 1307008, 0, 4, <<"已学会该技能，无需重复学习">>};	
get(1309001)->
	{temp_tips, 1309001, 0, 4, <<"散卡数不足，无法兑换">>};	
get(1309002)->
	{temp_tips, 1309002, 0, 4, <<"兑换成功">>};	
get(1309003)->
	{temp_tips, 1309003, 0, 4, <<"背包已满，道具以邮件形式发出，注意查收">>};	
get(1402001)->
	{temp_tips, 1402001, 0, 4, <<"等级不足">>};	
get(1402002)->
	{temp_tips, 1402002, 0, 4, <<"铜币不足">>};	
get(1402003)->
	{temp_tips, 1402003, 0, 4, <<"坐骑已至最大星阶">>};	
get(1402004)->
	{temp_tips, 1402004, 0, 4, <<"技能达到最大等级">>};	
get(1402005)->
	{temp_tips, 1402005, 0, 4, <<"幻化不存在或已过期">>};	
get(1402006)->
	{temp_tips, 1402006, 0, 4, <<"1阶升阶丹不足">>};	
get(1402007)->
	{temp_tips, 1402007, 0, 4, <<"2阶升阶丹不足">>};	
get(1402008)->
	{temp_tips, 1402008, 0, 4, <<"3阶升阶丹不足">>};	
get(1402009)->
	{temp_tips, 1402009, 0, 4, <<"4阶升阶丹不足">>};	
get(1402010)->
	{temp_tips, 1402010, 0, 4, <<"5阶升阶丹不足">>};	
get(1402011)->
	{temp_tips, 1402011, 0, 4, <<"6阶升阶丹不足">>};	
get(1402012)->
	{temp_tips, 1402012, 0, 4, <<"7阶升阶丹不足">>};	
get(1402013)->
	{temp_tips, 1402013, 0, 4, <<"8阶升阶丹不足">>};	
get(1402014)->
	{temp_tips, 1402014, 0, 4, <<"9阶升阶丹不足">>};	
get(1402015)->
	{temp_tips, 1402015, 0, 4, <<"升星丹不足">>};	
get(1402016)->
	{temp_tips, 1402016, 0, 4, <<"元宝不足">>};	
get(1402017)->
	{temp_tips, 1402017, 0, 4, <<"不在坐骑上">>};	
get(1402018)->
	{temp_tips, 1402018, 0, 4, <<"已在坐骑上">>};	
get(1402019)->
	{temp_tips, 1402019, 0, 4, <<"坐骑幻化成功">>};	
get(1402020)->
	{temp_tips, 1402020, 0, 4, <<"坐骑星阶不足，幻化形象未开启">>};	
get(1402021)->
	{temp_tips, 1402021, 0, 4, <<"幻化卡不足">>};	
get(1402022)->
	{temp_tips, 1402022, 0, 4, <<"是否消耗背包中的幻化卡激活该形象？">>};	
get(1402023)->
	{temp_tips, 1402023, 0, 4, <<"坐骑获得进阶形象">>};	
get(1402024)->
	{temp_tips, 1402024, 0, 4, <<"幻化卡已过期">>};	
get(1402025)->
	{temp_tips, 1402025, 0, 4, <<"是否激活/延期该形象？">>};	
get(1402026)->
	{temp_tips, 1402026, 0, 4, <<"坐骑形象成功激活">>};	
get(2001001)->
	{temp_tips, 2001001, 0, 4, <<"请先退出副本后再进入">>};	
get(2001002)->
	{temp_tips, 2001002, 0, 4, <<"等级不足，无法进入该副本">>};	
get(2001003)->
	{temp_tips, 2001003, 0, 4, <<"副本次数已满，请明日再来">>};	
get(2001004)->
	{temp_tips, 2001004, 0, 4, <<"暂未到副本开放时间">>};	
get(2001005)->
	{temp_tips, 2001005, 0, 4, <<"副本时间所剩不多，请快速通关">>};	
get(2001006)->
	{temp_tips, 2001006, 0, 4, <<"副本时间到，你已被传出副本">>};	
get(2001007)->
	{temp_tips, 2001007, 0, 4, <<"副本已通关，10秒后自动离开副本">>};	
get(2001008)->
	{temp_tips, 2001008, 0, 4, <<"副本里不可以使用筋斗云">>};	
get(2002001)->
	{temp_tips, 2002001, 3, 4, <<"不能移动到该位置">>};	
get(2002002)->
	{temp_tips, 2002002, 0, 4, <<"无法进入该地图">>};	
get(2002003)->
	{temp_tips, 2002003, 0, 4, <<"等级不足,无法进入该地图">>};	
get(3102001)->
	{temp_tips, 3102001, 0, 4, <<"开启技能系统，赶快升级吧！">>};	
get(3102002)->
	{temp_tips, 3102002, 0, 4, <<"当前有可升级的技能">>};	
get(3102003)->
	{temp_tips, 3102003, 0, 4, <<"技能升级成功！">>};	
get(3102004)->
	{temp_tips, 3102004, 0, 4, <<"请先选择攻击目标">>};	
get(3102005)->
	{temp_tips, 3102005, 0, 4, <<"技能正在冷却中">>};	
get(3102006)->
	{temp_tips, 3102006, 0, 4, <<"能量值不足">>};	
get(3102007)->
	{temp_tips, 3102007, 0, 4, <<"怒气值不足">>};	
get(3102008)->
	{temp_tips, 3102008, 0, 4, <<"当前状态下不能攻击！">>};	
get(3102009)->
	{temp_tips, 3102009, 0, 4, <<"不能攻击友方！">>};	
get(3102010)->
	{temp_tips, 3102010, 0, 4, <<"技能无效！">>};	
get(3102011)->
	{temp_tips, 3102011, 0, 4, <<"当前地图不支持PK">>};	
get(3102012)->
	{temp_tips, 3102012, 0, 4, <<"目标处于无敌状态，攻击无伤害">>};	
get(3102013)->
	{temp_tips, 3102013, 0, 4, <<"开始技能吟唱！">>};	
get(3102014)->
	{temp_tips, 3102014, 0, 4, <<"能量值不足">>};	
get(3102015)->
	{temp_tips, 3102015, 0, 4, <<"距离不足">>};	
get(3102016)->
	{temp_tips, 3102016, 0, 4, <<"请先学习该技能！">>};	
get(3102017)->
	{temp_tips, 3102017, 0, 4, <<"目标已死亡">>};	
get(3102018)->
	{temp_tips, 3102018, 0, 4, <<"技能未学习">>};	
get(3102019)->
	{temp_tips, 3102019, 0, 4, <<"不能使用被动技能">>};	
get(3202001)->
	{temp_tips, 3202001, 0, 4, <<"获得了1.5倍的经验加成效果！">>};	
get(3202002)->
	{temp_tips, 3202002, 0, 4, <<"筋斗云不足，无法传送">>};	
get(3202003)->
	{temp_tips, 3202003, 0, 4, <<"金创药CD中，暂时无法使用">>};	
get(3302001)->
	{temp_tips, 3302001, 0, 4, <<"经脉加速成功！消耗经脉加速卡*1">>};	
get(3302002)->
	{temp_tips, 3302002, 0, 4, <<"经脉加速卡不足，无法加速">>};	
get(3302003)->
	{temp_tips, 3302003, 0, 4, <<"经脉1修炼已完成！">>};	
get(3302004)->
	{temp_tips, 3302004, 0, 4, <<"经脉2修炼成功！">>};	
get(3302005)->
	{temp_tips, 3302005, 0, 4, <<"资源不足！">>};	
get(3501001)->
	{temp_tips, 3501001, 0, 4, <<"已进入帮派PK模式地图">>};	
get(3501002)->
	{temp_tips, 3501002, 0, 4, <<"已进入PK地图">>};	
get(3501003)->
	{temp_tips, 3501003, 0, 4, <<"您正在被其他玩家攻击！">>};	
get(3601001)->
	{temp_tips, 3601001, 0, 4, <<"复活成功！">>};	
get(4002001)->
	{temp_tips, 4002001, 0, 4, <<"成功添加好友">>};	
get(4002002)->
	{temp_tips, 4002002, 0, 4, <<"成功增加好感度">>};	
get(4002003)->
	{temp_tips, 4002003, 0, 4, <<"删除好友成功">>};	
get(4002004)->
	{temp_tips, 4002004, 0, 4, <<"好友已经到达上限，请整理好友名单">>};	
get(4002005)->
	{temp_tips, 4002005, 0, 4, <<"仇人已经到达上限，请整理仇人名单">>};	
get(4002006)->
	{temp_tips, 4002006, 0, 4, <<"屏蔽已经到达上限，请整理屏蔽名单">>};	
get(4002007)->
	{temp_tips, 4002007, 0, 4, <<"对方已经是你的好友">>};	
get(4002008)->
	{temp_tips, 4002008, 0, 4, <<"不能加仇人为好友">>};	
get(4002009)->
	{temp_tips, 4002009, 0, 4, <<"找不到该玩家，请重新输入">>};	
get(4002010)->
	{temp_tips, 4002010, 0, 4, <<"对方等级不足，无法加好友">>};	
get(4002011)->
	{temp_tips, 4002011, 0, 4, <<"该道具无法使用，请联系GM">>};	
get(4002012)->
	{temp_tips, 4002012, 0, 4, <<"鲜花数量不足">>};	
get(4002013)->
	{temp_tips, 4002013, 0, 4, <<"已超过每天免费送花数量">>};	
get(4002014)->
	{temp_tips, 4002014, 0, 4, <<"对方等级不足，无法送花">>};	
get(4002101)->
	{temp_tips, 4002101, 0, 4, <<"需要达到35级才能创建帮派">>};	
get(4002102)->
	{temp_tips, 4002102, 0, 4, <<"已成功发送加入申请，请等待帮主通过">>};	
get(4002103)->
	{temp_tips, 4002103, 0, 4, <<"已经加入了帮派">>};	
get(4002104)->
	{temp_tips, 4002104, 0, 4, <<"只有帮主才能任命副帮主">>};	
get(4002105)->
	{temp_tips, 4002105, 0, 4, <<"只有帮主和副帮主才能转让职位">>};	
get(4002106)->
	{temp_tips, 4002106, 0, 4, <<"只有帮主和副帮主才能开除成员">>};	
get(4002107)->
	{temp_tips, 4002107, 0, 4, <<"二级帮派才能学习该技能">>};	
get(4002108)->
	{temp_tips, 4002108, 0, 4, <<"三级帮派才能学习该技能">>};	
get(4002109)->
	{temp_tips, 4002109, 0, 4, <<"当前等级不足">>};	
get(4002110)->
	{temp_tips, 4002110, 0, 4, <<"当前帮派贡献不足">>};	
get(4002111)->
	{temp_tips, 4002111, 0, 4, <<"今天的学习次数已经用完">>};	
get(4002112)->
	{temp_tips, 4002112, 0, 4, <<"恭喜成功升级帮派技能！">>};	
get(4002113)->
	{temp_tips, 4002113, 0, 4, <<"帮派技能等级已经达到上限">>};	
get(4002114)->
	{temp_tips, 4002114, 0, 4, <<"恭喜成功升级帮派建筑！">>};	
get(4002115)->
	{temp_tips, 4002115, 0, 4, <<"只有帮主副帮主才能进行升级操作">>};	
get(4002116)->
	{temp_tips, 4002116, 0, 4, <<"商店等级不可超过主殿等级">>};	
get(4002117)->
	{temp_tips, 4002117, 0, 4, <<"商店已经达到最高等级">>};	
get(4002118)->
	{temp_tips, 4002118, 0, 4, <<"帮派资金不足">>};	
get(4002119)->
	{temp_tips, 4002119, 0, 4, <<"帮派贡献值不足，通过充值和帮派捐献可以增加">>};	
get(4002120)->
	{temp_tips, 4002120, 0, 4, <<"成功捐献帮派物资！">>};	
get(4002121)->
	{temp_tips, 4002121, 0, 4, <<"帮派仓库空间不足，请先提升仓库等级">>};	
get(4002122)->
	{temp_tips, 4002122, 0, 4, <<"成功提交申请，请等待批准">>};	
get(4002123)->
	{temp_tips, 4002123, 0, 4, <<"仓库已经达到最高等级">>};	
get(4002124)->
	{temp_tips, 4002124, 0, 4, <<"仓库等级不可超过主殿等级">>};	
get(4002125)->
	{temp_tips, 4002125, 0, 4, <<"宝树已经达到最高等级">>};	
get(4002126)->
	{temp_tips, 4002126, 0, 4, <<"宝树等级不可超过主殿等级">>};	
get(4002127)->
	{temp_tips, 4002127, 0, 4, <<"宝树成熟时间未到，请下次再来">>};	
get(4002128)->
	{temp_tips, 4002128, 0, 4, <<"今日摇晃次数已经用完，请改日再来">>};	
get(4002129)->
	{temp_tips, 4002129, 0, 4, <<"成功摇晃帮派宝树，请速速采集">>};	
get(4002130)->
	{temp_tips, 4002130, 0, 4, <<"帮派宝树掉落了大量宝物，请速速前去采集">>};	
get(4002131)->
	{temp_tips, 4002131, 0, 4, <<"道具“建帮令”不足">>};	
get(4002132)->
	{temp_tips, 4002132, 0, 4, <<"帮派名称长度为2-4个汉字">>};	
get(4002133)->
	{temp_tips, 4002133, 0, 4, <<"帮派名称已经存在">>};	
get(4002134)->
	{temp_tips, 4002134, 0, 4, <<"你已经申请了多个帮派，请等待审核通过">>};	
get(4002135)->
	{temp_tips, 4002135, 0, 4, <<"帮派已经满员，不能再申请了">>};	
get(4002136)->
	{temp_tips, 4002136, 0, 4, <<"帮派不存在或者出错啦">>};	
get(4002137)->
	{temp_tips, 4002137, 0, 4, <<"您已经申请过该帮派">>};	
get(4002138)->
	{temp_tips, 4002138, 0, 4, <<"只能加入同阵营帮派">>};	
get(4002139)->
	{temp_tips, 4002139, 0, 4, <<"功能暂未开放，敬请期待">>};	
get(4002140)->
	{temp_tips, 4002140, 0, 4, <<"已通过该玩家申请">>};	
get(4002141)->
	{temp_tips, 4002141, 0, 4, <<"已拒绝该玩家申请">>};	
get(4002142)->
	{temp_tips, 4002142, 0, 4, <<"成功任命副帮主！">>};	
get(4002143)->
	{temp_tips, 4002143, 0, 4, <<"成功开除成员">>};	
get(4002144)->
	{temp_tips, 4002144, 0, 4, <<"成功转让职位！">>};	
get(4002145)->
	{temp_tips, 4002145, 0, 4, <<"不能开除自己">>};	
get(4002146)->
	{temp_tips, 4002146, 0, 4, <<"不能开除帮主">>};	
get(4002147)->
	{temp_tips, 4002147, 0, 4, <<"该玩家已离开本帮">>};	
get(4002148)->
	{temp_tips, 4002148, 0, 4, <<"该玩家不在线，暂时无法查看">>};	
get(4002149)->
	{temp_tips, 4002149, 0, 4, <<"你已经有帮派了，无法重复创建">>};	
get(4002150)->
	{temp_tips, 4002150, 0, 4, <<"操作失败">>};	
get(4002151)->
	{temp_tips, 4002151, 0, 4, <<"操作成功">>};	
get(4002152)->
	{temp_tips, 4002152, 0, 4, <<"你已经加入帮派，无法创建">>};	
get(4002153)->
	{temp_tips, 4002153, 0, 4, <<"恭喜创建帮派成功！">>};	
get(4002154)->
	{temp_tips, 4002154, 0, 4, <<"成功退出帮派">>};	
get(5002005)->
	{temp_tips, 5002005, 0, 4, <<"性别不符">>};	
get(5002006)->
	{temp_tips, 5002006, 0, 4, <<"背包已满，请先清理背包">>};	
get(5002007)->
	{temp_tips, 5002007, 0, 4, <<"请先放入装备">>};	
get(5002008)->
	{temp_tips, 5002008, 0, 4, <<"强化石不足">>};	
get(5002009)->
	{temp_tips, 5002009, 0, 4, <<"洗练石不足">>};	
get(5002010)->
	{temp_tips, 5002010, 0, 4, <<"洗练锁数量不足">>};	
get(5002011)->
	{temp_tips, 5002011, 0, 4, <<"前5个宝石孔无法重复镶嵌">>};	
get(5002012)->
	{temp_tips, 5002012, 0, 4, <<"宝石不足">>};	
get(5002013)->
	{temp_tips, 5002013, 0, 4, <<"请先放入宝石">>};	
get(5002016)->
	{temp_tips, 5002016, 0, 4, <<"神炼石不足">>};	
get(5002017)->
	{temp_tips, 5002017, 0, 4, <<"金油不足">>};	
get(5002019)->
	{temp_tips, 5002019, 1, 4, <<"铜钱不足">>};	
get(5002020)->
	{temp_tips, 5002020, 0, 4, <<"绑定铜钱不足">>};	
get(5002021)->
	{temp_tips, 5002021, 0, 4, <<"战场荣誉不足">>};	
get(5002022)->
	{temp_tips, 5002022, 0, 4, <<"战场功勋不足">>};	
get(5002023)->
	{temp_tips, 5002023, 0, 4, <<"已达今日购买上限">>};	
get(5002024)->
	{temp_tips, 5002024, 0, 4, <<"交易成功">>};	
get(5002025)->
	{temp_tips, 5002025, 0, 4, <<"你已取消交易">>};	
get(5002026)->
	{temp_tips, 5002026, 0, 4, <<"对方取消交易">>};	
get(5002027)->
	{temp_tips, 5002027, 0, 4, <<"对方背包空间不足">>};	
get(5002028)->
	{temp_tips, 5002028, 0, 4, <<"你的背包空间不足">>};	
get(5002029)->
	{temp_tips, 5002029, 0, 4, <<"请选择要拆分的物品">>};	
get(5002030)->
	{temp_tips, 5002030, 0, 4, <<"数量为1，无法拆分">>};	
get(5002031)->
	{temp_tips, 5002031, 0, 4, <<"物品不存在">>};	
get(5002032)->
	{temp_tips, 5002032, 0, 4, <<"物品不属于你">>};	
get(5002033)->
	{temp_tips, 5002033, 0, 4, <<"物品位置不正确">>};	
get(5002034)->
	{temp_tips, 5002034, 0, 4, <<"掉落物不存在或者已过期">>};	
get(5002035)->
	{temp_tips, 5002035, 0, 4, <<"成功扩展背包格子！">>};	
get(5002036)->
	{temp_tips, 5002036, 0, 4, <<"原材料不足">>};	
get(5002037)->
	{temp_tips, 5002037, 0, 4, <<"初级强化石不足">>};	
get(5002038)->
	{temp_tips, 5002038, 0, 4, <<"中级强化石不足">>};	
get(5002039)->
	{temp_tips, 5002039, 0, 4, <<"高级强化石不足">>};	
get(5002040)->
	{temp_tips, 5002040, 0, 4, <<"特级强化石不足">>};	
get(5002041)->
	{temp_tips, 5002041, 0, 4, <<"顶级强化石不足">>};	
get(5002042)->
	{temp_tips, 5002042, 0, 4, <<"已锁定全部属性，请先解锁">>};	
get(5002043)->
	{temp_tips, 5002043, 0, 4, <<"职业不符，无法使用">>};	
get(5002044)->
	{temp_tips, 5002044, 0, 4, <<"等级不足，无法使用">>};	
get(5002045)->
	{temp_tips, 5002045, 0, 4, <<"性别不符，无法使用">>};	
get(5002046)->
	{temp_tips, 5002046, 0, 4, <<"CD中，无法使用">>};	
get(5201001)->
	{temp_tips, 5201001, 0, 4, <<"请先选中欲购买的拍卖物品">>};	
get(5201002)->
	{temp_tips, 5201002, 0, 4, <<"携带的非绑定元宝不足，交易失败">>};	
get(5201003)->
	{temp_tips, 5201003, 0, 4, <<"背包已满，物品以邮件方式寄出，请查收">>};	
get(5201004)->
	{temp_tips, 5201004, 0, 4, <<"请输入关键字">>};	
get(5201005)->
	{temp_tips, 5201005, 0, 4, <<"请在左边列表选择查看类别或输入关键字查询">>};	
get(5201006)->
	{temp_tips, 5201006, 0, 4, <<"请先选中欲取消拍卖的物品">>};	
get(5201007)->
	{temp_tips, 5201007, 0, 4, <<"背包已满，物品以邮件方式返回，请查收">>};	
get(5201008)->
	{temp_tips, 5201008, 0, 4, <<"没有上架任何拍卖物品">>};	
get(5201009)->
	{temp_tips, 5201009, 0, 4, <<"绑定物品不能拍卖">>};	
get(5201010)->
	{temp_tips, 5201010, 0, 4, <<"没有提交任何求购需求">>};	
get(5201011)->
	{temp_tips, 5201011, 0, 4, <<"请先选中求购条目">>};	
get(5201012)->
	{temp_tips, 5201012, 0, 4, <<"请先提交拍卖物">>};	
get(5201013)->
	{temp_tips, 5201013, 0, 4, <<"拍卖数量不能为0">>};	
get(5201014)->
	{temp_tips, 5201014, 0, 4, <<"拍卖价格不能为0">>};	
get(5201015)->
	{temp_tips, 5201015, 0, 4, <<"周卡及以上VIP玩家有权限拍卖并免除税费">>};	
get(5201016)->
	{temp_tips, 5201016, 0, 4, <<"可同时上架拍卖的单数已至极限">>};	
get(5201017)->
	{temp_tips, 5201017, 0, 4, <<"上架成功">>};	
get(5201018)->
	{temp_tips, 5201018, 0, 4, <<"请先选中求购需求">>};	
get(5201019)->
	{temp_tips, 5201019, 0, 4, <<"你的背包中无此物品">>};	
get(5201020)->
	{temp_tips, 5201020, 0, 4, <<"该需求已关闭">>};	
get(5201021)->
	{temp_tips, 5201021, 0, 4, <<"出售数量不能为0">>};	
get(5201022)->
	{temp_tips, 5201022, 0, 4, <<"该需求已变化，请刷新后重新出售">>};	
get(5201023)->
	{temp_tips, 5201023, 0, 4, <<"你的收益以邮件的方式寄出，请查收">>};	
get(5201024)->
	{temp_tips, 5201024, 0, 4, <<"该拍卖单已经关闭">>};	
get(5201025)->
	{temp_tips, 5201025, 0, 4, <<"请先选中要求购的物品">>};	
get(5201026)->
	{temp_tips, 5201026, 0, 4, <<"周卡及以上VIP玩家有权限求购">>};	
get(5201027)->
	{temp_tips, 5201027, 0, 4, <<"求购数量不能为0">>};	
get(5201028)->
	{temp_tips, 5201028, 0, 4, <<"求购单价不能为0">>};	
get(5201029)->
	{temp_tips, 5201029, 0, 4, <<"欲替换已存在求购需求，求购单价必须更高">>};	
get(5201030)->
	{temp_tips, 5201030, 0, 4, <<"欲替换已存在求购需求，求购总价必须更高">>};	
get(5201031)->
	{temp_tips, 5201031, 0, 4, <<"您的元宝不足，求购失败">>};	
get(5201032)->
	{temp_tips, 5201032, 0, 4, <<"没有找到相关信息">>};	
get(5201033)->
	{temp_tips, 5201033, 0, 4, <<"您不能购买自己拍卖的物品">>};	
get(5201034)->
	{temp_tips, 5201034, 0, 4, <<"该物品不可以拍卖">>};	
get(5201035)->
	{temp_tips, 5201035, 0, 4, <<"成功取消拍卖">>};	
get(5201036)->
	{temp_tips, 5201036, 0, 4, <<"求购需求成功上架，请您耐心等待卖方回应">>};	
get(5201037)->
	{temp_tips, 5201037, 0, 4, <<"交易成功">>};	
get(5201038)->
	{temp_tips, 5201038, 0, 4, <<"您不可以出售给自己的求购需求">>};	
get(5201039)->
	{temp_tips, 5201039, 0, 4, <<"市场暂时没有该求购需求">>};	
get(6002001)->
	{temp_tips, 6002001, 0, 4, <<"发布成功">>};	
get(6002002)->
	{temp_tips, 6002002, 0, 4, <<"领取成功">>};	
get(6002003)->
	{temp_tips, 6002003, 0, 4, <<"刷新师门任务成功">>};	
get(6002004)->
	{temp_tips, 6002004, 0, 4, <<"师门令不足，无法刷新">>};	
get(6002005)->
	{temp_tips, 6002005, 0, 4, <<"元宝不足,无法完成">>};	
get(6002006)->
	{temp_tips, 6002006, 0, 4, <<"已到达今日发布上限">>};	
get(6002007)->
	{temp_tips, 6002007, 0, 4, <<"已到达领取上限">>};	
get(6002008)->
	{temp_tips, 6002008, 0, 4, <<"成功完成!">>};	
get(6002009)->
	{temp_tips, 6002009, 0, 4, <<"已到达今日领取上限">>};	
get(7002001)->
	{temp_tips, 7002001, 0, 4, <<"加入帮派后，才能查看相关信息">>};	
get(7002002)->
	{temp_tips, 7002002, 0, 4, <<"每天最多崇拜10次，请明天再来">>};	
get(7002003)->
	{temp_tips, 7002003, 0, 4, <<"操作的太快了，请休息一会儿">>};	
get(7104001)->
	{temp_tips, 7104001, 0, 4, <<"商城升级">>};	
get(7104002)->
	{temp_tips, 7104002, 0, 4, <<"购买刷新所得物品后，祝福值将清0，商城降1级">>};	
get(7104003)->
	{temp_tips, 7104003, 0, 4, <<"完成交易">>};	
get(7104004)->
	{temp_tips, 7104004, 0, 4, <<"背包空间不足，剩余道具以邮件形式寄出">>};	
get(7104005)->
	{temp_tips, 7104005, 0, 4, <<"元宝不足">>};	
get(7104006)->
	{temp_tips, 7104006, 0, 4, <<"不能同时锁定藏宝阁中全部物品">>};	
get(7104007)->
	{temp_tips, 7104007, 0, 4, <<"这里的一切都是个谜~">>};	
get(7104008)->
	{temp_tips, 7104008, 0, 4, <<"刷新时可使用绑定元宝">>};	
get(7401001)->
	{temp_tips, 7401001, 0, 4, <<"购买成功！">>};	
get(7401002)->
	{temp_tips, 7401002, 0, 4, <<"铜币不足，无法购买">>};	
get(7501001)->
	{temp_tips, 7501001, 0, 4, <<"恭喜获得30分钟体验VIP资格">>};	
get(7501002)->
	{temp_tips, 7501002, 0, 4, <<"恭喜获得1天VIP！">>};	
get(7501003)->
	{temp_tips, 7501003, 0, 4, <<"恭喜开通周VIP！">>};	
get(7501004)->
	{temp_tips, 7501004, 0, 4, <<"恭喜开通月VIP！">>};	
get(7501005)->
	{temp_tips, 7501005, 0, 4, <<"恭喜开通年VIP！">>};	
get(7501006)->
	{temp_tips, 7501006, 0, 4, <<"恭喜成功续费VIP！">>};	
get(7501007)->
	{temp_tips, 7501007, 0, 4, <<"恭喜获得至尊VIP！">>};	
get(7501008)->
	{temp_tips, 7501008, 0, 4, <<"今天已经领取了奖励，不能重复领取">>};	
get(7501009)->
	{temp_tips, 7501009, 0, 4, <<"恭喜成功领取VIP福利礼包！">>};	
get(7501010)->
	{temp_tips, 7501010, 0, 4, <<"您已是至尊VIP，无需续期VIP">>};	
get(7501011)->
	{temp_tips, 7501011, 0, 4, <<"参数错误，请联系客服协助解决">>};	
get(8008001)->
	{temp_tips, 8008001, 0, 4, <<"礼包兑换成功，请查收邮件">>};	
get(8008002)->
	{temp_tips, 8008002, 0, 4, <<"您已领取过该礼包，不可重复领取">>};	
get(8008003)->
	{temp_tips, 8008003, 0, 4, <<"CD-Key已经失效">>};	
get(8009001)->
	{temp_tips, 8009001, 0, 4, <<"分享成功">>};	
get(8009002)->
	{temp_tips, 8009002, 0, 4, <<"授权未成功">>};	
get(8009003)->
	{temp_tips, 8009003, 0, 4, <<"已邀请人数不足，暂时无法领取">>};	
get(8009004)->
	{temp_tips, 8009004, 0, 4, <<"大礼包已发送至邮箱，请查收">>};	
get(8009005)->
	{temp_tips, 8009005, 0, 4, <<"您已领取过该奖励">>};	
get(8009006)->
	{temp_tips, 8009006, 0, 4, <<"领取成功，大礼包已发送到您邮箱，请查收">>};	
get(8009007)->
	{temp_tips, 8009007, 0, 4, <<"大礼包只能领取1次，您已成功领取">>};	
get(8009008)->
	{temp_tips, 8009008, 0, 4, <<"您输入的邀请码不存在">>};	
get(8009009)->
	{temp_tips, 8009009, 0, 4, <<"亲，您不可以接受自己的邀请">>};	
get(10002001)->
	{temp_tips, 10002001, 0, 4, <<"再次点击取消挂机">>};	
get(610402001)->
	{temp_tips, 610402001, 1, 4, <<"世界BOSS即将来袭！众仙友请前往迎敌！">>};	
get(610402002)->
	{temp_tips, 610402002, 1, 4, <<"世界BOSS已经重伤！大家加油啊！">>};	
get(610402003)->
	{temp_tips, 610402003, 1, 4, <<"世界BOSS洞穴即将崩塌！众仙友请离开！">>};	
get(_)->	
	[].	
