%%--------------------------------------
%% @Module: pt_35
%% Author: Auto Generated
%% Created: Wed Mar 13 18:01:30 2013
%% Description: 
%%--------------------------------------
-module(pt_35).

%%--------------------------------------
%% Include files
%%--------------------------------------
-include("common.hrl").
-include("record.hrl").

%%--------------------------------------
%% Exported Functions
%%--------------------------------------
-compile(export_all).


%%--------------------------------------
%%Protocol: 35001 查询所有队伍(分页待定)
%%--------------------------------------
read(35001, _) ->
    {ok, []};

%%--------------------------------------
%%Protocol: 35002 查询自己队伍(队伍信息更新)
%%--------------------------------------
read(35002, _) ->
    {ok, []};

%%--------------------------------------
%%Protocol: 35011 加入队伍
%%--------------------------------------
read(35011,<<TeamId:32>>) ->
    {ok, [TeamId]};

%%--------------------------------------
%%Protocol: 35012 创建队伍
%%--------------------------------------
read(35012, _) ->
    {ok, []};

%%--------------------------------------
%%Protocol: 35013 退出所在队伍
%%--------------------------------------
read(35013, _) ->
    {ok, []};

%%--------------------------------------
%%Protocol: 35014 解散队伍
%%--------------------------------------
read(35014, _) ->
    {ok, []};

%%--------------------------------------
%%Protocol: 35015 队长踢人
%%--------------------------------------
read(35015,<<PlayerId:64>>) ->
    {ok, [PlayerId]};

%%--------------------------------------
%%Protocol: 35016 邀请玩家加入队伍
%%--------------------------------------
read(35016,<<PlayerId:64>>) ->
    {ok, [PlayerId]};

%%--------------------------------------
%%Protocol: 35017 直接可加入队伍
%%--------------------------------------
read(35017, _) ->
    {ok, []};

%%--------------------------------------
%%Protocol: 35018 成员可邀请
%%--------------------------------------
read(35018, _) ->
    {ok, []};

%%--------------------------------------
%%Protocol: 35019 转让队长
%%--------------------------------------

%%--------------------------------------
%%Protocol: 35030 新增成员信息
%%--------------------------------------

%%--------------------------------------
%%Protocol: 35031 减少的成员
%%--------------------------------------

%%--------------------------------------
%%Protocol: 35032 被踢通知
%%--------------------------------------

%%--------------------------------------
%%Protocol: 35033 入队邀请
%%--------------------------------------

%%--------------------------------------
%%Protocol: 35034 更新队长
%%--------------------------------------

%%--------------------------------------
%%Protocol: 35035 队伍解散
%%--------------------------------------

%%--------------------------------------
%% undefined command
%%--------------------------------------
read(_Cmd, _R) ->
    {error, no_match}.

%%--------------------------------------
%%Protocol: 35001 查询所有队伍(分页待定)
%%--------------------------------------
write(35001,[TeamList]) ->
    Fun_TeamList = fun([TeamId,Num,MaxNum,Uid,Level,Name]) ->
        Name_StrBin = pack_string(Name),
        <<TeamId:32,Num:8,MaxNum:8,Uid:64,Level:8,Name_StrBin/binary>>
    end,
    TeamList_Len = length(TeamList),
    TeamList_ABin = any_to_binary(lists:map(Fun_TeamList,TeamList)),
    TeamList_ABinData = <<TeamList_Len:16, TeamList_ABin/binary>>,
    {ok, pt:pack(35001, <<TeamList_ABinData/binary>>)};

%%--------------------------------------
%%Protocol: 35002 查询自己队伍(队伍信息更新)
%%--------------------------------------
write(35002,[StCode]) ->
    {ok, pt:pack(35002, <<StCode:8>>)};
write(35002,[StCode,MaxNum,MemList]) ->
    Fun_MemList = fun([Uid,Name,Level,Camp,Force]) ->
        Name_StrBin = pack_string(Name),
        <<Uid:64,Name_StrBin/binary,Level:8,Camp:8,Force:32>>
    end,
    MemList_Len = length(MemList),
    MemList_ABin = any_to_binary(lists:map(Fun_MemList,MemList)),
    MemList_ABinData = <<MemList_Len:16, MemList_ABin/binary>>,
    {ok, pt:pack(35002, <<StCode:8,MaxNum:8,MemList_ABinData/binary>>)};

%%--------------------------------------
%%Protocol: 35011 加入队伍
%%--------------------------------------
write(35011,[Result]) ->
    {ok, pt:pack(35011, <<Result:8>>)};

%%--------------------------------------
%%Protocol: 35012 创建队伍
%%--------------------------------------
write(35012,[Result]) ->
    {ok, pt:pack(35012, <<Result:8>>)};

%%--------------------------------------
%%Protocol: 35013 退出所在队伍
%%--------------------------------------
write(35013,[Result]) ->
    {ok, pt:pack(35013, <<Result:8>>)};

%%--------------------------------------
%%Protocol: 35014 解散队伍
%%--------------------------------------
write(35014,[Result]) ->
    {ok, pt:pack(35014, <<Result:8>>)};

%%--------------------------------------
%%Protocol: 35015 队长踢人
%%--------------------------------------
write(35015,[Result]) ->
    {ok, pt:pack(35015, <<Result:8>>)};

%%--------------------------------------
%%Protocol: 35016 邀请玩家加入队伍
%%--------------------------------------
write(35016,[Result]) ->
    {ok, pt:pack(35016, <<Result:8>>)};

%%--------------------------------------
%%Protocol: 35017 直接可加入队伍
%%--------------------------------------
write(35017,[Result]) ->
    {ok, pt:pack(35017, <<Result:8>>)};

%%--------------------------------------
%%Protocol: 35018 成员可邀请
%%--------------------------------------
write(35018,[Result]) ->
    {ok, pt:pack(35018, <<Result:8>>)};

%%--------------------------------------
%%Protocol: 35019 转让队长
%%--------------------------------------
write(35019,[Uid]) ->
    {ok, pt:pack(35019, <<Uid:64>>)};

%%--------------------------------------
%%Protocol: 35030 新增成员信息
%%--------------------------------------
write(35030,[Uid,Name,Level,Force]) ->
    Name_StrBin = pack_string(Name),
    {ok, pt:pack(35030, <<Uid:64,Name_StrBin/binary,Level:8,Force:32>>)};

%%--------------------------------------
%%Protocol: 35031 减少的成员
%%--------------------------------------
write(35031,[Uid]) ->
    {ok, pt:pack(35031, <<Uid:64>>)};

%%--------------------------------------
%%Protocol: 35032 被踢通知
%%--------------------------------------
write(35032,[Uid,Name]) ->
    Name_StrBin = pack_string(Name),
    {ok, pt:pack(35032, <<Uid:64,Name_StrBin/binary>>)};

%%--------------------------------------
%%Protocol: 35033 入队邀请
%%--------------------------------------
write(35033,[Uid,Name,Level,TeamId]) ->
    Name_StrBin = pack_string(Name),
    {ok, pt:pack(35033, <<Uid:64,Name_StrBin/binary,Level:8,TeamId:32>>)};

%%--------------------------------------
%%Protocol: 35034 更新队长
%%--------------------------------------
write(35034,[Uid]) ->
    {ok, pt:pack(35034, <<Uid:64>>)};

%%--------------------------------------
%%Protocol: 35035 队伍解散
%%--------------------------------------
write(35035,[TeamId]) ->
    {ok, pt:pack(35035, <<TeamId:32>>)};

%%--------------------------------------
%% undefined command 
%%--------------------------------------
write(Cmd, _R) ->
    ?ERROR_MSG("~s_errorcmd_[~p] ",[misc:time_format(game_timer:now()), Cmd]),
    {ok, pt:pack(0, <<>>)}.

%%------------------------------------
%% internal function
%%------------------------------------
pack_string(Str) ->
    BinData = tool:to_binary(Str),
    Len = byte_size(BinData),
    <<Len:16, BinData/binary>>.

any_to_binary(Any) ->
    tool:to_binary(Any).

